Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/features/shortcuts.po
Languages: fr

source: Keyboard Shortcuts
fr: Raccourcis clavier

source: Most features in novelWriter are available as keyboard shortcuts. This is a reference list of those shortcuts. Most of them are also listed in the application's user interface.
fr: La plupart des fonctionnalités de novelWriter sont disponibles sous forme de raccourcis clavier. Il s'agit d'une liste de référence de ces raccourcis. La plupart d'entre eux sont également listés dans l'interface utilisateur de l'application.

source: On MacOS, replace :kbd:`Ctrl` with :kbd:`Cmd`.
fr: Sous MacOS, remplacez :kbd:`Ctrl` par :kbd:`Cmd`.

source: Main Window Shortcuts
fr: Raccourcis de la fenêtre principale

source: Shortcut
fr: Raccourci

source: Open the online user manual
fr: Ouvrir le manuel d'utilisation en ligne

source: Open the **Build Manuscript** tool
fr: Ouvrir l'outil **Compiler le manuscrit**

source: Open the **Writing Statistics** tool
fr: Ouvrir l'outil **Statistiques d'écriture**

source: Toggle **Focus Mode**
fr: Basculer **Mode sans distraction**

source: Re-build the project's index
fr: Reconstruire l'index du projet

source: Toggle full screen mode
fr: Basculer en mode plein écran

source: Open the **Preferences** dialog
fr: Ouvrir la boîte de dialogue **Préférences**

source: Switch or toggle focus for the editor or viewer
fr: Changement ou basculement du focus de l'éditeur ou du visualisateur

source: Switch or toggle focus for the project tree or novel view
fr: Changement de focalisation de l'arborescence du projet ou de la vue du roman

source: Exit novelWriter
fr: Quitter novelWriter

source: :kbd:`Ctrl+Shift+,`
fr: :kbd:`Ctrl+Maj+,`

source: Open the **Project Settings** dialog
fr: Ouvrir la boîte de dialogue **Paramètres du projet**

source: :kbd:`Ctrl+Shift+O`
fr: :kbd:`Ctrl+Maj+O`

source: Open the Welcome dialog to open or create a project
fr: Ouvrir la boîte de dialogue de bienvenue pour ouvrir ou créer un projet

source: :kbd:`Ctrl+Shift+S`
fr: :kbd:`Ctrl+Maj+S`

source: Save the current project
fr: Enregistrer le projet en cours

source: :kbd:`Ctrl+Shift+T`
fr: :kbd:`Ctrl+Maj+T`

source: Switch focus to the outline view
fr: Basculer vers la vue d'ensemble

source: :kbd:`Ctrl+Shift+W`
fr: :kbd:`Ctrl+Maj+W`

source: Close the current project
fr: Fermer le projet en cours

source: :kbd:`Shift+F1`
fr: :kbd:`Maj+F1`

source: Open the local user manual (PDF) if it is available
fr: Ouvrir le manuel d'utilisation local (PDF) s'il est disponible

source: :kbd:`Shift+F6`
fr: :kbd:`Maj+F6`

source: Open the **Project Details** dialog
fr: Ouvrir la boîte de dialogue **Détails du projet**

source: Project Tree Shortcuts
fr: Raccourcis de l'arborescence du projet

source: Edit the label of the selected item
fr: Modifier le libellé de l'élément sélectionné

source: :kbd:`Return`
fr: :kbd:`Retour`

source: Open the selected document in the editor
fr: Ouvrir le document sélectionné dans l'éditeur

source: :kbd:`Alt+Up`
fr: :kbd:`Alt+Haut`

source: Jump or go to the previous item at same level in the tree
fr: Sauter ou aller à l'élément précédent au même niveau dans 'l'arborescence

source: :kbd:`Alt+Down`
fr: :kbd:`Alt+Bas`

source: Jump or go to the next item at same level in the tree
fr: Sauter ou aller à l'élément suivant au même niveau dans l'arborescence

source: :kbd:`Alt+Left`
fr: :kbd:`Alt+Gauche`

source: Jump to the parent item in the tree
fr: Sauter à l'élément parent dans l'arborescence

source: :kbd:`Alt+Right`
fr: :kbd:`Alt+Droite`

source: Jump to the first child item in the project tree
fr: Sauter au premier élément enfant dans l'arborescence du projet

source: Open the context menu on the selected item
fr: Ouvrir le menu contextuel de l'élément sélectionné

source: Open the **Quick Links** menu
fr: Ouvrir le menu **Liens rapides**

source: Open the **Create New Item** menu
fr: Ouvrir le menu **Créer un nouvel élément**

source: Open the selected document in the viewer
fr: Ouvrir le document sélectionné dans le visualisateur

source: :kbd:`Ctrl+Up`
fr: :kbd:`Ctrl+Haut`

source: Move selected item one step up in the tree
fr: Déplacer l'élément sélectionné d'un cran dans l'arborescence

source: :kbd:`Ctrl+Down`
fr: :kbd:`Ctrl+Bas`

source: Move selected item one step down in the tree
fr: Déplacer l'élément sélectionné d'un cran dans l'arborescence

source: :kbd:`Ctrl+Shift+Del`
fr: :kbd:`Ctrl+Maj+Suppr`

source: Move the selected item to Trash
fr: Déplacer l'élément sélectionné vers la corbeille

source: Document Editor Shortcuts
fr: Raccourcis de l'éditeur de documents

source: Text Search Shortcuts
fr: Raccourcis de recherche de texte

source: Find the next occurrence of the search word
fr: Trouver la prochaine occurrence du mot recherché

source: Open search and look for the selected word
fr: Ouvrir la recherche et rechercher le mot sélectionné

source: Open replace and look for the selected word (Mac :kbd:`Cmd+=`)
fr: Ouvrir remplacer et rechercher le mot sélectionné (Mac :kbd:`Cmd+=`)

source: :kbd:`Ctrl+Shift+1`
fr: :kbd:`Ctrl+Maj+1`

source: Replace selected occurrence, and move to the next
fr: Remplacer l'occurrence sélectionnée et passer à la suivante

source: :kbd:`Ctrl+Shift+G`
fr: :kbd:`Ctrl+Maj+G`

source: Find the previous occurrence of the search word
fr: Trouver l'occurrence précédente du mot recherché

source: :kbd:`Ctrl+Shift+F`
fr: :kbd:`Ctrl+Maj+F`

source: Open project search and look for the selected word
fr: Ouvrir la recherche de projet et recherchez le mot sélectionné

source: :kbd:`Shift+F3`
fr: :kbd:`Maj+F3`

source: Text Formatting Shortcuts
fr: Raccourcis de mise en forme du texte

source: Wrap selected text, or word under cursor, in single quotes
fr: Mettre le texte sélectionné, ou le mot sous le curseur, entre guillemets simples

source: Wrap selected text, or word under cursor, in double quotes
fr: Mettre le texte sélectionné, ou le mot sous le curseur, entre guillemets

source: Toggle comment format for block or selected text
fr: Modifier le format des commentaires pour le bloc ou le texte sélectionné

source: Remove format for block or selected text
fr: Supprimer le format d'un bloc ou d'un texte sélectionné

source: Change block format to heading level 1
fr: Modifier le format du bloc au niveau de titre 1

source: Change block format to heading level 2
fr: Modifier le format du bloc en titre de niveau 2

source: Change block format to heading level 3
fr: Modifier le format du bloc en titre de niveau 3

source: Change block format to heading level 4
fr: Modifier le format du bloc en titre de niveau 4

source: Change block alignment to left-aligned
fr: Aligner le bloc à gauche

source: Change block alignment to centred
fr: Aligner le bloc au centre

source: Change block alignment to right-aligned
fr: Aligner le bloc à droite

source: Add a left margin to the block
fr: Ajouter une marge gauche au bloc

source: Add a right margin to the block
fr: Ajouter une marge droite au bloc

source: Format selected text, or word under cursor, with bold
fr: Formater le texte sélectionné, ou le mot sous le curseur, en gras

source: Format selected text, or word under cursor, with strike through
fr: Formater le texte sélectionné, ou le mot sous le curseur, en le barrant

source: Format selected text, or word under cursor, with italic
fr: Formater le texte sélectionné, ou le mot sous le curseur, avec de l'italique

source: :kbd:`Ctrl+Shift+/`
fr: :kbd:`Ctrl+Maj+/`

source: :kbd:`Ctrl+Shift+D`
fr: :kbd:`Ctrl+Maj+D`

source: Toggle ignored text format for block or selected text
fr: Basculer le format de texte ignoré pour le bloc ou le texte sélectionné

source: Other Editor Shortcuts
fr: Autres raccourcis de l'éditeur

source: Re-run the spell checker on the document
fr: Ré-exécuter le correcteur orthographique sur le document

source: Open the context menu at the current cursor location
fr: Ouvrir le menu contextuel à l'emplacement actuel du curseur

source: Select all text in the document
fr: Sélectionner tout le texte dans le document

source: Copy selected text to clipboard
fr: Copier le texte sélectionné dans le presse-papiers

source: Activate the insert commands (see list in :ref:`docs_features_shortcuts_insert`)
fr: Activer les commandes d'insertion (voir la liste dans :ref:`docs_features_shortcuts_insert`)

source: Open or reload the current document in the viewer
fr: Ouvrir ou recharger le document en cours dans le visualisateur

source: Save the current document
fr: Enregistrer le document en cours

source: Paste text from clipboard to cursor position
fr: Coller le texte du presse-papiers à la position du curseur

source: Close the current document
fr: Fermer le document en cours

source: Cut selected text to clipboard
fr: Couper le texte sélectionné dans le presse-papiers

source: Redo latest undo
fr: Rétablir la dernière annulation

source: Undo latest changes
fr: Annuler les dernières modifications

source: :kbd:`Ctrl+Backspace`
fr: :kbd:`Ctrl+Retour arrière`

source: Delete the word before the cursor
fr: Supprimer le mot précédant le curseur

source: :kbd:`Ctrl+Del`
fr: :kbd:`Ctrl+Suppr`

source: Delete the word after the cursor
fr: Supprimer le mot après le curseur

source: Toggle spell checking
fr: Vérifier l'orthographe

source: :kbd:`Ctrl+Return`
fr: :kbd:`Ctrl+Retour`

source: Open the tag or reference under the cursor in the viewer
fr: Ouvrir la balise ou la référence sous le curseur dans le visualiseur

source: :kbd:`Ctrl+Shift+A`
fr: :kbd:`Ctrl+Maj+A`

source: Select all text in the current paragraph
fr: Sélectionner tout le texte du paragraphe en cours

source: Insert Shortcuts
fr: Raccourcis d'insertion

source: A set of insert features are also available through shortcuts, but they require a double combination of key sequences. The insert feature is activated with :kbd:`Ctrl+K`, followed by a key or key combination for the inserted content.
fr: Un ensemble de fonctions d'insertion sont également disponibles par le biais de raccourcis, mais elles nécessitent une double combinaison de séquences de touches. La fonction d'insertion est activée avec :kbd:`Ctrl+K`, suivi d'une touche ou d'une combinaison de touches pour le contenu inséré.

source: :kbd:`Ctrl+K`, :kbd:`Space`
fr: :kbd:`Ctrl+K`, :kbd:`Espace`

source: Insert a non-breaking space
fr: Insérer un espace insécable

source: Insert a long dash (em dash)
fr: Insérer un tiret long

source: Insert an ellipsis
fr: Insérer un point de suspension

source: Insert a modifier apostrophe
fr: Insérer une apostrophe

source: Insert a list bullet
fr: Insérer une puce de liste

source: Insert a per mille symbol
fr: Insérer un symbole pour mille

source: Insert a figure dash (same width as a number)
fr: Insérer un tiret (de la même largeur qu'un chiffre)

source: Insert a short dash (en dash)
fr: Insérer un tiret court

source: Insert a left single quote
fr: Insérer un guillemet simple gauche

source: Insert a right single quote
fr: Insérer un guillemet simple à droite

source: Insert a left double quote
fr: Insérer un double guillemet gauche

source: Insert a right double quote
fr: Insérer un double guillemet droit

source: Insert a ``@char`` keyword
fr: Insérer un mot-clé ``@char``

source: Insert an ``@entity`` keyword
fr: Insérer un mot-clé ``@entity``

source: Insert a ``@focus`` keyword
fr: Insérer un mot-clé ``@focus``

source: Insert a ``@tag`` keyword
fr: Insérer un mot-clé ``@tag``

source: Insert a short description comment
fr: Insérer un bref commentaire de description

source: Insert a ``@location`` keyword
fr: Insérer un mot-clé ``@location``

source: Insert a ``@mention`` keyword
fr: Insérer un mot-clé ``@mention``

source: Insert an ``@object`` keyword
fr: Insérer un mot-clé ``@object``

source: Insert a ``@plot`` keyword
fr: Insérer un mot-clé `@plot``

source: Insert a synopsis comment
fr: Insérer un commentaire de synopsis

source: Insert a ``@time`` keyword
fr: Insérer un mot-clé ``@time``

source: Insert a ``@pov`` keyword
fr: Insérer un mot-clé ``@pov``

source: Insert a ``@custom`` keyword
fr: Insérer un mot-clé ``@custom``

source: :kbd:`Ctrl+K`, :kbd:`Ctrl+Space`
fr: :kbd:`Ctrl+K`, :kbd:`Ctrl+Espace`

source: Insert a thin non-breaking space
fr: Insérer un espace fin insécable

source: Insert a horizontal bar (quotation dash)
fr: Insérer une barre horizontale

source: Insert a prime
fr: Insérer une prime

source: Insert a double prime
fr: Insérer une double prime

source: Insert a flower mark (alternative bullet)
fr: Insérer une fleur (puce alternative)

source: Insert a hyphen bullet (alternative bullet)
fr: Insérer une puce à tiret (puce alternative)

source: Insert a division sign
fr: Insérer un signe de division

source: Insert a degree symbol
fr: Insérer un symbole de degré

source: :kbd:`Ctrl+K`, :kbd:`Shift+Space`
fr: :kbd:`Ctrl+K`, :kbd:`Maj+Espace`

source: Insert a thin space
fr: Insérer un espace fin

source: Document Viewer Shortcuts
fr: Raccourcis de la fenêtre de visualisation des documents

source: Move backward in the view history
fr: Reculer dans l'historique des vues

source: Move forward in the view history
fr: Avancer dans l'historique des vues

source: :kbd:`Ctrl+Shift+R`
fr: :kbd:`Ctrl+Maj+R`

source: Close the document viewer
fr: Fermer l'afficheur de documents
