Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/more/customise.po
Languages: fr

source: Customisations
fr: Personnalisations

source: There are a few ways you can customise novelWriter yourself. Currently, you can add new GUI themes, your own syntax themes, and install additional dictionaries.
fr: Vous pouvez personnaliser novelWriter de plusieurs façons. Actuellement, vous pouvez ajouter de nouveaux thèmes d'interface graphique, vos propres thèmes de syntaxe et installer des dictionnaires supplémentaires.

source: Spell Check Dictionaries
fr: Dictionnaires de vérification orthographique

source: novelWriter uses Enchant_ as the spell checking tool. Depending on your operating system, it may or may not load all installed spell check dictionaries automatically.
fr: novelWriter utilise Enchant_ comme outil de vérification orthographique. Selon votre système d'exploitation, il peut ou non charger automatiquement tous les dictionnaires de vérification orthographique installés.

source: Linux and MacOS
fr: Linux et MacOS

source: On Linux and MacOS, you generally only have to install hunspell, aspell or myspell dictionaries on your system like you do for other applications. See your distro or OS documentation for how to do this. These dictionaries should show up as available spell check languages in novelWriter.
fr: Sous Linux et MacOS, il vous suffit généralement d'installer les dictionnaires hunspell, aspell ou myspell sur votre système, comme vous le faites pour d'autres applications. Consultez la documentation de votre distro ou de votre système d'exploitation pour savoir comment procéder. Ces dictionnaires devraient apparaître comme des langues de vérification orthographique disponibles dans novelWriter.

source: For Windows, English is included with the installation. For other languages you have to download and add dictionaries yourself.
fr: Pour Windows, l'anglais est inclus dans l'installation. Pour les autres langues, vous devez télécharger et ajouter les dictionnaires vous-même.

source: **Install Tool**
fr: **Outil d'installation**

source: A small tool to assist with this can be found under **Tools > Add Dictionaries**. It will import spell checking dictionaries from Free Office or Libre Office extensions. The dictionaries are then installed in the install location for the Enchant library and should thus work for any application that uses Enchant for spell checking.
fr: Un petit outil pour vous aider se trouve sous **Outils > Ajouter des dictionnaires**. Il importera des dictionnaires de vérification orthographique à partir des extensions Free Office ou Libre Office. Les dictionnaires sont alors installés dans l'emplacement d'installation de la bibliothèque Enchant et devraient donc fonctionner pour toute application qui utilise Enchant pour la vérification orthographique.

source: **Manual Install**
fr: **Installation manuelle**

source: If you prefer to do this manually or want to use a different source than the ones mentioned above, You need to get compatible dictionary files for your language. You need two files files ending with ``.aff`` and ``.dic``. These files must then be copied to the following location:
fr: Si vous préférez le faire manuellement ou si vous voulez utiliser une source différente de celles mentionnées ci-dessus, vous devez obtenir des fichiers de dictionnaires compatibles avec votre langue. Vous avez besoin de deux fichiers se terminant par ``.aff`` et ``.dic``. Ces fichiers doivent ensuite être copiés à l'emplacement suivant :

source: This assumes your user profile is stored at ``C:\Users\<USER>``. The last one or two folders may not exist, so you may need to create them.
fr: Cela suppose que votre profil d'utilisateur est stocké dans ``C:\Users\<USER>``. Le dernier ou les deux derniers dossiers peuvent ne pas exister, vous devrez donc les créer.

source: You can find the various dictionaries on the `Free Desktop`_ website.
fr: Vous pouvez trouver les différents dictionnaires sur le site web `Free Desktop`_.

source: The Free Desktop link points to a repository, and what may look like file links inside the dictionary folder are actually links to web pages. If you right-click and download those, you get HTML files, not dictionaries!
fr: Le lien Free Desktop pointe vers un référentiel, et ce qui peut ressembler à des liens de fichiers à l'intérieur du dossier du dictionnaire sont en fait des liens vers des pages web. Si vous cliquez avec le bouton droit de la souris et que vous les téléchargez, vous obtiendrez des fichiers HTML, pas des dictionnaires !

source: In order to download the actual dictionary files, right-click the "plain" label at the end of each line and download that.
fr: Pour télécharger les fichiers du dictionnaire, cliquez avec le bouton droit de la souris sur l'étiquette « plain » à la fin de chaque ligne et téléchargez-la.

source: Syntax and GUI Themes
fr: Syntaxe et thèmes de l'interface graphique

source: Adding your own GUI and syntax themes is relatively easy, although it requires that you manually edit config files with colour values. The themes are defined by simple plain text config files with meta data and colour settings.
fr: L'ajout de vos propres thèmes d'interface graphique et de syntaxe est relativement facile, bien qu'il soit nécessaire d'éditer manuellement les fichiers de configuration avec les valeurs de couleur. Les thèmes sont définis par de simples fichiers de configuration en texte brut contenant des métadonnées et des paramètres de couleur.

source: In order to make your own versions, first copy one of the existing files to your local computer and modify it as you like.
fr: Pour créer vos propres versions, copiez d'abord l'un des fichiers existants sur votre ordinateur local et modifiez-le à votre guise.

source: The existing syntax themes are stored in `novelwriter/assets/syntax <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/syntax>`_.
fr: Les thèmes syntaxiques existants sont stockés dans `novelwriter/assets/syntax <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/syntax>`_.

source: The existing GUI themes are stored in `novelwriter/assets/themes <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/themes>`_.
fr: Les thèmes GUI existants sont stockés dans `novelwriter/assets/themes <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/themes>`_.

source: The existing icon themes are stored in `novelwriter/assets/icons <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/icons>`_.
fr: Les thèmes d'icônes existants sont stockés dans `novelwriter/assets/icons <https://github.com/vkbo/novelWriter/tree/main/novelwriter/assets/icons>`_.

source: Remember to also change the name of your theme by modifying the ``name`` setting at the top of the file, otherwise you may not be able to distinguish them in **Preferences**.
fr: N'oubliez pas de changer également le nom de votre thème en modifiant le paramètre ``name`` en haut du fichier, sinon vous ne pourrez pas les distinguer dans les **Préférences**.

source: For novelWriter to be able to locate the custom theme files, you must copy them to the :ref:`docs_technical_locations_data` location in your home or user area. There should be a folder there named ``syntax`` for syntax themes, just ``themes`` for GUI themes, and ``icons`` for icon themes. These folders are created the first time you start novelWriter.
fr: Pour que novelWriter puisse localiser les fichiers de thèmes personnalisés, vous devez les copier dans l'emplacement :ref:`docs_technical_locations_data` dans votre espace personnel ou utilisateur. Il devrait y avoir un dossier nommé ``syntax`` pour les thèmes de syntaxe, juste ``themes`` pour les thèmes GUI, et ``icons`` pour les thèmes d'icônes. Ces dossiers sont créés la première fois que vous démarrez novelWriter. Traduit avec DeepL.com (version gratuite)

source: Once the files are copied there, they should show up in **Preferences** with the label you set as ``name`` inside the file.
fr: Une fois les fichiers copiés, ils devraient apparaître dans les **Préférences** avec le nom que vous avez défini dans le fichier.

source: The theme file formats change regularly in new releases. It is up to you to keep custom theme files up to date.
fr: Les formats des fichiers de thème changent régulièrement dans les nouvelles versions. C'est à vous qu'il incombe de mettre à jour les fichiers des thèmes personnalisés.

source: Custom GUI and Icons Theme
fr: Thème d'interface graphique et d'icônes personnalisé

source: A GUI theme ``.conf`` file consists of the following settings:
fr: Le fichier ``.conf`` d'un thème GUI est constitué des paramètres suivants :

source: In the Main section you must at least define the ``name`` settings.
fr: Dans la section Main, vous devez au moins définir les paramètres ``name``.

source: The Palette values correspond to the Qt enum values for ``QPalette::ColorRole``, see the `Qt documentation <https://doc.qt.io/qt-6/qpalette.html#ColorRole-enum>`_ for more details. The colour values are RGB numbers on the format ``r, g, b`` where each is an integer from ``0`` to ``255``. Omitted values are not loaded and will use default values. If the ``helptext`` colour is not defined, it is computed as a colour between the ``window`` and ``windowtext`` colour. Additional shades of some of the colours are also computed. These are mainly used for 3D effects.
fr: Les valeurs de la palette correspondent aux valeurs de l'enum Qt pour ``QPalette::ColorRole``, voir la documentation Qt <https://doc.qt.io/qt-6/qpalette.html#ColorRole-enum>`_ pour plus de détails. Les valeurs de couleur sont des nombres RVB au format ``r, g, b`` où chacun est un entier de ``0`` à ``255``. Les valeurs omises ne sont pas chargées et utilisent les valeurs par défaut. Si la couleur ``helptext`` n'est pas définie, elle est calculée comme une couleur comprise entre les couleurs ``window`` et ``windowtext``. Des nuances supplémentaires de certaines couleurs sont également calculées. Elles sont principalement utilisées pour les effets 3D.

source: The ``fadedtext`` and ``errortext`` theme colour entries were added.
fr: Les entrées de couleur des thèmes ``fadedtext`` et ``errortext`` ont été ajoutées.

source: The ``icontheme`` setting was dropped as the icon theme is now its own setting. The ``[Icons]`` and ``[Project]`` sections were added, and the ``status*`` settings removed.
fr: Le paramètre ``icontheme`` a été supprimé car le thème des icônes a maintenant son propre paramètre. Les sections ``[Icons]`` et ``[Project]`` ont été ajoutées, et le paramètre ``status*`` a été supprimé.

source: Custom Syntax Theme
fr: Syntaxe des thèmes personnalisés

source: A syntax theme ``.conf`` file consists of the following settings:
fr: Un fichier ``.conf`` de thème est constitué des paramètres suivants :

source: In the Main section, you must define at least the ``name`` setting. The Syntax colour values are RGB(A) numbers of the format ``r, g, b, a`` where each is an integer from ``0`` to ``255``. The fourth value is the alpha channel, which can be omitted.
fr: Dans la section Main, vous devez définir au moins le paramètre ``name``. Les valeurs de couleur de la syntaxe sont des nombres RVB(A) du format ``r, g, b, a`` où chacun est un entier de ``0`` à ``255``. La quatrième valeur est le canal alpha, qui peut être omis.

source: Omitted syntax colours default to black, except ``background`` which defaults to white, and ``texthighlight`` which defaults to white with half transparency.
fr: Les couleurs omises dans la syntaxe prennent par défaut la couleur noire, à l'exception de ``background`` qui prend par défaut la couleur blanche, et de ``texthighlight`` qui prend par défaut la couleur blanche avec une demi-transparence.

source: The ``shortcode`` syntax colour entry was added.
fr: Le paramètre de couleur ``shortcode`` a été ajouté.

source: The ``optional`` syntax colour entry was added.
fr: Le paramètre de couleur ``optional`` a été ajouté.

source: The ``texthighlight`` syntax colour entry was added.
fr: Le paramètre de couleur ``texthighlight`` a été ajouté.

source: The ``dialog``, ``altdialog``, ``note`` and ``tag`` syntax colour entries were added. ``straightquotes``, ``doublequotes`` and ``singlequotes`` were removed.
fr: Les paramètres de couleur ``dialog``, ``altdialog``, ``note`` et ``tag`` ont été ajoutés. Les paramètres ``guillemets droits``, ``guillemets doubles`` et ``guillemets simples`` ont été supprimés.
