Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/technical/storage.po
Languages: fr

source: How Data is Stored
fr: Comment les données sont stockées

source: This chapter contains details of how novelWriter stores and handles the project data.
fr: Ce chapitre contient des détails sur la manière dont novelWriter stocke et gère les données du projet.

source: Overview
fr: Présentation générale

source: The files of a novelWriter project are stored in a dedicated project folder. The project structure is kept in a file at the root of this folder called ``nwProject.nwx``. All the document files and associated meta data are stored in other folders below the project folder.
fr: Les fichiers d'un projet novelWriter sont stockés dans un dossier dédié au projet. La structure du projet est conservée dans un fichier à la racine de ce dossier appelé ``nwProject.nwx``. Tous les fichiers de documents et les métadonnées associées sont stockés dans d'autres dossiers sous le dossier du projet.

source: This way of storing data was chosen for several reasons.
fr: Ce mode de stockage des données a été choisi pour plusieurs raisons.

source: Firstly, all the text you add to your project is saved directly to your project folder in separate files. Only the project structure and the text you are currently editing is stored in memory at any given time, which means there is a smaller risk of losing data if the application or your computer crashes.
fr: Tout d'abord, tout le texte que vous ajoutez à votre projet est enregistré directement dans le dossier de votre projet, dans des fichiers séparés. Seule la structure du projet et le texte que vous êtes en train d'éditer sont stockés en mémoire à un moment donné, ce qui signifie qu'il y a moins de risque de perdre des données si l'application ou votre ordinateur tombe en panne.

source: Secondly, having multiple small files means it is very easy to synchronise them between computers with standard file synchronisation tools.
fr: Deuxièmement, le fait d'avoir plusieurs petits fichiers signifie qu'il est très facile de les synchroniser entre ordinateurs à l'aide d'outils de synchronisation de fichiers standard.

source: Thirdly, if you use `version control`_ software to track the changes to your project, the file formats used for the files are well suited. All the JSON documents have line breaks and indents as well, which makes it easier to track them with version control software.
fr: Troisièmement, si vous utilisez un logiciel de `contrôle de version`_ pour suivre les modifications apportées à votre projet, les formats utilisés pour les fichiers sont bien adaptés. Tous les documents JSON comportent des sauts de ligne et des retraits, ce qui facilite leur suivi avec un logiciel de contrôle de version.

source: Since novelWriter has to keep track of a bunch of files and folders when a project is open, it may not run well on some virtual file systems. A file or folder must be accessible with exactly the path it was saved or created with. An example where this is not the case is the way Google Drive is mapped on Linux Gnome desktops using gvfs/gio.
fr: Comme novelWriter doit garder la trace d'un grand nombre de fichiers et de dossiers lorsqu'un projet est ouvert, il peut ne pas fonctionner correctement sur certains systèmes de fichiers virtuels. Un fichier ou un dossier doit être accessible avec exactement le chemin avec lequel il a été sauvegardé ou créé. Un exemple où ce n'est pas le cas est la façon dont Google Drive est mappé sur les bureaux Linux Gnome en utilisant gvfs/gio.

source: You should not add additional files to the project folder yourself. Nor should you, as a rule, manually edit files within it. If you really must manually edit the text files, e.g. with some automated task you want to perform, you need to rebuild the Project Index when you open the project again.
fr: Vous ne devez pas ajouter vous-même des fichiers supplémentaires au dossier du projet. En règle générale, vous ne devez pas non plus modifier manuellement les fichiers qui s'y trouvent. Si vous devez vraiment modifier manuellement les fichiers texte, par exemple dans le cadre d'une tâche automatisée, vous devez reconstruire l'index du projet lorsque vous ouvrez à nouveau le projet.

source: Editing text files in the ``content`` folder is less risky as these are just plain text. Editing the main project XML file, however, may make the project file unreadable and you may crash novelWriter and lose project structure information and project settings.
fr: L'édition de fichiers texte dans le dossier ``content`` est moins risquée car il s'agit de texte simple. Cependant, éditer le fichier XML du projet principal peut rendre le fichier du projet illisible et vous risquez de planter novelWriter et de perdre les informations sur la structure et les paramètres du projet.

source: Project Structure
fr: Structure du projet

source: All novelWriter files are written with utf-8 encoding. Since Python automatically converts Unix line endings to Windows line endings on Windows systems, novelWriter does not make any adaptations to the formatting on Windows systems. This is handled entirely by the Python standard library. Python also handles this when working on the same files on both Windows and Unix-based operating systems.
fr: Tous les fichiers novelWriter sont écrits avec l'encodage utf-8. Comme Python convertit automatiquement les fins de ligne Unix en fins de ligne Windows sur les systèmes Windows, novelWriter ne fait aucune adaptation au formatage sur les systèmes Windows. Ceci est entièrement géré par la bibliothèque standard de Python. Python s'en occupe également lorsqu'il travaille sur les mêmes fichiers sur les systèmes d'exploitation Windows et Unix.

source: Main Project File
fr: Fichier principal du projet

source: The project itself requires a dedicated folder for storing its files, where novelWriter will create its own "file system" where the project's folder and file hierarchy is described in a project XML file. This is the main project file in the project's root folder with the name ``nwProject.nwx``. This file also contains all the meta data required for the project (except the index data), and a number of related project settings.
fr: Le projet lui-même nécessite un dossier dédié pour stocker ses fichiers, où novelWriter créera son propre « système de fichiers » où la hiérarchie des dossiers et des fichiers du projet est décrite dans un fichier XML du projet. C'est le fichier principal du projet dans le dossier racine du projet avec le nom ``nwProject.nwx``. Ce fichier contient également toutes les métadonnées requises pour le projet (à l'exception des données d'index), ainsi qu'un certain nombre de paramètres liés au projet.

source: If this file is lost or corrupted, the structure of the project is lost, although not the text itself. It is important to keep this file backed up, either through the built-in backup tool, or your own backup solution.
fr: Si ce fichier est perdu ou corrompu, la structure du projet est perdue, mais pas le texte lui-même. Il est important de sauvegarder ce fichier, soit à l'aide de l'outil de sauvegarde intégré, soit à l'aide de votre propre solution de sauvegarde.

source: The project XML file is indent-formatted, and is suitable for diff tools and version control since most of the file will stay static, although a timestamp is set in the meta section on line 2, and various meta data entries incremented, on each save.
fr: Le fichier XML du projet est formaté en indentation et convient aux outils de comparaison et de contrôle de version, car la majeure partie du fichier reste statique, bien qu'un horodatage soit défini dans la section méta à la ligne 2 et que diverses entrées de données méta soient incrémentées à chaque enregistrement.

source: A full project file format specification is available under "More Documents".
fr: Une spécification complète du format de fichier du projet est disponible sous « Plus d'informations ».

source: Project Documents
fr: Documents de projet

source: All the project documents are saved in a subfolder of the main project folder named ``content``. Each document has a file handle based on a 52 bit random number, represented as a hexadecimal string. The documents are saved with a filename assembled from this handle and the file extension ``.nwd``.
fr: Tous les documents du projet sont enregistrés dans un sous-dossier du dossier principal du projet nommé ``content``. Chaque document possède un identifiant de fichier basé sur un nombre aléatoire de 52 bits, représenté sous la forme d'une chaîne hexadécimale. Les documents sont enregistrés avec un nom de fichier assemblé à partir de cet identifiant et de l'extension ``.nwd``.

source: If you wish to find the file system location of a document in the project, you can either look it up in the project XML file, select **Show File Details** from the **Document** menu when having the document open in the editor, or look in the ``ToC.txt`` file in the root of the project folder. The ``ToC.txt`` file has a list of all documents in the project, referenced by their label, and where they are saved.
fr: Si vous souhaitez trouver l'emplacement du système de fichiers d'un document dans le projet, vous pouvez soit le rechercher dans le fichier XML du projet, soit sélectionner **Afficher les détails du fichier** dans le menu **Document** lorsque le document est ouvert dans l'éditeur, soit rechercher dans le fichier ``ToC.txt`` à la racine du dossier du projet. Le fichier ``ToC.txt`` contient une liste de tous les documents du projet, référencés par leur étiquette, et l'endroit où ils sont sauvegardés.

source: The reason for this cryptic file naming is to avoid issues with file naming conventions and restrictions on different operating systems, and also to have a file name that does not depend on what you name the document within the project, or changes it to. This is particularly useful when using a versioning system.
fr: La raison de ce nom de fichier cryptique est d'éviter les problèmes liés aux conventions de dénomination des fichiers et aux restrictions sur les différents systèmes d'exploitation, et aussi d'avoir un nom de fichier qui ne dépend pas du nom que vous donnez au document dans le projet, ou des modifications que vous lui apportez. Ceci est particulièrement utile lors de l'utilisation d'un système de gestion des versions.

source: Each document file contains a plain text version of the text from the editor. The file can in principle be edited in any text editor, and is suitable for diffing and version control if so desired. Just make sure the file remains in utf-8 encoding, otherwise unicode characters may become mangled when the file is opened in novelWriter again.
fr: Chaque fichier de document contient une version en texte brut du texte de l'éditeur. Le fichier peut en principe être édité dans n'importe quel éditeur de texte, et convient pour le diffing et le contrôle de version si on le souhaite. Assurez-vous simplement que le fichier reste en encodage utf-8, sinon les caractères unicode risquent d'être altérés lorsque le fichier est ouvert dans novelWriter.

source: Editing these files is generally not recommended. The reason for this is that the index will not be automatically updated when doing so, which means novelWriter doesn't know you've altered the file. If you *do* edit a file in this manner, you should rebuild the index when you next open the project in novelWriter.
fr: Il est généralement déconseillé de modifier ces fichiers. La raison en est que l'index ne sera pas automatiquement mis à jour, ce qui signifie que novelWriter ne sait pas que vous avez modifié le fichier. Si vous modifiez un fichier de cette manière, vous devez reconstruire l'index lorsque vous ouvrez le projet dans novelWriter.

source: The first lines of the file may contain some meta data starting with the characters ``%%~``. These lines are mainly there to restore some information if the file is lost from the main project file, and the information may be helpful if you do open the file in an external editor as it contains the document label and the document class and layout. The lines can be deleted without any consequences to the rest of the content of the file, and will be added back the next time the document is saved in novelWriter.
fr: Les premières lignes du fichier peuvent contenir des métadonnées commençant par les caractères ``%%~``. Ces lignes sont principalement là pour restaurer certaines informations si le fichier est perdu dans le fichier principal du projet, et ces informations peuvent être utiles si vous ouvrez le fichier dans un éditeur externe car elles contiennent l'étiquette du document ainsi que la classe et la mise en page du document. Les lignes peuvent être supprimées sans conséquences pour le reste du contenu du fichier, et seront ajoutées la prochaine fois que le document sera sauvegardé dans novelWriter.

source: The File Saving Process
fr: Le processus d'enregistrement des fichiers

source: When saving the project file, or any of the documents, the data is first saved to a temporary file. If successful, the old data file is then removed, and the temporary file replaces it. This ensures that the previously saved data is only replaced when the new data has been successfully saved to the storage medium.
fr: Lors de l'enregistrement du fichier de projet ou de l'un des documents, les données sont d'abord enregistrées dans un fichier temporaire. En cas de succès, l'ancien fichier de données est alors supprimé et remplacé par le fichier temporaire. Cela garantit que les données précédemment enregistrées ne sont remplacées que lorsque les nouvelles données ont été enregistrées avec succès sur le support de stockage.

source: Project Meta Data
fr: Métadonnées du projet

source: The project folder contains a subfolder named ``meta``, containing a number of files. The meta folder contains semi-important files. That is, they can be lost with only minor impact to the project. All files in this folder are JSON or JSON Lines files, although some other files may remain from earlier versions of novelWriter as they haven't all been JSON files in the past.
fr: Le dossier du projet contient un sous-dossier nommé ``meta``, contenant un certain nombre de fichiers. Le dossier meta contient des fichiers semi-importants. C'est-à-dire qu'ils peuvent être perdus avec un impact mineur sur le projet. Tous les fichiers de ce dossier sont des fichiers JSON ou JSON Lines, bien que certains autres fichiers puissent provenir de versions antérieures de novelWriter, car ils n'ont pas tous été des fichiers JSON dans le passé.

source: If you use version control software on your project, you can exclude this folder, although you may want to track the session log file and the custom words list.
fr: Si vous utilisez un logiciel de contrôle de version pour votre projet, vous pouvez exclure ce dossier, même si vous souhaitez suivre le fichier journal de la session et la liste des mots personnalisés.

source: The Project Index
fr: L'index des projets

source: Between writing sessions, the project index is saved in a JSON file in ``meta/index.json``. This file is not critical. If it is lost, it can be completely rebuilt from within novelWriter from the **Tools** menu.
fr: Entre les sessions d'écriture, l'index du projet est sauvegardé dans un fichier JSON dans ``meta/index.json``. Ce fichier n'est pas critique. S'il est perdu, il peut être complètement reconstruit à partir de novelWriter dans le menu **Outils**.

source: The index is maintained and updated whenever a document or note is saved in the editor. It contains all references and tags in documents and notes, as well as the location of all headers in the project, and the word counts within each header section.
fr: L'index est maintenu et mis à jour chaque fois qu'un document ou une note est enregistré dans l'éditeur. Il contient toutes les références et les balises des documents et des notes, ainsi que l'emplacement de tous les en-têtes dans le projet et le nombre de mots dans chaque section de l'en-tête.

source: The integrity of the index is checked when the file is loaded. It is possible to corrupt the index if the file is manually edited and manipulated, so the check is important to avoid sudden crashes of novelWriter. If the file contains errors, novelWriter will automatically build it anew. If the check somehow fails and novelWriter keeps crashing, you can delete the file manually and rebuild the index. If this too fails, you have likely encountered a bug.
fr: L'intégrité de l'index est vérifiée lorsque le fichier est chargé. Il est possible de corrompre l'index si le fichier est édité et manipulé manuellement, c'est pourquoi cette vérification est importante pour éviter les plantages soudains de novelWriter. Si le fichier contient des erreurs, novelWriter le reconstruira automatiquement. Si la vérification échoue d'une manière ou d'une autre et que novelWriter continue à se bloquer, vous pouvez supprimer le fichier manuellement et reconstruire l'index. Si cela échoue également, vous avez probablement rencontré un bogue.

source: Build Definitions
fr: Définitions des compilations

source: The build definitions from the **Manuscript Build** tool are kept in the ``meta/builds.json`` file. If this file is lost, all custom build definitions are lost too.
fr: Les définitions de construction de l'outil **Compilation du manuscrit** sont conservées dans le fichier ``meta/builds.json``. Si ce fichier est perdu, toutes les définitions de construction personnalisées sont également perdues.

source: Cached GUI Options
fr: Options de l'interface graphique mises en cache

source: A file named ``meta/options.json`` contains the latest state of various GUI buttons, switches, dialog window sizes, column sizes, etc, from the GUI. These are the GUI settings that are specific to the project. Global GUI settings are stored in the main config file.
fr: Un fichier nommé ``meta/options.json`` contient le dernier état des différents boutons de l'interface graphique, des commutateurs, de la taille des fenêtres de dialogue, de la taille des colonnes, etc, de l'interface graphique. Ce sont les paramètres de l'interface graphique qui sont spécifiques au projet. Les paramètres globaux de l'interface graphique sont stockés dans le fichier de configuration principal.

source: The file is not critical, but if it is lost, all such GUI options will revert back to their default settings.
fr: Le fichier n'est pas critique, mais s'il est perdu, toutes les options de l'interface graphique reviendront à leurs paramètres par défaut.

source: Custom Word List
fr: Liste des mots personnalisés

source: A file named ``meta/userdict.json`` contains all the custom words you've added to the project for spell checking purposes. The content of the file can be edited from the **Tools** menu. If you lose this file, all your custom spell check words will be lost too.
fr: Un fichier nommé ``meta/userdict.json`` contient tous les mots personnalisés que vous avez ajoutés au projet à des fins de vérification orthographique. Le contenu de ce fichier peut être édité à partir du menu **Outils**. Si vous perdez ce fichier, tous vos mots personnalisés pour la vérification orthographique seront également perdus.

source: Session Stats
fr: Statistiques de la session

source: The writing progress is saved in the ``meta/sessions.jsonl`` file. This file records the length and word counts of each writing session on the given project. The file is used by the **Writing Statistics** tool. If this file is lost, the history it contains is also lost, but it has otherwise no impact on the project.
fr: La progression de l'écriture est sauvegardée dans le fichier ``meta/sessions.jsonl``. Ce fichier enregistre la durée et le nombre de mots de chaque session d'écriture sur le projet donné. Ce fichier est utilisé par l'outil **Statistiques d'écriture**. Si ce fichier est perdu, l'historique qu'il contient est également perdu, mais cela n'a par ailleurs aucun impact sur le projet.

source: Each session is recorded as a JSON object on a single line of the file. Each session record is appended tot he file.
fr: Chaque session est enregistrée sous la forme d'un objet JSON sur une seule ligne du fichier. Chaque enregistrement de session est ajouté au fichier.
