Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: fr

source: Main Page
fr: Page d'accueil

source: Using novelWriter
fr: Utiliser novelWriter

source: Organising Your Project
fr: Organiser votre projet

source: Additional Details
fr: Détails additionnels

source: Technical Topics
fr: Sujets techniques

source: User Guide
fr: Guide de l'utilisateur

source: **Release Version:** |release|
fr: **Version :** |release|

source: **Updated:** |today|
fr: **Mise à jour:** |today|

source: novelWriter is an open source plain text editor designed for writing novels assembled from individual text documents. It uses a minimal formatting syntax inspired by Markdown, and adds a meta data syntax for comments, synopsis, and cross-referencing. It is designed to be a simple text editor that allows for easy organisation of text and notes, using human readable text files as storage for robustness.
fr: novelWriter est un éditeur de texte brut open source conçu pour écrire des romans assemblés à partir de documents texte individuels. Il utilise une syntaxe de formatage minimale inspirée de Markdown, et ajoute une syntaxe de métadonnées pour les commentaires, les synopsis et les références croisées. Il est conçu pour être un éditeur de texte simple qui permet d'organiser facilement le texte et les notes, en utilisant des fichiers texte lisibles par l'homme comme stockage pour plus de robustesse.

source: The project storage is suitable for version control software, and also well suited for file synchronisation tools. All text is saved as plain text files, and your project data as standard data formats in XML and JSON. See :ref:`a_storage` for more details.
fr: Le stockage du projet est adapté aux logiciels de contrôle de version, ainsi qu'aux outils de synchronisation de fichiers.Tout le texte est sauvegardé sous forme de fichiers de texte brut, et les données de votre projet sous les formats de données standard XML et JSON.Voir :ref:`a_storage` pour plus de détails.

source: Any operating system that has Python 3 and the Qt 6 libraries should be able to run novelWriter. It runs fine on Linux, Windows and MacOS, and users have tested it on other platforms as well. See :ref:`a_started` for more details.
fr: Tout système d'exploitation disposant de Python 3 et des bibliothèques Qt 6 devrait pouvoir faire fonctionner novelWriter. Il fonctionne correctement sous Linux, Windows et MacOS, et des utilisateurs l'ont également testé sur d'autres plateformes. Voir :ref:`a_started` pour plus de détails.

source: **Useful Links**
fr: **Liens utiles**

source: Website: https://novelwriter.io
fr: Site web : https://novelwriter.io

source: Source Code: https://github.com/vkbo/novelWriter
fr: Code source : https://github.com/vkbo/novelWriter
