Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/int_howto.po
Languages: fr

source: Tips & Tricks
fr: Trucs et astuces

source: This is a list of hopefully helpful little tips on how to get the most out of novelWriter.
fr: Il s'agit d'une liste de petits conseils, que nous espérons utiles, sur la façon de tirer le meilleur parti de novelWriter.

source: This section will be expanded over time. If you would like to have something added, feel free to contribute, or start a discussion on the project's `Discussions Page`_.
fr: Cette section sera développée au fil du temps. Si vous souhaitez que quelque chose soit ajouté, n'hésitez pas à contribuer, ou à lancer une discussion sur la `Page des discussions`_ du projet.

source: Managing the Project
fr: Gestion du projet

source: How do I create a project from a template?
fr: Comment créer un projet à partir d'un modèle ?

source: On the Welcome dialog's **Create New Project** form, you can select to "Prefill Project" from the content of a different project. This feature is most useful if you copy a project you have dedicated to be a template project. If you have a structure and settings you want to use for every new project, this is the best solution.
fr: Dans le formulaire **Créer un nouveau projet** de la boîte de dialogue d'accueil, vous pouvez choisir de « pré-remplir le projet » à partir du contenu d'un autre projet. Cette fonction est particulièrement utile si vous copiez un projet que vous avez dédié à être un projet modèle. Si vous avez une structure et des paramètres que vous souhaitez utiliser pour chaque nouveau projet, c'est la meilleure solution.

source: How do I merge multiple documents into one?
fr: Comment fusionner plusieurs documents en un seul ?

source: If you need to merge a selection of documents in your project into a single document, you can achieve this by first making a new folder for just that purpose, and drag all the documents you want merged into this folder. Then you can right click the folder, select :guilabel:`Transform` and :guilabel:`Merge Documents in Folder`.
fr: Si vous avez besoin de fusionner une sélection de documents dans votre projet en un seul document, vous pouvez le faire en créant un nouveau dossier à cet effet, et en faisant glisser tous les documents que vous voulez fusionner dans ce dossier. Ensuite, vous pouvez faire un clic droit sur le dossier, sélectionner :guilabel:`Transformer` et :guilabel:`Fusionner les documents du dossier`.

source: In the dialog that pops up, the documents will be in the same order as in the folder, but you can rearrange them here of you wish. See :ref:`a_ui_tree_split_merge` for more details.
fr: Dans la boîte de dialogue qui s'ouvre, les documents seront dans le même ordre que dans le dossier, mais vous pouvez les réorganiser ici si vous le souhaitez. Voir :ref:`a_ui_tree_split_merge` pour plus de détails.

source: How do I share status or importance labels between projects?
fr: Comment puis-je partager des étiquettes d'état ou d'importance entre les projets ?

source: The status or importance labels you have defined in a project can be exported from **Project Settings** from the respective configuration tabs. You can then import these labels in another project.
fr: Les étiquettes d'état ou d'importance que vous avez définies dans un projet peuvent être exportées à partir de **Paramètres du projet** dans les onglets de configuration respectifs. Vous pouvez ensuite importer ces étiquettes dans un autre projet.

source: Layout Tricks
fr: Astuces de mise en page

source: How do I create a table?
fr: Comment créer un tableau ?

source: The formatting tools available in novelWriter don't allow for complex structures like tables. However, the editor does render tabs in a similar way that regular word processors do. You can set the width of a tab in **Preferences**.
fr: Les outils de formatage disponibles dans novelWriter ne permettent pas de créer des structures complexes telles que des tableaux. Cependant, l'éditeur rend les tabulations de la même manière que les traitements de texte classiques. Vous pouvez définir la largeur d'un onglet dans les **Préférences**.

source: The tab key should have the same distance in the editor as in the viewer, so you can align text in columns using the tab key, and it should look the same when viewed next to the editor.
fr: La touche de tabulation doit avoir la même distance dans l'éditeur que dans le visualiseur, de sorte que vous puissiez aligner du texte en colonnes à l'aide de la touche de tabulation, et que l'aspect soit le même lorsque vous regardez à côté de l'éditeur.

source: This is most suitable for your notes, as the result in exported documents cannot be guaranteed to match. Especially if you don't use the same font in your manuscript as in the editor.
fr: Cette méthode convient surtout à vos notes, car il n'est pas garanti que le résultat dans les documents exportés corresponde à la réalité. Surtout si vous n'utilisez pas la même police dans votre manuscrit que dans l'éditeur.

source: How do I force a line break when line breaks are ignored in my manuscript?
fr: Comment forcer un saut de ligne lorsque les sauts de ligne sont ignorés dans mon manuscrit ?

source: In the **Manuscript Build Settings** you can choose to ignore line breaks within paragraphs in your text. However, some times you still need those breaks. Like for instance on the cover page where you may need to add your name and address. In such cases, you can add ``[br]`` where you want line breaks. These breaks cannot be ignored by any settings and will always be respected.
fr: Dans les **Paramètres de construction du manuscrit**, vous pouvez choisir d'ignorer les sauts de ligne dans les paragraphes de votre texte. Cependant, ces sauts de ligne sont parfois nécessaires. Comme par exemple sur la page de couverture où vous pouvez avoir besoin d'ajouter votre nom et votre adresse. Dans ce cas, vous pouvez ajouter ``[br]`` à l'endroit où vous souhaitez des sauts de ligne. Ces sauts de ligne ne peuvent être ignorés par aucun paramètre et seront toujours respectés.

source: How do I turn off first line indent for a specific paragraph?
fr: Comment désactiver l'indentation de la première ligne pour un paragraphe spécifique ?

source: If you have first line indent enabled, but have a specific paragraph that you don't want indented, you can disable the indentation by explicitly adding text alignment. For instance by adding ``<<`` to the end to left-align it. Aligned paragraphs are not indented.
fr: Si l'indentation de la première ligne est activée, mais qu'un paragraphe spécifique ne doit pas être indenté, vous pouvez désactiver l'indentation en ajoutant explicitement l'alignement du texte. Par exemple, en ajoutant ``<<`` à la fin du paragraphe pour l'aligner à gauche. Les paragraphes alignés ne sont pas indentés.

source: See :ref:`a_fmt_align` for more details.
fr: Voir :ref:`a_fmt_align` pour plus de détails.

source: Organising Your Text
fr: Organiser son texte

source: How do I add introductory text to chapters?
fr: Comment ajouter un texte d'introduction aux chapitres ?

source: Sometimes chapters have a short preface, like a brief piece of text or a quote to set the stage before the first scene begins.
fr: Parfois, les chapitres sont précédés d'une courte préface, comme un court texte ou une citation pour planter le décor avant le début de la première scène.

source: If you add separate files for chapters and scenes, the chapter file is the perfect place to add such text. Separating chapter and scene files also allows you to make scene files child documents of the chapter.
fr: Si vous ajoutez des fichiers distincts pour les chapitres et les scènes, le fichier de chapitre est l'endroit idéal pour ajouter ce type de texte. La séparation des fichiers de chapitres et de scènes vous permet également de faire des fichiers de scènes des documents enfants du chapitre.

source: How do I distinguishing between soft and hard scene breaks?
fr: Comment faire la distinction entre les ruptures de scènes douces et les ruptures de scènes dures ?

source: Depending on your writing style, you may need to separate between soft and hard scene breaks within chapters. Like for instance if you switch point-of-view character often.
fr: En fonction de votre style d'écriture, vous pouvez avoir besoin de faire une distinction entre les ruptures de scènes douces et les ruptures de scènes dures au sein des chapitres. Par exemple, si vous changez souvent de point de vue.

source: In such cases you may want to use different scene headings for hard and soft scene breaks. The **Build Manuscript** tool will let you define a different format for scenes using the ``###`` and ``###!`` heading codes when you generate your manuscript. You can for instance add the common "``* * *``" for hard breaks and select to hide soft scene breaks, which will just insert an empty paragraph in their place. See :ref:`a_manuscript_settings` for more details.
fr: Dans ce cas, vous pouvez utiliser des en-têtes de scène différents pour les coupures de scène dures et douces. L'outil **Compiler le manuscrit** vous permettra de définir un format différent pour les scènes en utilisant les codes d'en-tête ``###`` et ``###!`` lors de la génération de votre manuscrit. Vous pouvez par exemple ajouter l'habituel « ``* * *`` » pour les coupures dures et sélectionner des coupures de scènes douces, qui inséreront simplement un paragraphe vide à leur place. Voir :ref:`a_manuscript_settings` pour plus de détails.

source: Other Tools
fr: Autres outils

source: How do I convert my project to/from the yWriter format?
fr: Comment convertir mon projet au format yWriter ?

source: There is a tool available that lets you convert a `yWriter <http://spacejock.com/yWriter7.html>`_ project to a novelWriter project, and vice versa.
fr: Il existe un outil qui vous permet de convertir un projet `yWriter <http://spacejock.com/yWriter7.html>`_ en un projet novelWriter, et vice versa.

source: The tool is available at `peter88213.github.io/yw2nw <https://peter88213.github.io/yw2nw/>`__
fr: L'outil est disponible à l'adresse `peter88213.github.io/yw2nw <https://peter88213.github.io/yw2nw/>`__
