Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/int_introduction.po
Languages: fr

source: Overview
fr: Présentation générale

source: At its core, novelWriter is a multi-document plain text editor. The idea is to let you edit your text without having to deal with formatting until you generate a draft document or manuscript. Instead, you can focus on the writing right from the start.
fr: A la base, novelWriter est un éditeur de texte brut multi-documents. L'idée est de vous permettre d'éditer votre texte sans avoir à vous préoccuper de la mise en forme jusqu'à ce que vous génériez un projet de document ou un manuscrit. Au lieu de cela, vous pouvez vous concentrer sur l'écriture dès le début.

source: Of course, you probably need *some* formatting for your text. At the very least you need emphasis. Most people are familiar with adding emphasis using ``_underscores_`` and ``**asterisks**``. This formatting standard comes from Markdown_ and is supported by novelWriter. It also uses Markdown formatting for defining document headings. If you need more specialised formatting, additional formatting options are available using a shortcode format. See :ref:`a_fmt_shortcodes` for more details.
fr: Bien sûr, vous avez probablement besoin d'une certaine mise en forme pour votre texte. Au minimum, vous avez besoin d'accentuation. La plupart des gens sont familiers avec l'ajout d'emphase en utilisant ``_underscores_`` et ``**asterisks**``. Ce standard de formatage vient de Markdown_ et est supporté par novelWriter. Il utilise également le formatage Markdown pour définir les titres du document. Si vous avez besoin d'un formatage plus spécialisé, des options de formatage supplémentaires sont disponibles en utilisant un format shortcode. Voir :ref:`a_fmt_shortcodes` pour plus de détails.

source: Limitations
fr: Restrictions

source: novelWriter is designed for writing fiction, so the formatting features available are limited to those relevant for this purpose. It is *not* suitable for technical writing, and it is *not* a full-featured Markdown editor.
fr: novelWriter est conçu pour l'écriture de fictions, et les fonctions de formatage disponibles sont donc limitées à celles qui sont pertinentes pour cet usage. Il n'est *pas* adapté à la rédaction technique et n'est *pas* un éditeur Markdown complet.

source: It is also not intended as a tool for organising research for writing, and therefore lacks formatting features you may need for this purpose. The notes feature in novelWriter is mainly intended for character profiles and plot outlines.
fr: Il n'est pas non plus conçu comme un outil d'organisation de la recherche en vue de l'écriture, et ne dispose donc pas des fonctions de formatage dont vous pourriez avoir besoin à cette fin. La fonction de notes de novelWriter est principalement destinée aux profils de personnages et aux ébauches d'intrigues.

source: Your novel project in novelWriter is organised as a collection of separate plain text documents instead of a single, large document. The idea is to make it easier to reorganise your project structure without having to cut and paste text between chapters and scenes.
fr: Votre projet de roman dans novelWriter est organisé comme une collection de documents de texte brut séparés au lieu d'un seul grand document. L'idée est de faciliter la réorganisation de la structure de votre projet sans avoir à couper et coller du texte entre les chapitres et les scènes.

source: There are two kinds of documents in your project: :term:`Novel Documents` are documents that are part of your story. The other kind of documents are :term:`Project Notes`, which are intended for your notes about your characters, your world building, and so on.
fr: Il y a deux types de documents dans votre projet : :term:`Documents du roman` sont des documents qui font partie de votre histoire. L'autre type de documents est :term:`Notes de projet`, qui sont destinés à vos notes sur vos personnages, votre construction du monde, et ainsi de suite.

source: You can at any point split the individual documents by their headings up into multiple documents, or merge multiple documents into a single document. This makes it easier to use variations of the Snowflake_ method for writing. You can start by writing larger structure-focused documents, like for instance one document per act, and later effortlessly split these up into individual chapter or scene documents.
fr: Vous pouvez à tout moment diviser les documents individuels par leurs titres en plusieurs documents ou fusionner plusieurs documents en un seul. Il est ainsi plus facile d'utiliser des variantes de la méthode Snowflake_ pour l'écriture. Vous pouvez commencer par rédiger des documents plus importants axés sur la structure, comme par exemple un document par acte, et les diviser ensuite sans effort en documents individuels de chapitres ou de scènes.

source: Key Features
fr: Fonctionnalités principales

source: Below are some key features of novelWriter.
fr: Voici quelques caractéristiques clés de novelWriter.

source: **Focus on writing**
fr: **Focus sur l'écriture**

source: The aim of the user interface is to let you focus on writing instead of spending time formatting text. Formatting is therefore limited to a small set of formatting tags for simple things like text emphasis and paragraph alignment. Additional shortcodes are available for special formatting cases when you need them.
fr: L'objectif de l'interface utilisateur est de vous permettre de vous concentrer sur l'écriture plutôt que de passer du temps à formater le texte. Le formatage est donc limité à un petit ensemble de balises de formatage pour des choses simples comme l'emphase du texte et l'alignement des paragraphes. Des shortcodes supplémentaires sont disponibles pour des cas de formatage particuliers lorsque vous en avez besoin.

source: When you really want to focus on just writing, you can switch the editor into **Focus Mode** where only the text editor panel itself is visible, and the project structure view is hidden away.
fr: Lorsque vous souhaitez vraiment vous concentrer sur l'écriture, vous pouvez basculer l'éditeur en **Mode sans distraction**, où seul le panneau de l'éditeur de texte est visible, et la vue de la structure du projet est cachée.

source: **Keep an eye on your notes**
fr: **Gardez un œil sur vos notes**

source: The main window can optionally show a document viewer to the right of the editor. The viewer is intended for displaying another scene document, your character notes, plot notes, or any other document you may need to reference while writing. It is not intended as a preview panel for the document you're editing, but if you wish, you can also use it for this purpose.
fr: La fenêtre principale peut éventuellement afficher une visionneuse de documents à droite de l'éditeur. La visionneuse est destinée à afficher un autre document de scène, vos notes de personnage, vos notes d'intrigue ou tout autre document auquel vous pourriez avoir besoin de vous référer lors de l'écriture. Il ne s'agit pas d'un panneau de prévisualisation du document que vous êtes en train d'éditer, mais si vous le souhaitez, vous pouvez également l'utiliser à cette fin.

source: **Organise your documents how you like**
fr: **Organisez vos documents à votre guise**

source: You can split your novel project up into as many individual documents as you want to. When you build the project into a manuscript, they are all glued together in the top-to-bottom order in which they appear in the project tree. You can use as few text documents as you like, but splitting the project up into chapters and scenes means you can easily reorder them using the drag-and-drop feature of the project tree. You can also start out with fewer documents and then later split them into multiple documents based on chapter and scene headings.
fr: Vous pouvez diviser votre projet de roman en autant de documents individuels que vous le souhaitez. Lorsque vous transformez le projet en manuscrit, tous les documents sont collés ensemble dans l'ordre où ils apparaissent dans l'arborescence du projet. Vous pouvez utiliser aussi peu de documents texte que vous le souhaitez, mais en divisant le projet en chapitres et en scènes, vous pouvez facilement les réorganiser à l'aide de la fonction « glisser-déposer » de l'arborescence du projet. Vous pouvez également commencer avec moins de documents, puis les diviser en plusieurs documents en fonction des titres des chapitres et des scènes.

source: **Multi-novel project support**
fr: **Support de projets de plusieurs romans**

source: The main parts of your project is split up into top level special folders called "Root" folders. Your main story text lives in the "Novel" root folder. You can have multiple such folders in a project, and rename them to whatever you want. This allows you to keep a series of individual novels with the same characters and world building in the same project, and create manuscripts for them separately.
fr: Les principales parties de votre projet sont réparties dans des dossiers spéciaux de premier niveau appelés dossiers « racine ». Le texte principal de votre histoire se trouve dans le dossier racine « Roman ». Vous pouvez avoir plusieurs dossiers de ce type dans un projet et les renommer comme vous le souhaitez. Cela vous permet de conserver une série de romans individuels avec les mêmes personnages et la même construction du monde dans le même projet, et de créer des manuscrits pour chacun d'entre eux.

source: **Keep track of your story elements**
fr: **Tracez les éléments de votre histoire**

source: All documents in your project can be assigned a :term:`tag` that you can then :term:`reference` from any other document or note. In fact, you can add a new tag under each heading of a note if you need to be able to reference specific sections of it, or you want to keep several topics or scenes in the same document.
fr: Toutes les notes de votre projet peuvent se voir attribuer un :term:`tag` que vous pouvez ensuite :term:`référencer<reference>` à partir de n'importe quel autre document ou note. En fait, vous pouvez ajouter une nouvelle balise sous chaque titre d'une note si vous avez besoin de pouvoir référencer des sections spécifiques de celle-ci, ou si vous voulez conserver plusieurs sujets dans la même note.

source: **Get an overview of your story**
fr: **Obtenez une vue d'ensemble de votre histoire**

source: It is not the documents themselves that define the chapters and scenes of your story, but the headings within them. In the **Outline View** on the main window you can see an outline of all the chapter and scene headings of each novel root folder in your project. If they have any references in them, like which character is in what chapter and scene, these are listed in additional columns.
fr: Ce ne sont pas les documents eux-mêmes qui définissent les chapitres et les scènes de votre histoire, mais les titres qu'ils contiennent. Dans la **Vue d'ensemble** de la fenêtre principale, vous pouvez voir un aperçu de tous les titres de chapitres et de scènes de chaque dossier racine de roman de votre projet. S'ils contiennent des références, par exemple quel personnage se trouve dans quel chapitre et quelle scène, celles-ci sont répertoriées dans des colonnes supplémentaires.

source: You can also add a synopsis to each chapter or scene, which can be listed here as well. You have the option to add or remove columns of information from this outline. A subset of the outline information is also available in the **Novel View** as an alternative view to the project tree.
fr: Vous pouvez également ajouter un synopsis à chaque chapitre ou scène, qui peut également être listé ici. Vous avez la possibilité d'ajouter ou de supprimer des colonnes d'informations dans ce plan. Un sous-ensemble des informations du plan est également disponible dans la **Vue roman** comme vue alternative à l'arborescence du projet.

source: **Get an overview of your story elements**
fr: **Obtenez une vue d'ensemble des éléments de votre histoire**

source: Under the document viewer panel you will find a series of tabs that show the different story elements you have created tags for. The tabs are sorted into **Characters**, **Plots**, etc, depending on which categories you are using in your story. This panel can be hidden to free up space when you don't need it.
fr: Sous le panneau de visualisation du document, vous trouverez une série d'onglets qui montrent les différents éléments de l'histoire pour lesquels vous avez créé des étiquettes. Les onglets sont classés en **Personnages**, **Intrigues**, etc., en fonction des catégories que vous utilisez dans votre histoire. Ce panneau peut être caché pour libérer de l'espace lorsque vous n'en avez pas besoin.

source: **Assembling your manuscript**
fr: **Assembler votre manuscrit**

source: Whether you want to assemble a manuscript, or export all your notes, or generate an outline of your chapters and scenes with a synopsis included, you can use the **Build Manuscript** tool to do so. The tool lets you select what information you want to include in the generated document, and how it is formatted. You can send the result to a printer, or generate an Open Document or Word Document file that can be opened by most office type word processors. You can also generate the result as HTML, or Markdown, both suitable for further conversion to other formats.
fr: Que vous souhaitiez assembler un manuscrit, exporter toutes vos notes ou générer un plan de vos chapitres et scènes avec un synopsis, vous pouvez utiliser l'outil **Compiler le manuscrit** pour le faire. Cet outil vous permet de sélectionner les informations que vous souhaitez inclure dans le document généré, ainsi que son formatage. Vous pouvez envoyer le résultat à une imprimante ou générer un fichier Open Document ou Word Document qui peut être ouvert par la plupart des traitements de texte de type bureautique. Vous pouvez également générer le résultat sous forme de HTML ou de Markdown, tous deux adaptés à une conversion ultérieure dans d'autres formats.

source: Screenshots
fr: Captures d'écran

source: novelWriter with light colour theme
fr: novelWriter avec un thème de couleur claire

source: novelWriter with dark colour theme
fr: novelWriter avec un thème de couleur sombre
