Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/int_overview.po
Languages: fr

source: What to Read First
fr: Premières lectures

source: The documentation of novelWriter is quite extensive. There are a lot of features to get used to, but you don't need to know all of them to get started.
fr: La documentation de novelWriter est assez complète. Il y a beaucoup de fonctionnalités auxquelles il faut s'habituer, mais vous n'avez pas besoin de toutes pour commencer.

source: The chapters below labelled "Essential Information" are the ones you need to know to use the application correctly. By "correctly" it is meant: in a way so novelWriter understands the basic structure of your text. It collects a lot of information from your text and uses it to display the structure of it in various ways to help you get an overview of your writing.
fr: Les chapitres ci-dessous intitulés « Informations essentielles » sont ceux que vous devez connaître pour utiliser correctement l'application. Par « correctement », on entend : de manière à ce que novelWriter comprenne la structure de base de votre texte. Il collecte de nombreuses informations à partir de votre texte et les utilise pour afficher la structure de celui-ci de différentes manières afin de vous aider à obtenir une vue d'ensemble de votre écriture.

source: The chapters labelled "Recommended Reading" includes additional information on how the different parts if the application work and what the features do.
fr: Les chapitres intitulés « Lectures recommandées » contiennent des informations supplémentaires sur le fonctionnement des différentes parties de l'application et sur les fonctionnalités.

source: The "Optional" and "Lookup" chapters contain additional information or lookup tables that are not essential for using the application.
fr: Les chapitres « Optionnel “ et ” Consulter » contiennent des informations supplémentaires ou des tables de consultation qui ne sont pas indispensables à l'utilisation de l'application.

source: Using novelWriter
fr: Utiliser novelWriter

source: In order to use novelWriter effectively, you need to know the basics of how it works. The following chapters will explain the main principles. They start with the basics, and get more detailed as you read on.
fr: Afin d'utiliser novelWriter de manière efficace, vous devez connaître les bases de son fonctionnement. Les chapitres suivants expliquent les grands principes. Ils commencent par les bases et deviennent de plus en plus détaillés au fur et à mesure de la lecture.

source: :ref:`a_breakdown` – Essential Information
fr: :ref:`a_breakdown` - Informations essentielles

source: This chapter explains the basics of how the application works and what it can and cannot do.
fr: Ce chapitre explique les bases du fonctionnement de l'application et ce qu'elle peut et ne peut pas faire.

source: :ref:`a_ui_project` – Recommended Reading
fr: :ref:`a_ui_project` - Lecture recommandée

source: This chapter will give you a more detailed explanation of how you can use the user interface components to organise and view your project work.
fr: Ce chapitre explique plus en détail comment vous pouvez utiliser les composants de l'interface utilisateur pour organiser et visualiser votre travail de projet.

source: :ref:`a_ui_writing` – Recommended Reading
fr: :ref:`a_ui_writing` - Lecture recommandée

source: This chapter will give you a more detailed explanation of how the text editor and viewer work.
fr: Ce chapitre explique plus en détail le fonctionnement de l'éditeur de texte et de l'affichage.

source: :ref:`a_fmt` – Essential Information
fr: :ref:`a_fmt` - Informations essentielles

source: This chapter covers how you should format your text. The editor is plain text, so text formatting requires some basic markup. The structure of your novel is also inferred from how you use headings. Tags and references are implemented by special keywords.
fr: Ce chapitre traite de la mise en forme du texte. L'éditeur étant du texte brut, la mise en forme du texte nécessite un balisage de base. La structure de votre roman est également déduite de la manière dont vous utilisez les titres. Les balises et les références sont mises en œuvre par des mots-clés spéciaux.

source: :ref:`a_kb` – Optional / Lookup
fr: :ref:`a_kb` - Optionnel / Consulter

source: This chapter lists all the keyboard shortcuts in novelWriter and what they do. Most of the shortcuts are also listed next to their menu entries inside the app, or in tool tips. This chapter is mostly for reference.
fr: Ce chapitre énumère tous les raccourcis clavier de novelWriter et leur fonction. La plupart des raccourcis sont également listés à côté de leurs entrées de menu dans l'application, ou dans les info-bulles. Ce chapitre est principalement destiné à servir de référence.

source: :ref:`a_typ` – Optional
fr: :ref:`a_typ` - Optionnel

source: This chapter gives you an overview of the special typographical symbols available in novelWriter. The auto-replace feature can handle the insertion of standard quote symbols for your language, and other special characters. If you use any symbols aside from these, their intended use is explained here.
fr: Ce chapitre vous donne un aperçu des symboles typographiques spéciaux disponibles dans novelWriter. La fonction de remplacement automatique peut gérer l'insertion des symboles de guillemets standard de votre langue, ainsi que d'autres caractères spéciaux. Si vous utilisez d'autres symboles, leur utilisation est expliquée ici.

source: Organising Your Projects
fr: Organiser vos projets

source: In addition to managing a collection of plain text files, novelWriter can interpret and map the structure of your novel and show you additional information about its flow and content. In order to take advantage of these features, you must structure your text in a specific way and add some meta data for it to extract.
fr: En plus de gérer une collection de fichiers de texte brut, novelWriter peut interpréter et cartographier la structure de votre roman et vous fournir des informations supplémentaires sur son déroulement et son contenu. Pour bénéficier de ces fonctionnalités, vous devez structurer votre texte d'une manière spécifique et ajouter des métadonnées à extraire.

source: :ref:`a_proj` – Essential Information
fr: :ref:`a_proj` - Informations essentielles

source: This chapter explains how you organise the content of your project, and how to set up automated backups of your work.
fr: Ce chapitre explique comment organiser le contenu de votre projet et comment mettre en place des sauvegardes automatiques de votre travail.

source: :ref:`a_struct` – Essential Information
fr: :ref:`a_struct` - Informations essentielles

source: This chapter covers the way your novel's structure is encoded into the text documents. It explains how the different levels of headings are used, and some special formatting for different kinds of headings.
fr: Ce chapitre traite de la manière dont la structure de votre roman est encodée dans les documents textuels. Il explique comment les différents niveaux d'en-têtes sont utilisés, ainsi que certains formats spéciaux pour différents types d'en-têtes.

source: :ref:`a_references` - Recommended Reading
fr: :ref:`a_references` - Lecture recommandée

source: This chapter explains how you organise your notes, and how the Tags and References system works. This system lets you cross-link your documents in your project, and display these references in the application interface.
fr: Ce chapitre explique comment organiser vos notes et comment fonctionne le système de balises et de références. Ce système vous permet d'établir des liens entre les documents de votre projet et d'afficher ces références dans l'interface de l'application.

source: :ref:`a_manuscript` - Recommended Reading
fr: :ref:`a_manuscript` - Lecture recommandée

source: This chapter explains how the **Manuscript Build** tool works, how you can control the way chapter titles are formatted, and how scene and section breaks are handled.
fr: Ce chapitre explique le fonctionnement de l'outil **Manuscript Build**, la manière dont vous pouvez contrôler le formatage des titres de chapitre et la gestion des sauts de scène et de section.

source: Additional Details & Technical Topics
fr: Détails supplémentaires et sujets techniques

source: The Additional Details and the Technical Topics sections contain more in-depth information about how various bits of novelWriter works. This information is not essential to getting started using novelWriter.
fr: Les sections Détails supplémentaires et Sujets techniques contiennent des informations plus approfondies sur le fonctionnement des différents éléments de novelWriter. Ces informations ne sont pas essentielles pour commencer à utiliser novelWriter.
