Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/int_glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: Context Menu
fr: Menu contextuel

source: A context menu is a menu that pops up when you right click something in the user interface. In novelWriter, you can often also open a context menu by pressing the keyboard shortcut :kbd:`Ctrl+.`.
fr: Un menu contextuel est un menu qui apparaît lorsque vous faites un clic droit sur quelque chose dans l'interface utilisateur. Dans novelWriter, vous pouvez également ouvrir un menu contextuel en appuyant sur le raccourci clavier :kbd:`Ctrl+.`.

source: Headings
fr: En-têtes

source: Each level of headings in :term:`Novel Documents` have a specific meaning in terms of the structure of the story. That is, they determine what novelWriter considers a partition, a chapter, a scene or a text section. For :term:`Project Notes`, the heading levels don't matter. For more details on headings in novel documents, see :ref:`a_struct_heads`.
fr: Chaque niveau d'en-têtes dans :term:`Documents du roman` a une signification spécifique en termes de structure de l'histoire. En d'autres termes, ils déterminent ce que novelWriter considère comme une partition, un chapitre, une scène ou une section de texte. Pour :term:`Notes de projet`, les niveaux d'en-tête n'ont pas d'importance. Pour plus de détails sur les en-têtes dans les documents de roman, voir :ref:`a_struct_heads`.

source: Keyword
fr: Mot-clé

source: A keyword in novelWriter is a special command you put in the text of your documents. They are not standard Markdown, but are used in novelWriter to add information that is interpreted by the application. For instance, keywords are used for :term:`tags<tag>` and :term:`references<reference>`.
fr: Un mot-clé dans novelWriter est une commande spéciale que vous placez dans le texte de vos documents. Il ne s'agit pas de Markdown standard, mais ils sont utilisés dans novelWriter pour ajouter des informations qui sont interprétées par l'application. Par exemple, les mots-clés sont utilisés pour :term:`tags<tag>` et :term:`références<reference>`.

source: Keywords must always be on their own line, and the first character of the line must always be the ``@`` character. The keyword must also always be followed by a ``:`` character, and the values passed to the command are added after this, separated by commas.
fr: Les mots-clés doivent toujours être sur leur propre ligne, et le premier caractère de la ligne doit toujours être le caractère ``@``. Le mot-clé doit également toujours être suivi du caractère ``:``, et les valeurs transmises à la commande sont ajoutées à la suite, séparées par des virgules.

source: Novel Documents
fr: Documents du roman

source: These are documents that are created under a "Novel" :term:`Root Folder`. They behave differently than :term:`Project Notes`, and have some more restrictions. For instance, they can not exist in folders intended only for project notes. See the :ref:`a_struct` chapter for more details.
fr: Il s'agit de documents créés sous un :term:`dossier racine` « Roman ». Ils se comportent différemment des :term:`Notes de projet`, et ont plus de restrictions. Par exemple, ils ne peuvent pas exister dans des dossiers destinés uniquement aux notes de projet. Voir le chapitre :ref:`a_struct` pour plus de détails.

source: Project Index
fr: Index du projet

source: The project index is a record of all headings in a project, with all their meta data like synopsis comments, :term:`tags<tag>` and :term:`references<reference>`. The project index is kept up to date automatically, but can also be regenerated manually from the :guilabel:`Tools` menu or by pressing :kbd:`F9`.
fr: L'index du projet est un enregistrement de toutes les en-têtes d'un projet, avec toutes leurs métadonnées comme les commentaires de synopsis, les :term:`tags<tag>` et les :term:`références<reference>`. L'index du projet est mis à jour automatiquement, mais il peut aussi être régénéré manuellement à partir du menu :guilabel:`Outils` ou en appuyant sur :kbd:`F9`.

source: Project Notes
fr: Notes de projet

source: Project Notes are unrestricted documents that can be placed anywhere in your project. You should not use these documents for story elements, only for notes. Project notes are the source files used by the Tags and References system. See the :ref:`a_references` chapter for more details on how to use them.
fr: Les notes de projet sont des documents libres qui peuvent être placés n'importe où dans votre projet. Vous ne devez pas utiliser ces documents pour les éléments de l'histoire, mais uniquement pour les notes. Les notes de projet sont les fichiers sources utilisés par le système de balises et de références. Voir le chapitre :ref:`a_references` pour plus de détails sur leur utilisation.

source: Reference
fr: Référence

source: A reference is one of a set of :term:`keywords<keyword>` that can be used to link to a :term:`tag` in another document. The reference keywords are specific to the different :term:`root folder` types. A full overview is available in the :ref:`a_references` chapter.
fr: Une référence fait partie d'un ensemble de :term:`mots-clés<keyword>` qui peuvent être utilisés pour établir un lien avec un :term:`tag` dans un autre document. Les mots-clés de référence sont spécifiques aux différents types de :term:`dossier racine`. Une présentation complète est disponible dans le chapitre :ref:`a_references`.

source: Root Folder
fr: Dossier racine

source: A "Root Folder" is a top level folder of the project tree in novelWriter. Each type of root folder has a specific icon to identify it. For an overview of available root folder types, see :ref:`a_proj_roots`.
fr: Un « dossier racine » est un dossier de premier niveau de l'arborescence du projet dans novelWriter. Chaque type de dossier racine possède une icône spécifique pour l'identifier. Pour une vue d'ensemble des types de dossiers racines disponibles, voir :ref:`a_proj_roots`.

source: A tag is a user defined value assigned as a tag to a section of your :term:`Project Notes`. It is optional, and can be defined once per heading. It is set using the :term:`keyword` syntax ``@tag: value``, where ``value`` is the user defined part. Each tag can be referenced in another file using one of the :term:`reference` keywords. See :ref:`a_references` chapter for more details.
fr: Un tag est une valeur définie par l'utilisateur et attribuée comme tag à une section de votre :term:`Notes de projet`. Elle est facultative et ne peut être définie qu'une seule fois par rubrique. Elle est définie en utilisant la syntaxe :term:`mot-clé` `@tag : valeur``, où `valeur`` est la partie définie par l'utilisateur. Chaque balise peut être référencée dans un autre fichier en utilisant l'un des mots-clés :term:`référence`. Voir le chapitre :ref:`a_references` pour plus de détails.
