Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/project_structure.po
Languages: fr

source: Novel Structure
fr: Structure du roman

source: This chapter covers the structure of a novel project.
fr: Ce chapitre traite de la structure d'un projet de roman.

source: There are two different types of documents in a project, **Novel Documents** and **Project Notes**. Active novel documents can only live in a **Novel** type root folder. You can also move them to **Archive** and **Trash** of course, where they become inactive.
fr: Il existe deux types de documents dans un projet, les **Documents de roman** et les **Notes de projet**. Les documents inédits actifs ne peuvent se trouver que dans un dossier racine de type **Nouveau**. Vous pouvez également les déplacer vers **Archives** et **Corbeille** bien sûr, où ils deviennent inactifs.

source: The project tree can distinguish between the different heading levels of the novel documents using coloured icons, and optionally add emphasis on the label. Emphasis can be enabled in **Preferences**.
fr: L'arborescence du projet peut distinguer les différents niveaux d'en-tête des nouveaux documents à l'aide d'icônes colorées, et éventuellement ajouter de l'emphase sur l'étiquette. L'accentuation peut être activée dans les **Préférences**.

source: Importance of Headings
fr: Importance des titres

source: Subfolders under root folders have no impact on the structure of the novel itself. The structure is instead dictated by the heading level of the headings within the documents.
fr: Les sous-dossiers des dossiers racines n'ont aucun impact sur la structure du roman lui-même. La structure est plutôt dictée par le niveau des titres des documents.

source: Four levels of headings are supported, signified by the number of hashes (``#``) preceding the title. See also the :ref:`a_fmt` section for more details about the markup syntax.
fr: Quatre niveaux de titres sont supportés, indiqués par le nombre de signes (``#``) précédant le titre. Voir aussi la section :ref:`a_fmt` pour plus de détails sur la syntaxe du balisage.

source: The heading levels are not only important when generating the manuscript, they are also used by the indexer when building the outline tree in the **Outline View** as well as in the **Novel Tree**. Each heading also starts a new region where new Tags and References can be defined. See :ref:`a_references` for more details.
fr: Les niveaux de titres ne sont pas seulement importants lors de la génération du manuscrit, ils sont également utilisés par l'indexeur lors de la construction de l'arborescence dans la **Vue d'ensemble** ainsi que dans l'**Arborescence du roman**. Chaque rubrique commence également une nouvelle région où de nouvelles étiquettes et références peuvent être définies. Voir :ref:`a_references` pour plus de détails.

source: The syntax for the four basic heading types, and the three special types, is listed in section :ref:`a_fmt_head`. The meaning of the four levels for the structure of your novel is as follows:
fr: La syntaxe des quatre types de titres de base, et des trois types spéciaux, est listée dans la section :ref:`a_fmt_head`. La signification des quatre niveaux pour la structure de votre roman est la suivante :

source: **Heading Level 1: Partition**
fr: **Titre de niveau 1 : Section**

source: This heading level signifies that the text refers to a top level heading. This is useful when you want to split the manuscript up into books, parts, or acts. These headings are not required. The novel title itself should use the special heading level ``#!`` covered in :ref:`a_fmt_head`.
fr: Ce niveau de titre signifie que le texte se réfère à un titre de niveau supérieur. Il est utile lorsque vous souhaitez diviser le manuscrit en livres, parties ou actes. Ces titres ne sont pas obligatoires. Le titre du roman lui-même doit utiliser le niveau de titre spécial ``#!`` couvert dans :ref:`a_fmt_head`.

source: **Heading Level 2: Chapter**
fr: **Niveau de niveau 2 : Chapitre**

source: This heading level signifies a chapter. Each time you want to start a new chapter, you must add such a heading. If you choose to split your manuscript up into one document per scene, you need a single chapter document with just the heading. You can of course also add a synopsis and reference keywords to the chapter document. If you want to open the chapter with a quote or other introductory text that isn't part of a scene, this is also where you'd put that text.
fr: Ce niveau de titre correspond à un chapitre. Chaque fois que vous voulez commencer un nouveau chapitre, vous devez ajouter un tel titre. Si vous choisissez de diviser votre manuscrit en un document par scène, vous avez besoin d'un seul document de chapitre avec seulement l'en-tête. Vous pouvez bien entendu ajouter un synopsis et des mots-clés de référence au document de chapitre. Si vous souhaitez ouvrir le chapitre par une citation ou un autre texte d'introduction qui ne fait pas partie d'une scène, c'est également dans ce document que vous placerez ce texte.

source: **Heading Level 3: Scene**
fr: **Niveau de titre 3 : Scène**

source: This heading level signifies a scene. You must provide a title text, but the title text can be replaced with a scene separator or just skipped entirely when you build your manuscript. If you need to distinguish between hard and soft scene breaks, there is an alternative format for scenes you can use for this distinction. The formatting is covered in :ref:`a_fmt_head`. See also :ref:`a_struct_heads_scenes`.
fr: Ce niveau de titre correspond à une scène. Vous devez fournir un texte de titre, mais celui-ci peut être remplacé par un séparateur de scène ou simplement ignoré lors de la construction de votre manuscrit. Si vous avez besoin de faire la distinction entre une scène dure et une scène douce, il existe un format alternatif pour les scènes que vous pouvez utiliser pour faire cette distinction. Le formatage est couvert dans :ref:`a_fmt_head`. Voir aussi :ref:`a_struct_heads_scenes`.

source: **Heading Level 4: Section**
fr: **Niveau de titre 4 : Section**

source: This heading level can be used to split up a scene, usually called a "section" in the documentation and the user interface. These can be useful if you want to change references mid-scene, like if you change the point-of-view character. You are free to use sections as you wish, and you can filter them out of the final manuscript.
fr: Ce niveau d'en-tête peut être utilisé pour diviser une scène, généralement appelée « section » dans la documentation et l'interface utilisateur. Ces sections peuvent être utiles si vous souhaitez changer de référence au milieu de la scène, par exemple si vous changez de point de vue. Vous êtes libre d'utiliser les sections comme vous le souhaitez, et vous pouvez les filtrer dans le manuscrit final.

source: Page breaks can be automatically added before titles, partition, chapter and scene headings from the **Manuscript Build** tool when you build your project to a format that supports page breaks. If you want page breaks in other places, you have to specify them manually. See :ref:`a_fmt_break`.
fr: Les sauts de page peuvent être automatiquement ajoutés avant les titres, les parties, les chapitres et les scènes à partir de l'outil **Compiler le manuscrit** lorsque vous créez votre projet dans un format qui prend en charge les sauts de page. Si vous voulez des sauts de page à d'autres endroits, vous devez les spécifier manuellement. Voir :ref:`a_fmt_break`.

source: There are multiple options of how to process novel headings when building the manuscript. For instance, chapter numbers can be applied automatically, and so can scene numbers if you want them in a draft manuscript. You can also insert point-of-view character names in chapter titles. See the :ref:`a_manuscript` page for more details.
fr: Il existe de nombreuses options pour traiter les titres de roman lors de la construction du manuscrit. Par exemple, les numéros de chapitre peuvent être appliqués automatiquement, de même que les numéros de scène si vous le souhaitez dans un projet de manuscrit. Vous pouvez également insérer des noms de personnages dans les titres de chapitres. Voir la page :ref:`a_manuscript` pour plus de détails.

source: As of 2.6, the heading levels internally in novelWriter do not map directly to heading levels in manuscript documents. In manuscript documents, chapters are considered the top level heading, and partitions become plain text paragraphs with a larger font.
fr: Depuis la version 2.6, les niveaux d'en-tête internes à novelWriter ne correspondent pas directement aux niveaux d'en-tête des documents manuscrits. Dans les documents manuscrits, les chapitres sont considérés comme l'en-tête de premier niveau, et les partitions deviennent des paragraphes de texte simple avec une police plus grande.

source: Novel Title and Front Matter
fr: Titre du roman et page de garde

source: It is recommended that you add a document at the very top of each **Novel** root folder with the novel title in it. You should modify the level 1 heading format code with an ``!`` in order to render it as a document title that is excluded from any automatic Table of Content in a manuscript build document.
fr: Il est recommandé d'ajouter un document au premier niveau de chaque dossier racine **Nouveau** avec le titre du roman. Vous devez modifier le code de format de l'en-tête de niveau 1 avec un ``!`` afin de le rendre comme un titre de document qui est exclu de toute table des matières automatique dans un document de construction de manuscrit.

source: You can also add the author name and address above this if this is required by the manuscript format you use, and additional space added before the title.
fr: Vous pouvez également ajouter le nom et l'adresse de l'auteur au-dessus de ce titre si le format de manuscrit que vous utilisez l'exige, et ajouter un espace supplémentaire avant le titre.

source: This is the title page novelWriter generates automatically for a new project as of version 2.6:
fr: Il s'agit de la page de titre que novelWriter génère automatiquement pour un nouveau projet à partir de la version 2.6 :

source: The title is by default centred on the page. You can add more text to the page as you wish, like for instance the author's name and details.
fr: Le titre est par défaut centré sur la page. Vous pouvez ajouter plus de texte à la page si vous le souhaitez, comme par exemple le nom de l'auteur et ses coordonnées.

source: If you want an additional page of text after the title page, starting on a fresh page, you can add ``[new page]`` on a line by itself, and continue the text after it. This will insert a page break before the text. See also :ref:`a_fmt_break`.
fr: Si vous voulez une page de texte supplémentaire après la page de titre, commençant sur une nouvelle page, vous pouvez ajouter ``[new page]`` sur une ligne à part, et continuer le texte après elle. Cela insérera un saut de page avant le texte. Voir aussi :ref:`a_fmt_break`.

source: Unnumbered Chapter Headings
fr: Titres des chapitres non numérotés

source: If you use the automatic numbering feature for your chapters, but you want to keep some special chapters separate from this, you can add an ``!`` to the level 2 heading formatting code to tell the build tool to skip these chapters when adding numbers.
fr: Si vous utilisez la numérotation automatique pour vos chapitres, mais que vous voulez garder certains chapitres spéciaux séparés, vous pouvez ajouter un `!` au code de formatage des titres de niveau 2 pour indiquer à l'outil de construction d'ignorer ces chapitres lors de l'ajout des numéros.

source: There is a separate formatting feature for such chapter titles in the **Manuscript Build** tool as well. See the :ref:`a_manuscript` page for more details. When building a document of a format that supports page breaks, also unnumbered chapters can have a page break added just like for normal chapters.
fr: L'outil **Compiler le manuscrit** dispose également d'une fonction de formatage distincte pour ces titres de chapitre. Voir la page :ref:`a_manuscript` pour plus de détails. Lors de la construction d'un document d'un format qui supporte les sauts de page, les chapitres non numérotés peuvent également avoir un saut de page ajouté comme pour les chapitres normaux.

source: Hard and Soft Scene Breaks
fr: Ruptures de scène dures et douces

source: If you need two different ways to style scenes in your manuscript, like if you want to insert different scene separators for soft and hard scene breaks, there is an alternative scene format available for scene headings with a ``!`` added to the formatting code.
fr: Si vous avez besoin de deux façons différentes de styliser les scènes dans votre manuscrit, par exemple si vous voulez insérer des séparateurs de scène différents pour les ruptures de scène douces et dures, il existe un format de scène alternatif disponible pour les titres de scène avec un `!` ajouté au code de formatage.

source: There is a separate formatting feature for these titles in the **Manuscript Build** tool.
fr: Il existe une fonction de formatage distincte pour ces titres dans l'outil **Compiler le manuscrit**.
