Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/project_references.po
Languages: fr

source: Tags and References
fr: Tags et références

source: In novelWriter there are no forms or tables to fill in to define characters, locations or other elements of your story. Instead, you create :term:`project notes` which you can mark as representing these story elements by creating a :term:`tag`. Whenever you want to link a piece of your story to a note defining a story element, like a character, you create a :term:`reference` back to that tag. You can also cross-link your project notes in the same way.
fr: Dans novelWriter, il n'y a pas de formulaires ou de tableaux à remplir pour définir les personnages, les lieux ou d'autres éléments de votre histoire. Au lieu de cela, vous créez des :term:`notes de projet` que vous pouvez marquer comme représentant ces éléments de l'histoire en créant un :term:`tag`. Lorsque vous souhaitez lier un élément de votre histoire à une note définissant un élément de l'histoire, comme un personnage, vous créez un :term:`référence` qui renvoie à cette étiquette. Vous pouvez également créer des liens croisés entre les notes de votre projet de la même manière.

source: This is perhaps one of the features that makes novelWriter different from other, similar applications. It is therefore not always obvious to new users how this is supposed to work, so this chapter hopes to explain in more detail how to use this tags and references system.
fr: C'est peut-être l'une des caractéristiques qui différencie novelWriter d'autres applications similaires. Il n'est donc pas toujours évident pour les nouveaux utilisateurs de comprendre comment cela est censé fonctionner, c'est pourquoi ce chapitre vise à expliquer plus en détail comment utiliser ce système de balises et de références.

source: If you find the Tags and Reference system difficult to follow just from reading this chapter, you can create a new project in the **Welcome** dialog's New project form and select "Create an example project" from the "Pre-fill project" option. The example project contains several examples of tags and references.
fr: Si le système de balises et de références vous semble difficile à suivre à la seule lecture de ce chapitre, vous pouvez créer un nouveau projet dans le formulaire Nouveau projet de la boîte de dialogue **Bienvenue** et sélectionner « Créer un projet d'exemple » dans l'option « Pré-remplir le projet ». Le projet d'exemple contient plusieurs exemples de balises et de références.

source: Metadata in novelWriter
fr: Métadonnées dans novelWriter

source: The structure of your novelWriter project is inferred from the :term:`headings` within the documents, not the documents themselves. See :ref:`a_struct_heads` for more details. Therefore, metadata is also associated with headings, and not the documents directly.
fr: La structure de votre projet novelWriter est déduite des :term:`en-têtes` des documents, et non des documents eux-mêmes. Voir :ref:`a_struct_heads` pour plus de détails. Par conséquent, les métadonnées sont également associées aux en-têtes, et non aux documents directement.

source: If you split your project into separate documents for each scene, this distinction may not matter. However, there are several benefits to using documents at a larger structural scale when first starting your project. For instance, it may make more sense to define all your scenes, and even chapters, in a single document at first, or perhaps a document per act. You can later split these documents up using the document split feature. See :ref:`a_ui_tree_split_merge` for more details.
fr: Si vous divisez votre projet en documents distincts pour chaque scène, cette distinction peut ne pas avoir d'importance. Cependant, l'utilisation de documents à une échelle structurelle plus large présente plusieurs avantages lorsque vous démarrez votre projet. Par exemple, il peut être plus judicieux de définir toutes les scènes, et même les chapitres, dans un seul document au départ, ou peut-être un document par acte. Vous pouvez par la suite diviser ces documents en utilisant la fonction de division de document. Voir :ref:`a_ui_tree_split_merge` pour plus de détails.

source: You can do the same with your notes. You can treat each heading as an independent element of your notes that can be referenced somewhere else. That way you can collect all your minor or background characters in a single note file, and still be able to reference them individually by separating them with headings and assigning each a tag. Or, you can lay out your plot in a single document and have a tag for each plot stage under separate headings.
fr: Vous pouvez faire de même avec vos notes. Vous pouvez traiter chaque en-tête comme un élément indépendant de vos notes qui peut être référencé ailleurs. Ainsi, vous pouvez rassembler tous vos personnages mineurs ou de second plan dans un seul fichier de notes, tout en étant en mesure de les référencer individuellement en les séparant par des en-têtes et en leur attribuant à chacun une balise. Vous pouvez également présenter votre intrigue dans un seul document et attribuer une balise à chaque étape de l'intrigue dans des rubriques distinctes.

source: How to Use Tags
fr: Comment utiliser les tags

source: A "tag" in novelWriter is a word or phrase that you define as belonging to a heading. Tags are set by using the ``@tag`` :term:`keyword`.
fr: Un « tag » dans novelWriter est un mot ou une phrase que vous définissez comme appartenant à une rubrique. Les balises sont définies à l'aide de la commande ``@tag`` :term:`mot-clé`.

source: The basic format of a tag is ``@tag: tagName``.
fr: Le format de base d'une balise est ``@tag: NomDuTag``.

source: An alternative format of a tag is ``@tag: tagName | displayName``.
fr: Un autre format de balise est ``@tag: NomDuTag | NomAffiché``.

source: ``tagName`` (Required)
fr: ``NomDuTag`` (Requis)

source: This is a unique identifier of your choosing. It is the value you use later for making references back to this document, or section of the document.
fr: Il s'agit d'un identifiant unique de votre choix. C'est la valeur que vous utiliserez plus tard pour faire référence à ce document ou à une section du document.

source: ``displayName`` (Optional)
fr: ``NomAffiché`` (Optionnel)

source: This is an optional display name used for the tag. When you build your manuscript, you can for instance insert the point of view character name directly into chapter headings. By default, the ``tagName`` value is used in such headings, but if you use a shortened format internally in your project, you can use this to specify a more suitable format for your manuscript headings.
fr: Il s'agit d'un nom d'affichage facultatif utilisé pour la balise. Lorsque vous construisez votre manuscrit, vous pouvez par exemple insérer le nom du personnage du point de vue directement dans les titres des chapitres. Par défaut, la valeur ``NomDuTag`` est utilisée dans ces titres, mais si vous utilisez un format abrégé en interne dans votre projet, vous pouvez utiliser ceci pour spécifier un format plus approprié pour les titres de votre manuscrit.

source: You can only set **one** tag per heading, and the tag has to be unique across **all** documents in the project.
fr: Vous ne pouvez définir qu'une seule balise** par rubrique, et la balise doit être unique dans **tous** les documents du projet.

source: After a tag has been defined, it can be referenced in novel documents, or cross-referenced in other notes. Tags will also show up in the **Outline View** and in the references panel under the document viewer when a document is open in the viewer.
fr: Une fois qu'une balise a été définie, elle peut être référencée dans de nouveaux documents ou faire l'objet de références croisées dans d'autres notes. Les balises apparaîtront également dans la **Vue en plan** et dans le panneau des références sous le visualiseur de documents lorsqu'un document est ouvert dans le visualiseur.

source: The syntax highlighter will indicate to you that the keyword is correctly used and that the tag is allowed, that is, the tag is unique. Duplicate tags should be detected as long as the index is up to date. An invalid tag should have a green wiggly line under it, and will not receive the colour that valid tags do.
fr: Le surligneur syntaxique vous indiquera que le mot-clé est correctement utilisé et que la balise est autorisée, c'est-à-dire qu'elle est unique. Les balises dupliquées devraient être détectées si l'index est à jour. Une balise non valide est signalée par une ligne verte et ne reçoit pas la même couleur que les balises valides.

source: The tag is the only part of these notes that novelWriter uses. The rest of the document content is there for you to use in whatever way you wish. Of course, the content of the documents can be added to the manuscript, or an outline document. If you want to compile a single document of all your notes, you can do this from the **Manuscript Build** tool.
fr: La balise est la seule partie de ces notes que novelWriter utilise. Le reste du contenu du document est là pour que vous puissiez l'utiliser comme bon vous semble. Bien entendu, le contenu des documents peut être ajouté au manuscrit ou à un document de synthèse. Si vous souhaitez compiler un seul document de toutes vos notes, vous pouvez le faire à partir de l'outil **Compiler le manuscrit**.

source: Tags are no longer case sensitive. The tags are by default displayed with the capitalisation you use when defining the tag, but you don't have to use the same capitalisation when referencing it later.
fr: Les balises ne sont plus sensibles à la casse. Les balises sont affichées par défaut avec la majuscule utilisée lors de la définition de la balise, mais vous n'êtes pas obligé d'utiliser la même majuscule lorsque vous y faites référence ultérieurement.

source: Tags can have an optional display name for manuscript builds.
fr: Les balises peuvent avoir un nom d'affichage facultatif pour les constructions de manuscrits.

source: You can now add tags also to Novel Documents. These can be used for cross-referencing between chapters and scenes, and also from notes if desired.
fr: Vous pouvez désormais ajouter des balises aux documents du roman. Celles-ci peuvent être utilisées pour les références croisées entre les chapitres et les scènes, ainsi qu'à partir des notes si vous le souhaitez.

source: Example of a heading with a tag for a character of the story:
fr: Exemple d'un titre avec une tag pour un personnage de l'histoire :

source: When this is done in a document in a :term:`Root Folder` of type "Characters", the tag is automatically treated as an available character in your project with the value "Jane", and you will be able to reference it in any of your other documents using the reference keywords for characters. It will also show up in the Character tab in the Reference panel below the document viewer, and in the reference auto-completer menu in the editor when you fill in references. See :ref:`a_ui_view` and :ref:`a_references_completer`.
fr: Lorsque cela est fait dans un document dans un :term:`Dossier racine` de type « Personnages “, la balise est automatiquement traitée comme un caractère disponible dans votre projet avec la valeur ” Jane », et vous pourrez y faire référence dans n'importe lequel de vos autres documents en utilisant les mots-clés de référence pour les personnages. Il apparaîtra également dans l'onglet Personnage du panneau Référence sous le visualiseur de document, et dans le menu d'auto-complétion de référence dans l'éditeur lorsque vous remplissez des références. Voir :ref:`a_ui_view` et :ref:`a_references_completer`.

source: It is the root folder type that defines what category of story elements the tag is indexed under. See the :ref:`a_proj_roots` section for an overview of available root folder types. They are also covered in the next section.
fr: C'est le type de dossier racine qui définit la catégorie d'éléments de l'histoire sous laquelle la balise est indexée. Voir la section :ref:`a_proj_roots` pour une vue d'ensemble des types de dossiers racines disponibles. Ils sont également abordés dans la section suivante.

source: How to Use References
fr: Comment utiliser les références

source: Each heading of any level in your project can contain references to tags set in project notes. The references are gathered by the indexer and used to generate the **Outline View**, among other things.
fr: Chaque en-tête de n'importe quel niveau de votre projet peut contenir des références à des balises définies dans les notes du projet. Ces références sont rassemblées par l'indexeur et utilisées pour générer la **Vue d'ensemble**, entre autres choses.

source: References are set as a :term:`keyword` and a list of corresponding tags. The valid keywords are listed below. The format of a reference line is ``@keyword: value1, [value2] ... [valueN]``. All reference keywords allow multiple values.
fr: Les références sont définies sous la forme d'un :term:`mot-clé` et d'une liste de balises correspondantes. Les mots-clés valides sont listés ci-dessous. Le format d'une ligne de référence est ``@keyword: value1, [value2] ... [valeurN]``. Tous les mots-clés de référence autorisent des valeurs multiples.

source: The point-of-view character for the current section. The target must be a note tag in a **Character** type root folder.
fr: Le personnage de point de vue pour la section en cours. La cible doit être une balise note dans un dossier racine de type **Personnages**.

source: The character that has the focus for the current section. This can be used in cases where the focus is not a point-of-view character. The target must be a note tag in a **Character** type root folder.
fr: Le personnage qui est au centre de l'attention pour la section en cours. Ceci peut être utilisé dans les cas où le focus n'est pas un personnage de point de vue. La cible doit être une balise note dans un dossier racine de type **Personnages**.

source: Other characters in the current section. The target must be a note tag in a **Character** type root folder. This should not include the point-of-view or focus character if those references are used.
fr: Autres personnages de la section courante. La cible doit être une étiquette de note dans un dossier racine de type **Personnages**. Cela ne doit pas inclure le point de vue ou le personnage principal si ces références sont utilisées.

source: The plot or subplot advanced in the current section. The target must be a note tag in a **Plot** type root folder.
fr: L'intrigue ou la sous-intrigue développée dans la section en cours. La cible doit être une balise note dans un dossier racine de type **Intrigue**.

source: The timelines touched by the current section. The target must be a note tag in a **Timeline** type root folder.
fr: Les lignes de temps concernées par la section en cours. La cible doit être une balise note dans un dossier racine de type **Chronologie**.

source: The location the current section takes place in. The target must be a note tag in a **Locations** type root folder.
fr: L'endroit où se déroule la section en cours. La cible doit être une balise note dans un dossier racine de type **lieux**.

source: Objects present in the current section. The target must be a note tag in a **Object** type root folder.
fr: Objets présents dans la section courante. La cible doit être une étiquette de note dans un dossier racine de type **Objets**.

source: Entities present in the current section. The target must be a note tag in an **Entities** type root folder.
fr: Entités présentes dans la section courante. La cible doit être une balise note dans un dossier racine de type **Entités**.

source: Custom references in the current section. The target must be a note tag in a **Custom** type root folder. The custom folder are for any other category of notes you may want to use.
fr: Références personnalisées dans la section en cours. La cible doit être une étiquette de note dans un dossier racine de type **personnalisé**. Les dossiers personnalisés sont destinés à toute autre catégorie de notes que vous souhaiteriez utiliser.

source: Anything mentioned, but not present in the current section. It is intended for those cases where you reveal details about a character or place in a scene without it being otherwise a part of it. This can be useful when checking for consistency later. Any tag in any root note folder can be listed under mentions.
fr: Tout ce qui est mentionné, mais qui n'est pas présent dans la section actuelle. Il est destiné aux cas où vous révélez des détails sur un personnage ou un lieu dans une scène sans qu'il en fasse partie. Cela peut être utile pour vérifier la cohérence ultérieurement. N'importe quelle balise dans n'importe quel dossier de notes racine peut être listée sous mentions.

source: This is used when referencing a Novel Document, like a scene or chapter, from somewhere else in your project.
fr: Cette fonction est utilisée pour référencer un document de roman, comme une scène ou un chapitre, à partir d'un autre endroit de votre projet.

source: The syntax highlighter will alert the user that the tags and references are used correctly, and that the tags referenced exist.
fr: L'outil de mise en évidence de la syntaxe avertit l'utilisateur que les balises et les références sont utilisées correctement et que les balises référencées existent.

source: The highlighter may be mistaken if the index of defined tags is out of date. If so, press :kbd:`F9` to regenerate it, or select **Rebuild Index** from the **Tools** menu. In general, the index for a document is regenerated when it is saved, so this shouldn't normally be necessary.
fr: Le surligneur peut se tromper si l'index des balises définies n'est pas à jour. Si c'est le cas, appuyez sur :kbd:`F9` pour le régénérer, ou sélectionnez **Reconstruire l'index** dans le menu **Outils**. En général, l'index d'un document est régénéré lorsqu'il est sauvegardé, ce qui ne devrait pas être nécessaire.

source: If you add a reference in the editor to a tag that doesn't yet exist, you can right-click it and select **Create Note for Tag**. This will generate a new project note automatically with the new tag defined. In order for this to be possible, a root folder for that category of references must already exist.
fr: Si vous ajoutez une référence dans l'éditeur à une balise qui n'existe pas encore, vous pouvez cliquer dessus avec le bouton droit de la souris et sélectionner **Créer une note pour la balise**. Cela générera automatiquement une nouvelle note de projet avec la nouvelle balise définie. Pour que cela soit possible, un dossier racine pour cette catégorie de références doit déjà exister.

source: One note can also reference another note in the same way novel documents do. When the note is opened in the document viewer, the references become clickable links, making it easier to follow connections in the plot. You can follow links in the document editor by clicking them with the mouse while holding down the :kbd:`Ctrl` key. Clicked links are always opened in the view panel.
fr: Une note peut également faire référence à une autre note, de la même manière que les documents de romans. Lorsque la note est ouverte dans l'éditeur de documents, les références deviennent des liens cliquables, ce qui facilite le suivi des connexions dans l'intrigue. Vous pouvez suivre les liens dans l'éditeur de documents en les cliquant avec la souris tout en maintenant la touche :kbd:`Ctrl` enfoncée. Les liens cliqués sont toujours ouverts dans le panneau de visualisation.

source: Project notes don't show up in the **Outline View**, so referencing between notes is only meaningful if you want to be able to click-navigate between them, or of course if you just want to highlight that two notes are related.
fr: Les notes de projet n'apparaissent pas dans la **Vue d'ensemble**, de sorte que les références entre les notes n'ont de sens que si vous voulez pouvoir naviguer d'une note à l'autre en cliquant, ou bien sûr si vous voulez simplement mettre en évidence que deux notes sont liées.

source: If you cross-reference between notes and export your project as an HTML document using the **Manuscript Build** tool, the cross-references become clickable links in the exported HTML document as well.
fr: Si vous faites des références croisées entre les notes et que vous exportez votre projet en tant que document HTML à l'aide de l'outil **Compiler le manuscrit**, les références croisées deviennent également des liens cliquables dans le document HTML exporté.

source: Example of a novel document with references to characters and plots:
fr: Exemple de document de roman avec références aux personnages et aux intrigues :

source: The References Auto-Completer
fr: L'auto-complétion des références

source: An auto-completer context menu will show up automatically in the document editor when you type the character ``@`` on a new line. It will first suggest tag or reference keywords for you to add, and after the ``:`` has been added, suggest references from the list of tags you have already defined.
fr: Un menu contextuel d'auto-complétion s'affiche automatiquement dans l'éditeur de document lorsque vous tapez le caractère ``@`` sur une nouvelle ligne. Il vous proposera d'abord des mots-clés de balise ou de référence à ajouter, puis, après l'ajout de ``:``, des références à partir de la liste des balises que vous avez déjà définies.

source: You can use the auto-completer to add multiple references with a ``,`` between them, and even type new ones. New references can be created by right-clicking on them and selecting **Create Note for Tag** from the menu.
fr: Vous pouvez utiliser l'auto-complétion pour ajouter plusieurs références avec un `,` entre elles, et même en taper de nouvelles. De nouvelles références peuvent être créées en cliquant dessus avec le bouton droit de la souris et en sélectionnant **Créer une note pour le tag** dans le menu.
