Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/project_overview.po
Languages: fr

source: Managing Projects
fr: Gestion des projets

source: Your text in novelWriter is organised into projects. Each project is meant to contain one novel and associated notes. If you have multiple novels in a series, with the same characters and shared notes, it is also possible to keep all of them in the same project.
fr: Vos textes dans novelWriter sont organisés en projets. Chaque projet est censé contenir un roman et les notes associées. Si vous avez plusieurs romans dans une série, avec les mêmes personnages et des notes partagées, il est également possible de les conserver tous dans le même projet.

source: Creating Project
fr: Créer un projet

source: New projects can be created from the **Project** menu by selecting **Create or Open Project**. This will open the **Welcome** dialog, where you can select the :guilabel:`New` button that will assist you in creating a new project. This dialog is also displayed when you start novelWriter.
fr: De nouveaux projets peuvent être créés à partir du menu **Projet** en sélectionnant **Créer ou ouvrir un projet**. Cela ouvrira la boîte de dialogue **Bienvenue**, où vous pourrez sélectionner le bouton :guilabel:`Nouveau` qui vous aidera à créer un nouveau projet. Cette boîte de dialogue est également affichée lorsque vous démarrez novelWriter.

source: A novelWriter project requires a dedicated folder for storing its files on the local file system. If you're interested in the details, you can have a look at the chapter :ref:`a_storage`.
fr: Un projet novelWriter nécessite un dossier dédié pour stocker ses fichiers sur le système de fichiers local. Si vous êtes intéressé par les détails, vous pouvez consulter le chapitre :ref:`a_storage`.

source: A list of recently opened projects is maintained, and displayed in the **Welcome** dialog. A project can be removed from this list by selecting it and pressing the :kbd:`Del` key or by right-clicking it and selecting the **Remove Project** option.
fr: Une liste des projets récemment ouverts est maintenue et affichée dans la boîte de dialogue **Bienvenue**. Un projet peut être supprimé de cette liste en le sélectionnant et en appuyant sur la touche :kbd:`Suppr` ou en faisant un clic droit sur le projet et en sélectionnant l'option **Supprimer le projet**.

source: The project list (left) and new project form (right) of the :guilabel:`Welcome` dialog.
fr: La liste des projets (à gauche) et le formulaire de nouveau projet (à droite) de la boîte de dialogue :guilabel:`Bienvenue`.

source: Project-specific settings are available in **Project Settings** in the **Project** menu. See further details below in the :ref:`a_proj_settings` section.
fr: Les paramètres spécifiques au projet sont disponibles dans **Réglages du projet** dans le menu **Projet**. Voir plus de détails ci-dessous dans la section :ref:`a_proj_settings`.

source: Details about the project's novel text, including word counts, and a table of contents with word and page counts, is available through the **Novel Details** dialog. Statistics about the project is also available in the **Manuscript Build** tool.
fr: Les détails du texte du roman du projet, y compris le nombre de mots et une table des matières avec le nombre de mots et de pages, sont disponibles dans la boîte de dialogue **Détails du roman**. Des statistiques sur le projet sont également disponibles dans l'outil **Compiler le manuscrit**.

source: Template Projects
fr: Modèles de projets

source: From the Welcome dialog you can also create a new from another existing project. If you have a specific structure you want to use for all your new projects, you can create a dedicated project to be used as a template, and select to copy an existing project from the :guilabel:"Prefill Project" option from the **New Project** form.
fr: Dans la boîte de dialogue de bienvenue, vous pouvez également créer un nouveau projet à partir d'un projet existant. Si vous souhaitez utiliser une structure spécifique pour tous vos nouveaux projets, vous pouvez créer un projet dédié qui servira de modèle et choisir de copier un projet existant à partir de l'option :guilabel : « Pré-remplir le projet » du formulaire **Nouveau projet**.

source: Project Structure
fr: Structure du projet

source: Projects are structured into a set of top level folders called "Root Folders". They are visible in the project tree at the left side of the main window.
fr: Les projets sont structurés en un ensemble de dossiers de premier niveau appelés « dossiers racines ». Ils sont visibles dans l'arborescence du projet à gauche de la fenêtre principale.

source: The :term:`novel documents` go into a root folder of type **Novel**. :term:`Project notes` go into the other root folders. These other root folder types are intended for your notes on the various elements of your story. Using them is of course entirely optional.
fr: Les :term:`documents du roman` vont dans un dossier racine de type **Roman**. Les :term:`Notes de projet` vont dans les autres dossiers racines. Ces autres types de dossiers racines sont destinés à recevoir vos notes sur les différents éléments de votre histoire. Leur utilisation est bien sûr entièrement facultative.

source: A new project may not have all of the root folders present, but you can add the ones you want from the project tree tool bar.
fr: Un nouveau projet peut ne pas contenir tous les dossiers racines, mais vous pouvez ajouter ceux que vous souhaitez à partir de la barre d'outils de l'arborescence du projet.

source: Each root folder has one or more :term:`reference` :term:`keyword` associated with it that is used to reference them from other documents and notes. The intended usage of each type of root folder is listed below. However, aside from the **Novel** folder, no restrictions are applied by the application on what you put in them. You can use them however you want.
fr: Chaque dossier racine est associé à un ou plusieurs :term:`référence` :term:`mot-clé` qui sont utilisés pour y faire référence à partir d'autres documents et notes. L'utilisation prévue de chaque type de dossier racine est indiquée ci-dessous. Cependant, à part le dossier **Roman**, aucune restriction n'est appliquée par l'application sur ce que vous mettez dans ces dossiers. Vous pouvez les utiliser comme bon vous semble.

source: The root folder system is closely connected to how the Tags and References system works. For more details, see the :ref:`a_references` chapter.
fr: Le système de dossiers racine est étroitement lié au fonctionnement du système de balises et de références. Pour plus de détails, voir le chapitre :ref:`a_references`.

source: Root Folder Types
fr: Types de dossiers racines

source: **Novel**
fr: **Roman**

source: This is the root folder type for text that goes into the final novel or novels. This class of documents have other rules and features than the project notes. See :ref:`a_struct` for more details.
fr: Il s'agit du type de dossier racine pour le texte qui sera intégré au roman ou aux romans finaux. Cette classe de documents a d'autres règles et caractéristiques que les notes de projet. Voir :ref:`a_struct` pour plus de détails.

source: **Plot**
fr: **Intrigue**

source: This is the root folder type where main plots can be outlined. It is optional, but adding at least brief notes can be useful in order to tag plot elements for the **Outline View**. Tags in this folder can be references using the ``@plot`` keyword.
fr: Il s'agit du type de dossier racine dans lequel les intrigues principales peuvent être décrites. Il est facultatif, mais l'ajout d'au moins quelques notes peut être utile pour étiqueter les éléments de l'intrigue pour la **Vue d'ensemble**. Les balises de ce dossier peuvent être référencées en utilisant le mot-clé `@plot``.

source: **Characters**
fr: **Personnages**

source: Character notes go in this root folder type. These are especially important if you want to use the **Outline View** to see which character appears where, which part of the story is told from a specific character's point-of-view, or focusing on a particular character's storyline.
fr: Les notes des personnages sont placées dans ce type de dossier racine. Elles sont particulièrement importantes si vous voulez utiliser la **Vue d'ensemble** pour voir quel personnage apparaît à quel endroit, quelle partie de l'histoire est racontée du point de vue d'un personnage spécifique, ou pour vous concentrer sur l'intrigue d'un personnage particulier.

source: The character names can also be inserted into for instance chapter titles when you create your manuscript. Tags in this type of folder can be referenced using the ``@pov`` keyword for point-of-view characters, ``@focus`` for a focus character, or the ``@char`` keyword for any other character present.
fr: Les noms de personnages peuvent également être insérés, par exemple, dans les titres de chapitres lorsque vous créez votre manuscrit. Les tags de ce type de dossier peuvent être référencés en utilisant le mot-clé `@pov`` pour les personnages de point de vue, `@focus`` pour un personnage de focalisation, ou le mot-clé `@char`` pour n'importe quel autre personnage présent.

source: **Locations**
fr: **Lieux**

source: The locations folder type is for various scene locations that you want to track. Tags in this folder can be references using the ``@location`` keyword.
fr: Le type de dossier lieux est destiné aux différents lieux de la scène que vous souhaitez suivre. Les balises de ce dossier peuvent être référencées en utilisant le mot-clé `@location``.

source: **Timeline**
fr: **Chronologie**

source: If the story has multiple plot timelines or jumps in time within the same plot, this folder type can be used to track this. Tags in this type of folder can be references using the ``@time`` keyword.
fr: Si l'histoire a plusieurs lignes temporelles ou des sauts dans le temps au sein d'une même intrigue, ce type de dossier peut être utilisé pour en assurer le suivi. Les tags de ce type de dossier peuvent être référencés en utilisant le mot-clé ``@time``.

source: **Objects**
fr: **Objets**

source: Important objects in the story, for instance physical objects that change hands often, can be tracked here. Tags in this type of folder can be references using the ``@object`` keyword.
fr: Les objets importants de l'histoire, par exemple les objets physiques qui changent souvent de mains, peuvent être suivis ici. Les étiquettes de ce type de dossier peuvent être référencées à l'aide du mot-clé ``@object``.

source: **Entities**
fr: **Entités**

source: Does your plot have many powerful organisations or companies? Or other entities that are part of the plot? They can be organised here. Tags in this type of folder can be references using the ``@entity`` keyword.
fr: Votre intrigue comporte-t-elle de nombreuses organisations ou entreprises puissantes ? Ou d'autres entités qui font partie de l'intrigue ? Elles peuvent être organisées ici. Les tags dans ce type de dossier peuvent être référencés en utilisant le mot-clé ``@entity``.

source: **Custom**
fr: **Personnalisé**

source: The custom root folder type can be used for tracking anything else not covered by the above options. Tags in this folder type can be references using the ``@custom`` keyword.
fr: Le type de dossier racine personnalisé peut être utilisé pour suivre tout ce qui n'est pas couvert par les options ci-dessus. Les balises de ce type de dossier peuvent être référencées en utilisant le mot-clé ``@custom``.

source: The root folders are closely tied to the tags and reference system. Each folder type corresponds to categories of tags that can be used to reference them. For more information about the tags listed, see :ref:`a_references_references`.
fr: Les dossiers racines sont étroitement liés au système de balises et de références. Chaque type de dossier correspond à des catégories de balises qui peuvent être utilisées pour les référencer. Pour plus d'informations sur les balises listées, voir :ref:`a_references_references`.

source: There is also a ``@mention`` keyword that can be used to reference any tag. See :ref:`a_references_references` for more details.
fr: Il y a aussi un mot-clé `@mention` qui peut être utilisé pour référencer n'importe quel tag. Voir :ref:`a_references_references` pour plus de détails.

source: You can rename root folders to whatever you want. However, this doesn't change the reference keyword or what they do.
fr: Vous pouvez renommer les dossiers racine comme vous le souhaitez. Cependant, cela ne change pas le mot-clé de référence ni ce qu'il fait.

source: Deleted Documents
fr: Documents supprimés

source: Deleted documents are moved into a special **Trash** root folder. Documents in the trash folder can then be deleted permanently, either individually, or by emptying the trash from the menu. Documents in the trash folder are removed from the :term:`project index` and cannot be referenced.
fr: Les documents supprimés sont placés dans un dossier racine **Corbeille** spécial. Les documents du dossier corbeille peuvent alors être supprimés de façon permanente, soit individuellement, soit en vidant la corbeille à partir du menu. Les documents contenus dans la corbeille sont supprimés de l':term:`index du projet` et ne peuvent pas être référencés.

source: A document or a folder can be moved to trash from the **Project** menu, or by pressing :kbd:`Ctrl+Shift+Del`. Root folders can only be removed when they are empty.
fr: Un document ou un dossier peut être déplacé vers la corbeille à partir du menu **Projet**, ou en appuyant sur :kbd:`Ctrl+Maj+Suppr`. Les dossiers racines ne peuvent être supprimés que lorsqu'ils sont vides.

source: Archived Documents
fr: Documents archivés

source: If you don't want to delete a document, or put it in the **Trash** folder where it may be deleted accidentally, but still want it out of your main project tree, you can create an **Archive** root folder instead and move it there. It has the same effect as moving it to **Trash**, but it is safe from deletion.
fr: Si vous ne souhaitez pas supprimer un document ou le placer dans le dossier **Corbeille** où il risque d'être supprimé accidentellement, mais que vous voulez quand même le retirer de l'arborescence principale de votre projet, vous pouvez créer un dossier racine **Archives** et l'y déplacer. Cela a le même effet que de le déplacer dans la **Corbeille**, mais il ne risque pas d'être supprimé.

source: You can drag any document to this folder and preserve its settings. The document will always be excluded from the **Build Manuscript** tool. It is also removed from the :term:`project index`, so the tags and references defined in it will not show up anywhere else.
fr: Vous pouvez faire glisser n'importe quel document dans ce dossier et préserver ses paramètres. Le document sera toujours exclu de l'outil **Compiler le manuscrit**. Il est également supprimé de l'index :term:`index du projet`, de sorte que les balises et les références qui y sont définies n'apparaîtront nulle part ailleurs.

source: Using Folders in the Project Tree
fr: Utilisation des dossiers dans l'arborescence du projet

source: Regular folders, those that are not root folders, have no structural significance to the project. When novelWriter is processing the documents in a project, like for instance when you create a manuscript from it, these folders are ignored. Only the order of the documents themselves matter.
fr: Les dossiers ordinaires, ceux qui ne sont pas des dossiers racines, n'ont aucune signification structurelle pour le projet. Lorsque novelWriter traite les documents d'un projet, comme par exemple lorsque vous créez un manuscrit à partir de celui-ci, ces dossiers sont ignorés. Seul l'ordre des documents a de l'importance.

source: The folders are there purely as a way for you to organise the documents in meaningful sections and to be able to collapse and hide them in the project tree when you're not working on those documents.
fr: Les dossiers sont là uniquement pour vous permettre d'organiser les documents en sections significatives et de pouvoir les réduire et les cacher dans l'arborescence du projet lorsque vous ne travaillez pas sur ces documents.

source: In addition to using folders. it is also possible to add child documents to other documents. This is particularly useful when you create chapters and scenes. If you add separate scene documents, you should also add separate chapter documents, even if they only contain a chapter heading. You can then add scene documents as child items to the chapters.
fr: Outre l'utilisation de dossiers, il est également possible d'ajouter des documents enfants à d'autres documents. Ceci est particulièrement utile lorsque vous créez des chapitres et des scènes. Si vous ajoutez des documents de scène distincts, vous devez également ajouter des documents de chapitre distincts, même s'ils ne contiennent qu'un titre de chapitre. Vous pouvez ensuite ajouter des documents de scène en tant qu'éléments enfants aux chapitres.

source: Recovered Documents
fr: Documents récupérés

source: If novelWriter crashes or otherwise exits without saving the project state, or if you're using a file synchronisation tool that runs out of sync, there may be files in the project storage folder that aren't tracked in the core project file. These files, when discovered, are recovered and added back into the project when a project is opened.
fr: Si novelWriter se plante ou se termine sans sauvegarder l'état du projet, ou si vous utilisez un outil de synchronisation de fichiers qui se désynchronise, il peut y avoir des fichiers dans le dossier de stockage du projet qui ne sont pas suivis dans le fichier de base du projet. Ces fichiers, lorsqu'ils sont découverts, sont récupérés et ajoutés au projet lorsqu'un projet est ouvert.

source: The discovered files are scanned for metadata that give clues as to where the document may previously have been located in the project. The project loading routine will try to put them back as close as possible to this location, if it still exists. Generally, it will be appended to the end of the folder where it previously was located. If that folder doesn't exist, it will try to add it to the correct root folder type. If it cannot figure out which root folder is correct, the document will be added to the **Novel** root folder. Finally, if a **Novel** does not exist, one will be created.
fr: Les fichiers découverts sont analysés à la recherche de métadonnées qui donnent des indices sur l'emplacement antérieur du document dans le projet. La routine de chargement du projet essaiera de les replacer aussi près que possible de cet emplacement, s'il existe toujours. En général, le document sera ajouté à la fin du dossier où il se trouvait auparavant. Si ce dossier n'existe pas, il essaiera de l'ajouter au type de dossier racine correct. S'il ne parvient pas à déterminer quel est le bon dossier racine, le document sera ajouté au dossier racine **Nouveau**. Enfin, si un **Nouveau** n'existe pas, il en sera créé un.

source: If the title of the document can be recovered, the word "Recovered:" will be added as a prefix to indicate that it may need further attention. If the title cannot be determined, the document will be named after its internal key, which is a string of characters and numbers.
fr: Si le titre du document peut être récupéré, le mot « Récupéré : » sera ajouté comme préfixe pour indiquer qu'il peut nécessiter une attention supplémentaire. Si le titre ne peut être déterminé, le document sera nommé d'après sa clé interne, qui est une chaîne de caractères et de chiffres.

source: Project Lockfile
fr: Fichier de verrouillage du projet

source: To prevent data loss caused by file conflicts when novelWriter projects are synchronised via file synchronisation tools, a project lockfile is written to the project storage folder when a project is open. If you try to open a project which already has such a file present, you will be presented with a warning, and some information about where else novelWriter thinks the project is also open. You will be given the option to ignore this warning, and continue opening the project at your own risk.
fr: Pour éviter la perte de données causée par des conflits de fichiers lorsque les projets novelWriter sont synchronisés via des outils de synchronisation de fichiers, un fichier de verrouillage de projet est écrit dans le dossier de stockage du projet lorsqu'un projet est ouvert. Si vous essayez d'ouvrir un projet dans lequel un tel fichier est déjà présent, vous recevrez un avertissement et des informations sur l'endroit où novelWriter pense que le projet est également ouvert. Vous aurez la possibilité d'ignorer cet avertissement et de continuer à ouvrir le projet à vos risques et périls.

source: If, for some reason, novelWriter or your computer crashes, the lock file may remain even if there are no other instances keeping the project open. In such a case it is safe to ignore the lock file warning when re-opening the project.
fr: Si, pour une raison quelconque, novelWriter ou votre ordinateur tombe en panne, le fichier de verrouillage peut subsister même si aucune autre instance ne maintient le projet ouvert. Dans ce cas, il est prudent d'ignorer l'avertissement relatif au fichier de verrouillage lors de la réouverture du projet.

source: If you choose to ignore the warning and continue opening the project, and multiple instances of the project are in fact open, you are likely to cause inconsistencies and create diverging project files, potentially resulting in loss of data and orphaned files. You are not likely to lose any actual text unless both instances have the same document open in the editor, and novelWriter will try to resolve project inconsistencies the next time you open the project.
fr: Si vous choisissez d'ignorer l'avertissement et de continuer à ouvrir le projet, et que plusieurs instances du projet sont en fait ouvertes, vous risquez de provoquer des incohérences et de créer des fichiers de projet divergents, ce qui peut entraîner une perte de données et des fichiers orphelins. Il est peu probable que vous perdiez du texte à moins que les deux instances aient le même document ouvert dans l'éditeur, et novelWriter essaiera de résoudre les incohérences du projet la prochaine fois que vous l'ouvrirez.

source: Project Documents
fr: Documents de projets

source: New documents can be created from the toolbar in the project tree, or by pressing :kbd:`Ctrl+N`. This will open the create new item menu and let you choose between a number of pre-defined documents and folders. You will be prompted for a label for the new item.
fr: De nouveaux documents peuvent être créés à partir de la barre d'outils dans l'arborescence du projet, ou en appuyant sur :kbd:`Ctrl+N`. Cela ouvrira le menu de création d'un nouvel élément et vous permettra de choisir parmi un certain nombre de documents et de dossiers prédéfinis. Il vous sera demandé de donner un nom au nouvel élément.

source: You can always rename an item by selecting **Rename Item** from the **Project** menu, or by pressing :kbd:`F2` when a document or folder is selected.
fr: Vous pouvez toujours renommer un élément en sélectionnant **Renommer un élément** dans le menu **Projet**, ou en appuyant sur :kbd:`F2` lorsqu'un document ou un dossier est sélectionné.
