Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/project_overview.po
Languages: fr

source: Other settings for project documents and folders are available from the context menu that you can activate by right-clicking on an it in the tree. The **Transform** submenu includes options for converting, splitting, or merging documents. See :ref:`a_ui_tree_split_merge` for more details on the latter two.
fr: D'autres paramètres pour les documents et dossiers du projet sont disponibles dans le menu contextuel que vous pouvez activer en cliquant avec le bouton droit de la souris sur un élément de l'arborescence. Le sous-menu **Transformer** comprend des options pour convertir, diviser ou fusionner des documents. Voir :ref:`a_ui_tree_split_merge` pour plus de détails sur ces deux dernières options.

source: Document Templates
fr: Modèles de documents

source: If you wish to create template documents to be used when creating new project documents, like for instance a character note template, you can add a **Templates** root folder to your project. Any document added to this root folder will show up in the **Add Item** menu in the project tree toolbar. When selected, a new document is created with its content copied from the chosen template.
fr: Si vous souhaitez créer des documents modèles à utiliser lors de la création de nouveaux documents de projet, comme par exemple un modèle de note de caractère, vous pouvez ajouter un dossier racine **Modèles** à votre projet. Tout document ajouté à ce dossier racine apparaîtra dans le menu **Ajouter un élément** de la barre d'outils de l'arborescence du projet. Lorsqu'il est sélectionné, un nouveau document est créé dont le contenu est copié à partir du modèle choisi.

source: Word Counts
fr: Nombre de mots

source: A character, word and paragraph count is maintained for each document, as well as for each section of a document following a :term:`heading<headings>`. The word count and change of words in the current session is displayed in the footer of any document open in the editor, and all stats are shown in the details panel below the project tree for any document selected in the project or novel trees.
fr: Un décompte des caractères, des mots et des paragraphes est maintenu pour chaque document, ainsi que pour chaque section d'un document suivant un :term:`titre<headings>`. Le nombre de mots et le changement de mots dans la session en cours sont affichés dans le pied de page de tout document ouvert dans l'éditeur, et toutes les statistiques sont affichées dans le panneau de détails sous l'arborescence du projet pour tout document sélectionné dans l'arborescence du projet ou des romans.

source: The word counts are not updated in real time, but run in the background every few seconds for as long as the document is being actively edited.
fr: Le décompte des mots n'est pas mis à jour en temps réel, mais s'exécute en arrière-plan toutes les quelques secondes tant que le document est activement édité.

source: A total project word count is displayed in the status bar. The total count depends on the sum of the values in the project tree, which again depend on an up to date :term:`project index`. If the counts seem wrong, a full project word recount can be initiated by rebuilding the project's index. Either from the **Tools** menu, or by pressing :kbd:`F9`.
fr: Le nombre total de mots du projet est affiché dans la barre d'état. Le décompte total dépend de la somme des valeurs de l'arborescence du projet, qui dépendent à leur tour d'un :term:`index du projet` à jour. Si le décompte semble erroné, un recomptage complet des mots du projet peut être lancé en reconstruisant l'index du projet. Soit à partir du menu **Outils**, soit en appuyant sur :kbd:`F9`.

source: The rules for how the counts are made is covered in more detail in :ref:`a_counting`.
fr: Les règles de comptage sont décrites plus en détail dans :ref:`a_counting`.

source: Project Settings
fr: Paramètres du projet

source: The **Project Settings** can be accessed from the **Project** menu, or by pressing :kbd:`Ctrl+Shift+,`. This will open a dialog box, with a set of tabs.
fr: Les **Paramètres du projet** sont accessibles depuis le menu **Projet**, ou en appuyant sur :kbd:`Ctrl+Maj+,`. Cela ouvrira une boîte de dialogue, avec une série d'onglets.

source: Settings Tab
fr: Onglet Paramètres

source: The **Settings** tab holds the project name, author, and language settings.
fr: L'onglet **Paramètres** contient les paramètres relatifs au nom du projet, à l'auteur et à la langue.

source: The **Project Name** can be edited here. It is used for the main window title and for generating backup files. So keep in mind that if you do change this setting, the backup file names will change too.
fr: Le **Nom du projet** peut être modifié ici. Il est utilisé pour le titre de la fenêtre principale et pour la génération des fichiers de sauvegarde. Gardez donc à l'esprit que si vous modifiez ce paramètre, les noms des fichiers de sauvegarde changeront également.

source: You can also change the **Authors** and **Project Language** setting. These are only used when building the manuscript, for some formats. The language setting is also used when inserting text into documents in the viewer, like for instance labels for keywords and special comments.
fr: Vous pouvez également modifier les paramètres **Auteurs** et **Langue du projet**. Ces paramètres ne sont utilisés que lors de la construction du manuscrit, pour certains formats. Le paramètre de langue est également utilisé lors de l'insertion de texte dans les documents dans l'afficheur, comme par exemple les étiquettes pour les mots-clés et les commentaires spéciaux.

source: If your project is in a different language than your main spell checking language is set to, you can override the default setting here. The project language can also be changed from the **Tools** menu.
fr: Si votre projet est rédigé dans une langue différente de la langue de vérification orthographique principale, vous pouvez remplacer le paramètre par défaut ici. La langue du projet peut également être modifiée à partir du menu **Outils**.

source: You can also override the automatic backup setting for the project if you wish.
fr: Vous pouvez également remplacer le paramètre de sauvegarde automatique du projet si vous le souhaitez.

source: Status and Importance Tabs
fr: Onglets Statut et Importance

source: Each document or folder of type **Novel** can be given a "Status" label accompanied by a coloured icon with an optional shape selected from a list of pre-defined shapes. Each document or folder of the remaining types can be given an "Importance" label with the same customisation options.
fr: Chaque document ou dossier de type **Roman** peut recevoir une étiquette « Statut » accompagnée d'une icône colorée avec une forme optionnelle sélectionnée dans une liste de formes prédéfinies. Chaque document ou dossier des autres types peut recevoir une étiquette « Importance » avec les mêmes options de personnalisation.

source: These labels are there purely for your convenience, and you are not required to use them for any other features to work. No other part of novelWriter accesses this information. The intention is to use these to indicate at what stage of completion each novel document is, or how important the content of a note is to the story. You don't have to use them this way, that's just what they were intended for, but you can make them whatever you want.
fr: Ces étiquettes sont là uniquement pour votre commodité, et vous n'êtes pas obligé de les utiliser pour que d'autres fonctionnalités fonctionnent. Aucune autre partie de novelWriter n'accède à ces informations. L'intention est de les utiliser pour indiquer à quel stade d'achèvement se trouve chaque document de roman, ou à quel point le contenu d'une note est important pour l'histoire. Vous n'êtes pas obligé de les utiliser de cette manière, c'est juste ce pour quoi elles ont été conçues, mais vous pouvez en faire ce que vous voulez.

source: Both status and importance labels can be exported and imported so you can share them between projects, or define a standard set for all your writing projects. When you import labels to a project, they are always added as *new* labels.
fr: Les étiquettes d'état et d'importance peuvent être exportées et importées afin que vous puissiez les partager entre les projets ou définir un ensemble standard pour tous vos projets d'écriture. Lorsque vous importez des étiquettes dans un projet, elles sont toujours ajoutées en tant que *nouvelles* étiquettes.

source: See also :ref:`a_ui_tree_status`.
fr: Voir aussi :ref:`a_ui_tree_status`.

source: The status or importance level currently in use by one or more documents cannot be deleted, but they can be edited.
fr: Le statut ou le niveau d'importance actuellement utilisé par un ou plusieurs documents ne peut pas être supprimé, mais il peut être modifié.

source: Auto-Replace Tab
fr: Onglet Remplacement automatique

source: A set of automatically replaced keywords can be added in this tab. The keywords in the left column will be replaced by the text in the right column when documents are opened in the viewer. They will also be applied to manuscript builds.
fr: Un ensemble de mots-clés de remplacement automatiquement peut être ajouté dans cet onglet. Les mots-clés de la colonne de gauche seront remplacés par le texte de la colonne de droite lorsque les documents seront ouverts dans l'afficheur. Ils seront également appliqués aux constructions de manuscrits.

source: The auto-replace feature will replace text in angle brackets that is in this list. The syntax highlighter will add an alternate colour to text matching the syntax, but it doesn't check if the text is in this list.
fr: La fonction de remplacement automatique remplace le texte entre crochets qui se trouve dans cette liste. Le surligneur syntaxique ajoutera une couleur alternative au texte correspondant à la syntaxe, mais il ne vérifie pas si le texte se trouve dans cette liste.

source: A keyword cannot contain spaces. The angle brackets are added by default, and when used in the text are a part of the keyword to be replaced. This is to ensure that parts of the text aren't unintentionally replaced by the content of the list.
fr: Un mot-clé ne peut pas contenir d'espaces. Les crochets sont ajoutés par défaut et, lorsqu'ils sont utilisés dans le texte, ils font partie du mot-clé à remplacer. Cela permet de s'assurer que certaines parties du texte ne sont pas remplacées involontairement par le contenu de la liste.

source: Backup
fr: Sauvegarde

source: An automatic backup system is built into novelWriter. In order to use it, a backup path to where the backup files are to be stored must be provided in **Preferences**. The path defaults to a folder named "Backups" in your home directory.
fr: Un système de sauvegarde automatique est intégré à novelWriter. Pour l'utiliser, un chemin d'accès à l'endroit où les fichiers de sauvegarde doivent être stockés doit être indiqué dans les **Préférences**. Le chemin d'accès est par défaut un dossier nommé « Backups » dans votre répertoire personnel.

source: Backups can be run automatically when a project is closed, which also implies it is run when the application itself is closed. Backups are date stamped zip files of the project files in the project folder (files not strictly a part of the project are ignored). The zip archives are stored in a subfolder of the backup path. The subfolder will have the same name as the **Project Name** as defined in :ref:`a_proj_settings`.
fr: Les sauvegardes peuvent être exécutées automatiquement lorsqu'un projet est fermé, ce qui implique également qu'elles sont exécutées lorsque l'application elle-même est fermée. Les sauvegardes sont des fichiers zip datés des fichiers du projet dans le dossier du projet (les fichiers qui ne font pas strictement partie du projet sont ignorés). Les archives zip sont stockées dans un sous-dossier du chemin de sauvegarde. Le sous-dossier aura le même nom que le **nom du projet** tel que défini dans :ref:`a_proj_settings`.

source: The backup feature, when configured, can also be run manually from the **Tools** menu. It is also possible to disable automated backups for a given project in **Project Settings**.
fr: La fonction de sauvegarde, lorsqu'elle est configurée, peut également être exécutée manuellement à partir du menu **Outils**. Il est également possible de désactiver les sauvegardes automatiques pour un projet donné dans **Paramètres du projet**.

source: For the backup to be able to run, the **Project Name** must be set in **Project Settings**. This value is used to generate the name and path of the backups. Without it, the backup will not run at all, but it will produce a warning message.
fr: Pour que la sauvegarde puisse être exécutée, le **Nom du projet** doit être défini dans **Paramètres du projet**. Cette valeur est utilisée pour générer le nom et le chemin des sauvegardes. Sans cette valeur, la sauvegarde ne s'exécutera pas du tout, mais elle produira un message d'avertissement.

source: Writing Statistics
fr: Statistiques d'écriture

source: When you work on a project, a log file records when you opened it, when you closed it, and the total word counts of your novel documents and notes at the end of the session, provided that the session lasted either more than 5 minutes, or that the total word count changed. For more details about the log file, see :ref:`a_storage`.
fr: Lorsque vous travaillez sur un projet, un fichier journal enregistre le moment où vous l'avez ouvert, le moment où vous l'avez fermé, et le nombre total de mots de vos documents et notes à la fin de la session, à condition que la session ait duré plus de 5 minutes, ou que le nombre total de mots ait changé. Pour plus de détails sur le fichier journal, voir :ref:`a_storage`.

source: A tool to view the content of the log file is available in the **Tools** menu under **Writing Statistics**. You can also launch it by pressing :kbd:`F6`, or find it on the sidebar.
fr: Un outil permettant de visualiser le contenu du fichier journal est disponible dans le menu **Outils** sous **Statistiques d'écriture**. Vous pouvez également le lancer en appuyant sur :kbd:`F6`, ou le trouver dans la barre latérale.

source: The tool will show a list of all your sessions, and a set of filters to apply to the data. You can also export the filtered data to a JSON file or to a CSV file that can be opened by a spreadsheet application like for instance Libre Office Calc or Excel.
fr: L'outil affichera une liste de toutes vos sessions, ainsi qu'un ensemble de filtres à appliquer aux données. Vous pouvez également exporter les données filtrées vers un fichier JSON ou vers un fichier CSV qui peut être ouvert par un tableur comme par exemple Libre Office Calc ou Excel.

source: As of version 1.2, the log file also stores how much of the session time was spent idle. The definition of idle here is that the novelWriter main window loses focus, or the user hasn't made any changes to the currently open document in five minutes. The number of minutes can be altered in **Preferences**.
fr: À partir de la version 1.2, le fichier journal enregistre également le temps d'inactivité de la session. La définition de l'inactivité ici est que la fenêtre principale de novelWriter perd le focus, ou que l'utilisateur n'a pas fait de changements au document actuellement ouvert depuis cinq minutes. Le nombre de minutes peut être modifié dans les **Préférences**.

source: Session Timer
fr: Chronomètre de session

source: A session timer is by default visible in the status bar. The icon will show you a clock icon when you are active, and a pause icon when you are considered "idle" per the criteria mentioned above.
fr: Un chronomètre de session est visible par défaut dans la barre d'état. L'icône affiche une horloge lorsque vous êtes actif et une icône de pause lorsque vous êtes considéré comme « inactif » selon les critères mentionnés ci-dessus.

source: If you do not wish to see the timer, you can click on it once to hide it. The icon will still be visible. Click the icon once more to display the timer again.
fr: Si vous ne souhaitez pas voir le chronomètre, vous pouvez cliquer une fois dessus pour le masquer. L'icône restera visible. Cliquez à nouveau sur l'icône pour afficher à nouveau le chronomètre.

source: As of version 2.6, clicking the timer text or icon in the status bar will toggle its visibility.
fr: Depuis la version 2.6, un clic sur le texte ou l'icône du chronomètre dans la barre d'état permet de basculer sa visibilité.
