Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/tech_tests.po
Languages: fr

source: Running Tests
fr: Exécution des tests

source: The novelWriter source code is well covered by tests. The test framework used for the development is ``pytest`` with the use of an extension for Qt.
fr: Le code source de novelWriter est bien couvert par des tests. Le cadre de test utilisé pour le développement est ``pytest`` avec l'utilisation d'une extension pour Qt.

source: Dependencies
fr: Dépendances

source: The dependencies for running the tests can be installed with:
fr: Les dépendances nécessaires à l'exécution des tests peuvent être installées avec :

source: This will install a couple of extra packages for coverage and test management. The minimum requirement is ``pytest`` and ``pytest-qt``.
fr: Cela installera quelques paquets supplémentaires pour la couverture et la gestion des tests. Le minimum requis est ``pytest`` et ``pytest-qt``.

source: Simple Test Run
fr: Test simple

source: To run the tests, you simply need to execute the following from the root of the source folder:
fr: Pour exécuter les tests, il suffit d'exécuter ce qui suit à partir de la racine du dossier source :

source: Since several of the tests involve opening up the novelWriter GUI, you may want to disable the GUI for the duration of the test run. Moving your mouse while the tests are running may otherwise interfere with the execution of some tests.
fr: Puisque plusieurs des tests impliquent l'ouverture de l'interface graphique de novelWriter, vous pouvez désactiver l'interface graphique pour la durée de l'exécution du test. Si vous déplacez votre souris pendant que les tests sont en cours d'exécution, vous risquez d'interférer avec l'exécution de certains tests.

source: You can disable the renderring of the GUI by setting the flag ``QT_QPA_PLATFORM=offscreen``:
fr: Vous pouvez désactiver le rendu de l'interface graphique en définissant le drapeau ``QT_QPA_PLATFORM=offscreen`` :

source: Advanced Options
fr: Options avancées

source: Adding the flag ``-v`` to the ``pytest`` command will increase verbosity of the test execution.
fr: L'ajout du drapeau ``-v`` à la commande ``pytest`` augmente la verbosité de l'exécution du test.

source: You can also add coverage report generation. For instance to HTML:
fr: Vous pouvez également ajouter la génération de rapports de couverture. Par exemple en HTML :

source: Other useful report formats are ``xml``, and ``term`` for terminal output.
fr: D'autres formats de rapport utiles sont ``xml``, et ``term`` pour la sortie terminal.

source: You can also run tests per subpackage of novelWriter with the ``-m`` command. The available subpackage groups are ``base``, ``core``, and ``gui``. Consider for instance:
fr: Vous pouvez aussi lancer des tests par sous-paquet de novelWriter avec la commande ``-m``. Les groupes de sous-paquetages disponibles sont ``base``, ``core``, et ``gui``. Prenons un exemple :

source: This will only run the tests of the "core" package, that is, all the classes that deal with the project data of a novelWriter project. The "gui" tests, likewise, will run the tests for the GUI components, and the "base" tests cover the bits in-between.
fr: Ceci n'exécutera que les tests du paquet « core », c'est-à-dire toutes les classes qui traitent les données d'un projet novelWriter. Les tests « gui », de même, exécuteront les tests des composants de l'interface graphique, et les tests « base » couvriront les éléments intermédiaires.

source: You can also filter the tests with the ``-k`` switch. The following will do the same as ``-m core``:
fr: Vous pouvez également filtrer les tests avec le commutateur ``-k``. Ce qui suit fera la même chose que ``-m core`` :

source: All tests are named in such a way that you can filter them by adding more bits of the test names. They all start with the word "test". Then comes the group: "Core", "Base", "Dlg", "Tool", or "Gui". Finally comes the name of the class or module, which generally corresponds to a single source code file. For instance, running the following will run all tests for the document editor:
fr: Tous les tests sont nommés de manière à ce que vous puissiez les filtrer en ajoutant d'autres éléments aux noms des tests. Ils commencent tous par le mot « test ». Vient ensuite le groupe : « Core », “Base”, “Dlg”, “Tool” ou “Gui”. Enfin, vient le nom de la classe ou du module, qui correspond généralement à un seul fichier de code source. Par exemple, l'exécution de ce qui suit lancera tous les tests pour l'éditeur de documents :

source: To run a single test, simply add the full test name to the ``-k`` switch.
fr: Pour lancer un seul test, il suffit d'ajouter le nom complet du test au commutateur ``-k``.
