Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_project.po
Languages: fr

source: Project Views
fr: Vues du projet

source: This chapter covers in more detail the different project views available in novelWriter.
fr: Ce chapitre couvre plus en détail les différentes vues de projet disponibles dans novelWriter.

source: The **Project Content** tree as it appears when loading a sample project.
fr: L'arborescence du **Contenu du projet** telle qu'elle apparaît lors du chargement d'un exemple de projet.

source: The Project Tree
fr: L’arborescence du projet

source: The main window contains a project tree in the left-most panel. It shows the entire structure of the project, and has four columns.
fr: La fenêtre principale contient l'arborescence du projet dans le panneau le plus à gauche. Elle montre la structure complète du projet et comporte quatre colonnes.

source: **Column 1**
fr: **Colonne 1**

source: The first column shows the icon and label of each folder, document, or note in your project. The label is not the same as the heading title you set inside the document. However, the document's label will appear in the header above the document text itself so you know where in the project an open document belongs. The icon is selected based on the type of item, and for novel documents, the level of the first heading in the document text.
fr: La première colonne affiche l'icône et l'étiquette de chaque dossier, document ou note de votre projet. L'étiquette n'est pas la même que le titre de l'en-tête que vous avez défini dans le document. Toutefois, l'étiquette du document apparaît dans l'en-tête, au-dessus du texte du document lui-même, afin que vous sachiez à quel endroit du projet appartient un document ouvert. L'icône est sélectionnée en fonction du type d'élément et, pour les nouveaux documents, du niveau du premier titre dans le texte du document.

source: **Column 2**
fr: **Colonne 2**

source: The second column shows the word count of the document, or the sum of words of the child items for folders and documents with sub-documents. If the counts seem incorrect, they can be updated by rebuilding the :term:`project index` from the **Tools** menu, or by pressing :kbd:`F9`.
fr: La deuxième colonne indique le nombre de mots du document, ou la somme des mots des éléments enfants pour les dossiers et les documents avec sous-documents. Si les décomptes semblent incorrects, ils peuvent être mis à jour en reconstruisant le :term:`index du projet` à partir du menu **Outils**, ou en appuyant sur :kbd:`F9`.

source: **Column 3**
fr: **Colonne 3**

source: The third column indicates whether the document is considered active or inactive in the project. You can use this flag to indicate that a document is still in the project, but should not be considered an active part of it. When you run the **Build Manuscript** tool, you can include or exclude documents based on this flag. You can change this value from the right-click :term:`context menu`.
fr: La troisième colonne indique si le document est considéré comme actif ou inactif dans le projet. Vous pouvez utiliser ce drapeau pour indiquer qu'un document est toujours dans le projet, mais qu'il ne doit pas être considéré comme une partie active de celui-ci. Lorsque vous exécutez l'outil **Compiler le manuscrit**, vous pouvez inclure ou exclure des documents en fonction de cet indicateur. Vous pouvez modifier cette valeur à partir du :term:`menu contextuel` en cliquant avec le bouton droit de la souris.

source: **Column 4**
fr: **Colonne 4**

source: The fourth column shows the user-defined status or importance labels you've assigned to each project item. See :ref:`a_ui_tree_status` for more details on how to uses these labels. You can select these labels from the :term:`context menu`, and define them in **Project Settings**.
fr: La quatrième colonne montre les étiquettes de statut ou d'importance définies par l'utilisateur que vous avez attribuées à chaque élément du projet.Voir :ref:`a_ui_tree_status` pour plus de détails sur l'utilisation de ces étiquettes.Vous pouvez sélectionner ces étiquettes dans le :term:`menu contextuel`, et les définir dans **Réglages du projet**.

source: Right-clicking an item in the project tree will open a context menu under the cursor, displaying a selection of actions that can be performed on the selected item.
fr: Un clic droit sur un élément de l'arborescence du projet ouvre un menu contextuel sous le curseur, affichant une sélection d'actions pouvant être effectuées sur l'élément sélectionné.

source: At the top of the project tree, you will find a set of buttons.
fr: En haut de l'arborescence du projet, vous trouverez une série de boutons.

source: The first button is a quick links button that will show you a dropdown menu of all the :term:`root folders<root folder>` in your project. Selecting one will move to that position in the tree. You can also activate this menu by pressing :kbd:`Ctrl+L`.
fr: Le premier bouton est un bouton de liens rapides qui affiche un menu déroulant de tous les :term:`dossiers racines<root folder>` de votre projet. En sélectionnant l'un d'entre eux, vous vous déplacerez à la position correspondante dans l'arborescence. Vous pouvez également activer ce menu en appuyant sur :kbd:`Ctrl+L`.

source: The next two buttons can be used to move items up and down in the project tree. This is the only way to move root folders.
fr: Les deux boutons suivants permettent de déplacer des éléments vers le haut ou vers le bas dans l'arborescence du projet. C'est la seule façon de déplacer les dossiers racines.

source: The next button opens a dropdown menu for adding new items to the tree. This includes root folders and template documents. You can also activate this dropdown menu by pressing :kbd:`Ctrl+N`.
fr: Le bouton suivant ouvre un menu déroulant permettant d'ajouter de nouveaux éléments à l'arborescence. Cela inclut les dossiers racines et les documents modèles. Vous pouvez également activer ce menu déroulant en appuyant sur :kbd:`Ctrl+N`.

source: The last button is a menu of further actions you can apply to the project tree.
fr: Le dernier bouton est un menu d'actions supplémentaires que vous pouvez appliquer à l'arborescence du projet.

source: Below the project tree you will find a small details panel showing the full information of the currently selected item. This panel also includes the latest paragraph and character counts in addition to the word count.
fr: Sous l'arborescence du projet, vous trouverez un petit panneau de détails affichant les informations complètes de l'élément sélectionné. Ce panneau comprend également les derniers décomptes de paragraphes et de caractères, en plus du nombre de mots.

source: If you want to set the label of a document to be the same as a header within it, you can right-click a header in the document when it is open in the editor and select :guilabel:`Set as Document Name` from the context menu.
fr: Si vous souhaitez que l'étiquette d'un document soit identique à celle d'un en-tête, vous pouvez cliquer avec le bouton droit de la souris sur un en-tête du document lorsqu'il est ouvert dans l'éditeur et sélectionner :guilabel:`Définir comme nom du document` dans le menu contextuel.

source: Splitting and Merging Documents
fr: Séparation et fusion de documents

source: Under the **Transform** submenu in the context menu of an item in the project tree, you will find several options on how to change a document or folder. This includes changing between document and note, but also splitting them into multiple documents, or merging child items into a single document.
fr: Dans le sous-menu **Transformer** du menu contextuel d'un élément de l'arborescence du projet, vous trouverez plusieurs options permettant de modifier un document ou un dossier. Il s'agit notamment de passer d'un document à une note, mais aussi de les diviser en plusieurs documents ou de fusionner des éléments enfants en un seul document.

source: Splitting Documents
fr: Découper des documents

source: The **Split Document** dialog.
fr: La boîte de dialogue **découper un document**.

source: The **Split Document by Headings** option will open a dialog that allows you to split the selected document into multiple new documents based on the headings it contains. You can select at which heading level the split is to be performed from the dropdown box. The list box will preview which headings will be split into new documents.
fr: L'option **découper le document selon les titres** ouvre une boîte de dialogue qui vous permet de découper le document sélectionné en plusieurs nouveaux documents sur la base des en-têtes qu'il contient. Vous pouvez sélectionner le niveau de rubrique auquel le fractionnement doit être effectué dans la liste déroulante. La liste déroulante affiche un aperçu des rubriques qui seront scindées en nouveaux documents.

source: You are given the option to create a folder for these new documents, and whether or not to create a hierarchy of documents. That is, put sections under scenes, and scenes under chapters.
fr: Vous avez la possibilité de créer un dossier pour ces nouveaux documents et de créer ou non une hiérarchie entre les documents. C'est-à-dire de placer les sections sous les scènes, et les scènes sous les chapitres.

source: The source document **is not** deleted in the process, but you have the option to let the tool move the source document to the :guilabel:`Trash` folder.
fr: Le document source **n'est pas** supprimé au cours du processus, mais vous avez la possibilité de laisser l'outil déplacer le document source dans le dossier :guilabel:`Corbeille`.

source: Merging Documents
fr: Fusionner des documents

source: The **Merge Documents** dialog.
fr: La boîte de dialogue **Fusionner des documents**.

source: You have two options for merging documents that are child elements of another document. You can either **Merge Child Items into Self** and **Merge Child Items into New**. The first option will pull all content of child items and merge them into the parent document, while the second option will create a new document in the process.
fr: Vous disposez de deux options pour fusionner des documents qui sont des éléments enfants d'un autre document. Vous pouvez soit **Intégrer les éléments enfants**, soit **Créer une fusion des éléments enfants**. La première option permet d'extraire tout le contenu des éléments enfants et de les fusionner dans le document parent, tandis que la seconde option crée un nouveau document au cours du processus.

source: When merging documents in a folder, you only have the latter process is possible, so only the choice **Merge Documents in Folder** is available.
fr: Lorsque vous fusionnez des documents dans un dossier, seul ce dernier processus est possible, de sorte que seul le choix **Fusionner les documents du dossier** est disponible.

source: In either case, the **Merge Documents** dialog will let you exclude documents you don't want to include, and it also lets you reorder them if you wish.
fr: Dans les deux cas, la boîte de dialogue **Fusionner des documents** vous permet d'exclure les documents que vous ne souhaitez pas inclure et de les réorganiser si vous le souhaitez.

source: Document Importance and Status
fr: Importance et statut du document

source: Each document or folder in your project can have either a "Status" or "Importance" flag set. These are flags that you control and define yourself, and novelWriter doesn't use them for anything. To modify the labels, go to their respective tabs in **Project Settings**.
fr: Chaque document ou dossier de votre projet peut avoir un indicateur « État » ou « Importance ». Ce sont des indicateurs que vous contrôlez et définissez vous-même, et novelWriter ne les utilise pas pour quoi que ce soit. Pour modifier les étiquettes, allez dans leurs onglets respectifs dans **Paramètres du projet**.

source: The "Status" flag is intended to tag a :term:`novel document<novel documents>` as for instance a draft or as completed, and the "Importance" flag is intended to tag character notes, or other :term:`project notes`, as for instance a main, major, or minor character or story element.
fr: L'indicateur « État » est destiné à marquer un :term:`document de roman<novel documents>` comme étant par exemple un brouillon ou comme étant terminé, et l'indicateur « Importance » est destiné à marquer des notes sur les personnages, ou d'autres :term:`notes de projet`, comme par exemple un personnage principal, majeur ou mineur, ou un élément de l'histoire.

source: Whether a document uses a "Status" or "Importance" flag depends on which :term:`root folder` it lives in. If it's in a **Novel** type folder, it uses the "Status" flag, otherwise it uses an "Importance" flag.
fr: L'utilisation de l'indicateur « État » ou « Importance » dépend du :term:`dossier racine` dans lequel se trouve le document. S'il se trouve dans un dossier de type **Roman**, il utilise l'indicateur « État », sinon il utilise l'indicateur « Importance ».

source: Project Tree Drag & Drop
fr: Glisser-déposer de l'arborescence du projet

source: The project tree allows drag & drop to allow you to reorder your documents and folders. Moving a document in the project tree will affect the text's position when you assemble your manuscript in the **Manuscript Build** tool.
fr: L'arborescence du projet permet d'effectuer un glisser-déposer pour réorganiser les documents et les dossiers. Le déplacement d'un document dans l'arborescence du projet affectera la position du texte lorsque vous assemblerez votre manuscrit dans l'outil **Compiler le manuscrit**.

source: You can now select multiple items in the project tree by holding down the :kbd:`Ctrl` or :kbd:`Shift` key while selecting items.
fr: Vous pouvez maintenant sélectionner plusieurs éléments dans l'arborescence du projet en maintenant la touche :kbd:`Ctrl` ou :kbd:`Maj` enfoncée pendant la sélection des éléments.

source: Documents and their folders can be rearranged freely within their root folders. If you move a **Novel Document** out of a **Novel** folder, it will be converted to a **Project Note**. Notes can be moved freely between all root folders, but keep in mind that if you move a note into a **Novel** type root folder, its "Importance" setting will be replaced by a "Status" setting. See :ref:`a_ui_tree_status`. The old value will not be overwritten though, and should be restored if you move it back at some point.
fr: Les documents et leurs dossiers peuvent être réorganisés librement à l'intérieur de leur dossier racine. Si vous déplacez un **Document du roman** hors d'un dossier **roman**, il sera converti en **Notes de projet**. Les notes peuvent être déplacées librement entre tous les dossiers racine, mais gardez à l'esprit que si vous déplacez une note dans un dossier racine de type **roman**, son paramètre « Importance “ sera remplacé par un paramètre ” État ». Voir :ref:`a_ui_tree_status`. L'ancienne valeur ne sera pas écrasée, et devrait être restaurée si vous la déplacez à nouveau à un moment donné.

source: Root folders in the project tree cannot be dragged and dropped at all. If you want to reorder them, you can move them up or down with respect to each other from the arrow buttons at the top of the project tree, or by pressing :kbd:`Ctrl+Up` or :kbd:`Ctrl+Down` when they are selected.
fr: Les dossiers racines de l'arborescence du projet ne peuvent pas être glissés et déposés. Si vous souhaitez les réorganiser, vous pouvez les déplacer vers le haut ou vers le bas à partir des boutons fléchés en haut de l'arborescence du projet, ou en appuyant sur :kbd:`Ctrl+Haut` ou :kbd:`Ctrl+Bas` lorsqu'ils sont sélectionnés.

source: You can drag and drop documents onto the editor or viewer panel to open them.
fr: Vous pouvez faire glisser et déposer des documents sur le panneau de l'éditeur ou de l'afficheur pour les ouvrir.

source: The Novel Tree View
fr: L'arborescence du roman

source: A screenshot of the Novel Tree View.
fr: Capture d'écran de l'arborescence d'un roman.

source: An alternative way to view the project structure is the novel view. You can switch to this view by selecting the :guilabel:`Novel View` button in the sidebar. This view is a simplified version of the view in the **Outline View**. It is convenient when you want to browse the structure of the story itself rather than the document files.
fr: Une autre façon de visualiser la structure du projet est la vue roman. Vous pouvez passer à cette vue en sélectionnant le bouton :guilabel:`Vue Roman` dans la barre latérale. Cette vue est une version simplifiée de la vue **Vue d'ensemble du roman**. Elle est pratique lorsque vous souhaitez parcourir la structure de l'histoire elle-même plutôt que les fichiers du document.

source: You cannot reorganise the entries in the novel view, or add any new documents, as that would imply restructuring the content of the document files themselves. Any such editing must be done in the project tree. However, you can add new headings to existing documents, or change references, which will be updated in this view when the document is saved.
fr: Vous ne pouvez pas réorganiser les entrées dans la vue roman, ni ajouter de nouveaux documents, car cela impliquerait de restructurer le contenu des fichiers de documents eux-mêmes. Toute modification de ce type doit être effectuée dans l'arborescence du projet. Cependant, vous pouvez ajouter de nouveaux titres aux documents existants ou modifier les références, qui seront mises à jour dans cette vue lors de l'enregistrement du document.

source: The Novel Outline View
fr: Vue d'ensemble du roman

source: A screenshot of the Novel Outline View.
fr: Capture d'écran de l'affichage du plan du roman.

source: The project's **Novel Outline View** is available as another view option from the sidebar. The outline provides an overview of the novel structure, displaying a tree hierarchy of the elements of the novel, that is, the level 1 to 4 headings representing partitions, chapters, scenes and sections.
fr: La **Vue d'ensemble du roman** du projet est disponible comme une autre option de vue dans la barre latérale. L'aperçu fournit une vue d'ensemble de la structure du roman, en affichant une hiérarchie arborescente des éléments du roman, c'est-à-dire les titres de niveau 1 à 4 représentant les partitions, les chapitres, les scènes et les sections.

source: The document containing the heading can also be displayed as a separate column, as well as the line number where the heading is defined. Double-clicking an entry will open the corresponding document in the editor and switch to **Project Tree View** mode.
fr: Le document contenant le titre peut également être affiché dans une colonne séparée, ainsi que le numéro de ligne où le titre est défini. Un double-clic sur une entrée ouvre le document correspondant dans l'éditeur et permet de passer en mode **Vue de l'arborescence du projet**.

source: You can select which novel folder to display from the dropdown menu. You can optionally also choose to show a combination of all novel folders.
fr: Vous pouvez sélectionner le dossier du roman à afficher dans le menu déroulant. Vous pouvez également choisir d'afficher une combinaison de tous les dossiers de romans.

source: Since the internal structure of the novel does not depend directly on the folder and document structure of the project tree, this view will not necessarily look the same, depending on how you choose to organise your documents. See the :ref:`a_struct` page for more details.
fr: Comme la structure interne du roman ne dépend pas directement de la structure des dossiers et des documents de l'arborescence du projet, cette vue ne sera pas nécessairement la même, selon la façon dont vous choisissez d'organiser vos documents. Voir la page :ref:`a_struct` pour plus de détails.

source: Various meta data and information extracted from :term:`tags<tag>` can be displayed in columns in the outline. A default set of such columns is visible, but you can turn on or off more columns from the menu button in the toolbar. The order of the columns can also be rearranged by dragging them to a different position. You column settings are saved between sessions on a per-project basis.
fr: Diverses métadonnées et informations extraites de :term:`tags<tag>` peuvent être affichées dans des colonnes du plan. Un ensemble de ces colonnes est visible par défaut, mais vous pouvez activer ou désactiver d'autres colonnes à partir du bouton de menu de la barre d'outils. L'ordre des colonnes peut également être réorganisé en les faisant glisser vers une autre position. Les paramètres des colonnes sont sauvegardés entre les sessions, par projet.

source: The **Title** column cannot be disabled or moved.
fr: La colonne **Titre** ne peut pas être désactivée ou déplacée.

source: The information viewed in the outline is based on the :term:`project index`. While novelWriter does its best to keep the index up to date when contents change, you can always rebuild it manually by pressing :kbd:`F9` if something isn't right.
fr: Les informations affichées dans l'aperçu sont basées sur l'index du projet :term:`index du projet`. Bien que novelWriter fasse de son mieux pour maintenir l'index à jour lorsque le contenu change, vous pouvez toujours le reconstruire manuellement en appuyant sur :kbd:`F9` si quelque chose ne va pas.

source: The outline view itself can be regenerated by pressing the refresh button. By default, the content is refreshed each time you switch to this view.
fr: La vue d'ensemble elle-même peut être régénérée en appuyant sur le bouton d'actualisation. Par défaut, le contenu est actualisé chaque fois que vous basculez dans cette vue.

source: The **Synopsis** column of the outline view takes its information from a specially formatted comment. See :ref:`a_fmt_comm`.
fr: La colonne **Synopsis** de la vue d'ensemble tire ses informations d'un commentaire spécialement formaté. Voir :ref:`a_fmt_comm`.
