Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_breakdown.po
Languages: fr

source: The files of a novelWriter project are stored in a dedicated project folder. The project structure is kept in a file at the root of this folder called ``nwProject.nwx``. All the document files and associated meta data are stored in other folders below the project folder. For a more technical description of what all the files mean and how they're organised, see the :ref:`a_storage` section.
fr: Les fichiers d'un projet novelWriter sont stockés dans un dossier dédié au projet. La structure du projet est conservée dans un fichier à la racine de ce dossier appelé ``nwProject.nwx``. Tous les fichiers de documents et les métadonnées associées sont stockés dans d'autres dossiers sous le dossier du projet. Pour une description plus technique de la signification de tous les fichiers et de leur organisation, voir la section :ref:`a_storage`.

source: This way of storing data was chosen for several reasons.
fr: Ce mode de stockage des données a été choisi pour plusieurs raisons.

source: Firstly, all the text you add to your project is saved directly to your project folder in separate files. Only the project structure and the text you are currently editing is stored in memory at any given time, which means there is a smaller risk of losing data if the application or your computer crashes.
fr: Tout d'abord, tout le texte que vous ajoutez à votre projet est enregistré directement dans le dossier de votre projet, dans des fichiers séparés. Seule la structure du projet et le texte que vous êtes en train d'éditer sont stockés en mémoire à un moment donné, ce qui signifie qu'il y a moins de risque de perdre des données si l'application ou votre ordinateur tombe en panne.

source: Secondly, having multiple small files means it is very easy to synchronise them between computers with standard file synchronisation tools.
fr: Deuxièmement, le fait d'avoir plusieurs petits fichiers signifie qu'il est très facile de les synchroniser entre ordinateurs à l'aide d'outils de synchronisation de fichiers standard.

source: Since novelWriter has to keep track of a bunch of files and folders when a project is open, it may not run well on some virtual file systems. A file or folder must be accessible with exactly the path it was saved or created with. An example where this is not the case is the way Google Drive is mapped on Linux Gnome desktops using gvfs/gio.
fr: Comme novelWriter doit garder la trace d'un grand nombre de fichiers et de dossiers lorsqu'un projet est ouvert, il peut ne pas fonctionner correctement sur certains systèmes de fichiers virtuels. Un fichier ou un dossier doit être accessible avec exactement le chemin avec lequel il a été sauvegardé ou créé. Un exemple où ce n'est pas le cas est la façon dont Google Drive est mappé sur les bureaux Linux Gnome en utilisant gvfs/gio.

source: You should not add additional files to the project folder yourself. Nor should you, as a rule, manually edit files within it. If you really must manually edit the text files, e.g. with some automated task you want to perform, you need to rebuild the :term:`Project Index` when you open the project again.
fr: Vous ne devez pas ajouter vous-même des fichiers supplémentaires au dossier du projet. En règle générale, vous ne devez pas non plus modifier manuellement les fichiers qui s'y trouvent. Si vous devez vraiment éditer manuellement les fichiers texte, par exemple dans le cadre d'une tâche automatisée, vous devez reconstruire le :term:`Index du projet` lorsque vous ouvrez à nouveau le projet.

source: Editing text files in the ``content`` folder is less risky as these are just plain text. Editing the main project XML file, however, may make the project file unreadable and you may crash novelWriter and lose project structure information and project settings.
fr: L'édition de fichiers texte dans le dossier ``content`` est moins risquée car il s'agit de texte simple. Cependant, éditer le fichier XML du projet principal peut rendre le fichier du projet illisible et vous risquez de planter novelWriter et de perdre les informations sur la structure et les paramètres du projet.
