Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_breakdown.po
Languages: fr

source: How it Works
fr: Comment ça marche

source: The main features of novelWriter are listed in the :ref:`a_intro` chapter. In this chapter, we go into some more details on how they are implemented. This is intended as an overview. Later on in this documentation these features will be covered in more detail.
fr: Les principales fonctionnalités de novelWriter sont listées dans le chapitre :ref:`a_intro`. Dans ce chapitre, nous entrons dans les détails de leur implémentation. Il s'agit d'une vue d'ensemble. Plus loin dans cette documentation, ces fonctionnalités seront abordées plus en détail.

source: GUI Layout and Design
fr: Mise en page et conception de l'interface graphique

source: The user interface of novelWriter is intended to be as minimalistic as practically possible, while at the same time provide useful features needed for writing a novel.
fr: L'interface utilisateur de novelWriter se veut aussi minimaliste que possible, tout en offrant les fonctionnalités utiles à l'écriture d'un roman.

source: The main window does not by default have an editor toolbar like many other applications do. This reduces clutter, and since the documents are formatted with style tags, it is not needed most of the time. Still, a small formatting toolbar can be popped out by clicking the left-most button in the header of the document editor. It gives quick access to standard formatting codes.
fr: La fenêtre principale ne comporte pas, par défaut, de barre d'outils d'édition, comme c'est le cas dans de nombreuses autres applications. Cela réduit l'encombrement et, comme les documents sont formatés avec des balises de style, la barre d'outils n'est pas nécessaire la plupart du temps. Néanmoins, une petite barre d'outils de formatage peut être affichée en cliquant sur le bouton le plus à gauche dans l'en-tête de l'éditeur de documents. Elle permet d'accéder rapidement aux codes de formatage standard.

source: Most formatting features supported are available through convenient keyboard shortcuts. They are also available in the main menu under **Format**, so you don't have to look up formatting codes every time you need them. For reference, a list of all shortcuts can be found in the :ref:`a_kb` chapter.
fr: La plupart des fonctions de formatage prises en charge sont accessibles par des raccourcis clavier pratiques. Ils sont également disponibles dans le menu principal sous **Format**, de sorte que vous n'avez pas à chercher les codes de formatage à chaque fois que vous en avez besoin. Pour référence, une liste de tous les raccourcis se trouve dans le chapitre :ref:`a_kb`.

source: novelWriter is not intended to be a full office type word processor. It doesn't support images, links, tables, and other complex structures and objects often needed for such documents. Formatting is limited to headings, in-line basic text formats, text alignment, and a few other simple features.
fr: novelWriter n'est pas conçu pour être un traitement de texte complet de type bureautique. Il ne prend pas en charge les images, les liens, les tableaux et autres structures et objets complexes souvent nécessaires pour de tels documents. Le formatage est limité aux titres, aux formats de texte de base en ligne, à l'alignement du texte et à quelques autres fonctions simples.

source: On the left side of the main window, you will find a sidebar. This bar has buttons for the standard views you can switch between, a quick link to the **Build Manuscript** tool, and a set of project-related tools and quick access to settings at the bottom.
fr: Sur le côté gauche de la fenêtre principale, vous trouverez une barre latérale. Cette barre comporte des boutons pour les vues standard entre lesquelles vous pouvez basculer, un lien rapide vers l'outil **Compiler le manuscrit**, ainsi qu'un ensemble d'outils liés au projet et un accès rapide aux paramètres dans la partie inférieure.

source: A number of new formatting options were added in 2.2 to allow for some special formatting cases. At the same time, a small formatting toolbar was added to the editor. It is hidden by default, but can be opened by pressing the button in the top--left corner of the editor header.
fr: Un certain nombre de nouvelles options de formatage ont été ajoutées dans la version 2.2 pour permettre certains cas de formatage particuliers. En même temps, une petite barre d'outils de formatage a été ajoutée à l'éditeur. Elle est cachée par défaut, mais peut être ouverte en appuyant sur le bouton situé dans le coin supérieur gauche de l'en-tête de l'éditeur.

source: Project Tree and Editor View
fr: Arborescence du projet et vue de l'éditeur

source: A screenshot of the Project Tree and Editor View.
fr: Capture d'écran de l'arborescence du projet et de la vue de l'éditeur.

source: When the application is in **Project Tree View** mode, the work area of the main window is split in two, or optionally three, panels. The left-most panel contains the project tree and all the documents in your project. The second panel is the document editor.
fr: Lorsque l'application est en mode **Arborescence du projet**, la zone de travail de la fenêtre principale est divisée en deux, ou éventuellement trois, panneaux. Le panneau le plus à gauche contient l'arborescence du projet et tous les documents de votre projet. Le deuxième panneau est l'éditeur de documents.

source: An optional third panel on the right side contains a document viewer which can view any document in your project independently of what is open in the document editor. This panel is not intended as a preview window, although you can use it for this purpose if you wish. For instance if you need to check that the formatting tags behave as you expect. However, the main purpose of the viewer is for viewing your notes next to your editor while you're writing.
fr: Un troisième panneau facultatif sur le côté droit contient une visionneuse de documents qui peut afficher n'importe quel document de votre projet indépendamment de ce qui est ouvert dans l'éditeur de documents. Ce panneau n'est pas conçu comme une fenêtre de prévisualisation, bien que vous puissiez l'utiliser à cette fin si vous le souhaitez. Par exemple, si vous avez besoin de vérifier que les balises de formatage se comportent comme vous le souhaitez. Cependant, l'objectif principal de la visionneuse est de visualiser vos notes à côté de votre éditeur pendant que vous écrivez.

source: The editor also has a **Focus Mode** you can toggle either from the menu, from the icon in the editor's header, or by pressing :kbd:`F8`. When **Focus Mode** is enabled, all the user interface elements other than the document editor itself are hidden away.
fr: L'éditeur dispose également d'un **Mode Focus** que vous pouvez activer soit à partir du menu, soit à partir de l'icône dans l'en-tête de l'éditeur, soit en appuyant sur :kbd:`F8`. Lorsque le **Mode Focus** est activé, tous les éléments de l'interface utilisateur autres que l'éditeur de document lui-même sont cachés.

source: The project tree will highlight with a different background colour the document that is currently open in the editor.
fr: L'arborescence du projet met en évidence, avec une couleur d'arrière-plan différente, le document actuellement ouvert dans l'éditeur.

source: You can now drag and drop documents from the project tree onto the editor or viewer panels to open them.
fr: Vous pouvez désormais faire glisser et déposer des documents de l'arborescence du projet sur les panneaux de l'éditeur ou de l'afficheur pour les ouvrir.

source: Novel View and Editor View
fr: Vue du roman et vue de l'éditeur

source: A screenshot of the Novel Tree and Editor View.
fr: Capture d'écran de l'arborescence des romans et de la vue de l'éditeur.

source: When the application is in **Novel Tree View** mode, the project tree is replaced by an overview of your novel structure for a specific Novel :term:`root folder`. Instead of showing individual documents, the tree now shows all headings of your novel text. This includes multiple headings within the same document.
fr: Lorsque l'application est en mode **Arborescence du roman**, l'arborescence du projet est remplacée par une vue d'ensemble de la structure de votre roman pour un Novel :term:`dossier racine` spécifique. Au lieu de montrer des documents individuels, l'arbre montre maintenant tous les titres du texte de votre roman. Cela inclut les titres multiples au sein d'un même document.

source: Each heading is indented according to the heading level, not its parent/child relationship to other elements of your project. You can open and edit your novel documents from this view as well. All headings contained in the currently open document should be highlighted in the view to indicate which ones belong together in the same document.
fr: Chaque titre est indenté en fonction du niveau du titre, et non de sa relation parent/enfant avec d'autres éléments de votre projet. Vous pouvez également ouvrir et modifier vos nouveaux documents à partir de cette vue. Toutes les rubriques contenues dans le document actuellement ouvert doivent être mises en évidence dans la vue pour indiquer celles qui appartiennent au même document.

source: If you have multiple **Novel** type root folders, the header of the novel view becomes a dropdown box. You can then switch between them by clicking the :guilabel:`Outline of ...` text. You can also click the novel icon button next to it.
fr: Si vous avez plusieurs dossiers racine de type **Nouveau**, l'en-tête de la vue roman devient une liste déroulante. Vous pouvez alors passer de l'un à l'autre en cliquant sur le texte :guilabel:`Outline of ...`. Vous pouvez également cliquer sur le bouton de l'icône du roman situé à côté.

source: Generally, the novel view should update when you make changes to the novel structure, including edits of the current document in the editor. The information is only updated when the automatic save of the document is triggered, or you manually press :kbd:`Ctrl+S` to save changes. (You can adjust the auto-save interval in **Preferences**.) You can also regenerate the whole novel view by pressing the refresh button in the novel view header.
fr: En général, la vue du roman doit être mise à jour lorsque vous apportez des modifications à la structure du roman, y compris les modifications du document courant dans l'éditeur. Les informations ne sont mises à jour que lorsque la sauvegarde automatique du document est déclenchée, ou lorsque vous appuyez manuellement sur :kbd:`Ctrl+S` pour sauvegarder les modifications (vous pouvez ajuster l'intervalle de sauvegarde automatique dans **Préférences**). Vous pouvez également régénérer la vue du roman en entier en appuyant sur le bouton d'actualisation dans l'en-tête de la vue du roman.

source: It is possible to show an optional third column in the novel view. The settings are available from the menu button in the toolbar.
fr: Il est possible d'afficher une troisième colonne facultative dans la vue nouvelle. Les paramètres sont disponibles à partir du bouton de menu dans la barre d'outils.

source: If you click the triangular icon to the right of each item, a tooltip will pop out showing all the meta data collected for that heading.
fr: Si vous cliquez sur l'icône triangulaire à droite de chaque élément, une infobulle s'affichera, indiquant toutes les métadonnées collectées pour cette rubrique.

source: Novel Outline View
fr: Vue d'ensemble du roman

source: A screenshot of the Novel Outline View.
fr: Capture d'écran de la vue d'ensemble du roman.

source: When the application is in **Novel Outline View** mode, the tree, editor and viewer are replaced by a large table that shows the entire novel structure with all the tags and references listed. Pretty much all collected meta data is available here in different columns.
fr: Lorsque l'application est en mode **Vue d'ensemble du roman**, l'arbre, l'éditeur et l'afficheur sont remplacés par un grand tableau qui montre la structure complète du roman avec toutes les balises et les références listées. Pratiquement toutes les métadonnées collectées sont disponibles ici dans différentes colonnes.

source: You can select which novel root folder to display from the dropdown box, and you can select which columns to show or hide from the menu button. You can also rearrange the columns by drag and drop. The app remembers your column order and sizes between sessions, and for each individual project.
fr: Vous pouvez sélectionner le dossier racine du roman à afficher dans la liste déroulante, et vous pouvez sélectionner les colonnes à afficher ou à masquer à l'aide du bouton de menu. Vous pouvez également réorganiser les colonnes par glisser-déposer. L'application mémorise l'ordre et la taille des colonnes d'une session à l'autre et pour chaque projet individuel.

source: Colour Themes
fr: Thèmes

source: By default, novelWriter uses a light colour theme. You can also choose between a standard dark theme that have neutral colours, or a series of other included themes, from **Preferences**.
fr: Par défaut, novelWriter utilise un thème de couleur claire. Vous pouvez également choisir un thème sombre standard avec des couleurs neutres, ou une série d'autres thèmes inclus, dans les **Préférences**.

source: If you wish, you *can* create your own colour themes, and even have them added to the application. See :ref:`a_custom_theme` for more details.
fr: Si vous le souhaitez, vous pouvez créer vos propres thèmes de couleurs, et même les ajouter à l'application. Voir :ref:`a_custom_theme` pour plus de détails.

source: Switching the GUI colour theme does not affect the colours of the editor and viewer. They have separate colour selectable from the "Document colour theme" setting in **Preferences**. They are separated because there are a lot more options to choose from for the editor and viewer.
fr: Le changement de thème de couleur de l'interface graphique n'affecte pas les couleurs de l'éditeur et du visualiseur. Ils ont des couleurs séparées qui peuvent être sélectionnées à partir du paramètre « Thème de couleur du document » dans les **Préférences**. Elles sont séparées parce qu'il y a beaucoup plus d'options à choisir pour l'éditeur et le visualiseur.

source: If you switch between light and dark mode on the GUI, you should also switch editor theme to match, otherwise icons may be hard to see in the editor and viewer.
fr: Si vous passez du mode clair au mode foncé dans l'interface graphique, vous devez également changer le thème de l'éditeur pour qu'il corresponde, sinon les icônes risquent d'être difficiles à voir dans l'éditeur et le visualiseur.

source: Project Search
fr: Recherche dans un projet

source: A global search tool is available from the side bar. It allows you to search through your entire project. The tool does not provide a replace feature. There is a search and replace tool available in the document editor that acts on the open document.
fr: Un outil de recherche global est disponible dans la barre latérale. Il vous permet d'effectuer une recherche dans l'ensemble de votre projet. Cet outil n'offre pas de fonction de remplacement. Un outil de recherche et de remplacement est disponible dans l'éditeur de documents et agit sur le document ouvert.

source: Switching Focus
fr: Changer de focus

source: If the project or novel view does not have focus, pressing :kbd:`Ctrl+T` switches focus to whichever of the two is visible. If one of them already has focus, the key press will switch between them instead.
fr: Si la vue du projet ou du roman n'a pas le focus, presser :kbd:`Ctrl+T` fait basculer le focus sur celle des deux qui est visible. Si l'une d'entre elles a déjà le focus, la pression sur la touche permet de passer de l'une à l'autre.

source: Likewise, pressing :kbd:`Ctrl+E` will switch focus to the document editor or viewer, or if any of them already have focus, it will switch focus between them,
fr: De même, en appuyant sur :kbd:`Ctrl+E`, le focus passe à l'éditeur ou à l'afficheur du document, ou si l'un d'entre eux est déjà au focus, il passe de l'un à l'autre,

source: These two shortcuts make it possible to jump between all these GUI elements without having to reach for the mouse or touchpad.
fr: Ces deux raccourcis permettent de passer d'un élément de l'interface graphique à l'autre sans avoir à saisir la souris ou le pavé tactile.

source: Project Layout
fr: Structure du projet

source: This is a brief introduction to how you should structure your writing projects. All of this will be covered in more detail later.
fr: Il s'agit d'une brève introduction à la manière dont vous devez structurer vos projets d'écriture. Nous reviendrons plus en détail sur ce sujet ultérieurement.

source: The main point of novelWriter is that you are free to organise your project documents as you wish into sub-folders or sub-documents, and split the text between these documents in whatever way suits you. All that matters to novelWriter is the linear order the documents appear at in the project tree (top to bottom). The chapters, scenes and sections of the novel are determined by the headings within those documents.
fr: L'intérêt principal de novelWriter est que vous êtes libre d'organiser les documents de votre projet comme vous le souhaitez, dans des sous-dossiers ou des sous-documents, et de répartir le texte entre ces documents de la manière qui vous convient. Tout ce qui importe à novelWriter est l'ordre linéaire dans lequel les documents apparaissent dans l'arborescence du projet (de haut en bas). Les chapitres, scènes et sections du roman sont déterminés par les titres de ces documents.

source: An illustration of how heading levels correspond to the novel structure.
fr: Illustration de la correspondance entre les niveaux de rubriques et la structure du roman.

source: The four heading levels, **Level 1** to **Level 4**, are treated as follows:
fr: Les quatre niveaux de rubrique, **niveau 1** à **niveau 4**, sont traités comme suit :

source: **Level 1** is used for the novel title, and for partitions.
fr: **Le niveau 1** est utilisé pour le titre du roman et pour les partitions.

source: **Level 2** is used for chapter tiles.
fr: Le **niveau 2** est utilisé pour les titres de chapitres.

source: **Level 3** is used for scene titles -- optionally replaced by separators.
fr: **Le niveau 3** est utilisé pour les titres de scènes, éventuellement remplacés par des séparateurs.

source: **Level 4** is for section titles within scenes, if such granularity is needed.
fr: **Le niveau 4** est destiné aux titres de section à l'intérieur des scènes, si une telle granularité est nécessaire.

source: The project tree will select an icon for the document based on the first heading in it.
fr: L'arborescence du projet sélectionnera une icône pour le document en fonction de la première rubrique qu'il contient.

source: This heading level structure is only taken into account for :term:`novel documents`. For :term:`project notes`, the heading levels have no structural meaning, and you are free to use them however you want. See :ref:`a_struct` and :ref:`a_references` for more details.
fr: Cette structure de niveaux de rubriques n'est prise en compte que pour les :term:`documents du roman`. Pour :term:`notes de projet`, les niveaux d'en-tête n'ont pas de signification structurelle, et vous êtes libre de les utiliser comme vous le souhaitez. Voir :ref:`a_struct` et :ref:`a_references` pour plus de détails.

source: You can add documents as child items of other documents. This is often more useful than adding folders, since you anyway may want to have the chapter heading in a separate document from your individual scene documents so that you can rearrange scene documents freely without affecting chapter placement.
fr: Vous pouvez ajouter des documents en tant qu'éléments enfants d'autres documents. C'est souvent plus utile que d'ajouter des dossiers, car vous pouvez de toute façon vouloir que l'en-tête de chapitre figure dans un document distinct de vos documents de scène individuels, afin de pouvoir réorganiser librement les documents de scène sans affecter l'emplacement des chapitres.

source: The heading levels for partitions, chapters and scenes only apply within novelWriter. When you generate your manuscript, chapters are considered as the topmost heading level, with scenes below it. Partitions are inserted as text elements in most formats.
fr: Les niveaux d'en-tête pour les parties, les chapitres et les scènes ne s'appliquent qu'à novelWriter. Lorsque vous générez votre manuscrit, les chapitres sont considérés comme le niveau d'en-tête le plus élevé, et les scènes comme le niveau inférieur. Les partitions sont insérées comme des éléments de texte dans la plupart des formats.

source: Building a Manuscript
fr: Élaboration d'un manuscrit

source: The project can at any time be assembled into a range of different formats through the **Build Manuscript** tool. Natively, novelWriter supports `Open Document`_, Microsoft Word Document (known as `Office Open XML`_), HTML5, and various flavours of Markdown. You can also generate a PDF document.
fr: Le projet peut à tout moment être assemblé dans une gamme de formats différents grâce à l'outil **Compiler le manuscrit**. Nativement, novelWriter supporte `Open Document`_, Microsoft Word Document (connu sous le nom de `Office Open XML`_), HTML5, et diverses saveurs de Markdown. Vous pouvez également générer un document PDF.

source: The HTML5 format is suitable for conversion by a number of other tools like Pandoc_, or for importing into word processors if the Open Document or Word Document format isn't suitable. The Open Document format is supported by most office type applications, so is the Word Document format. In addition, printing is also possible.
fr: Le format HTML5 peut être converti par un certain nombre d'autres outils tels que Pandoc_, ou importé dans des traitements de texte si les formats Open Document ou Word Document ne conviennent pas. Le format Open Document est pris en charge par la plupart des applications bureautiques, tout comme le format Word Document. En outre, l'impression est également possible.

source: For advanced processing, you can export the content of the project to a JSON file. This is useful if you want to write your own custom processing script in for instance Python, as the entire novel can be read into a Python dictionary with a couple of lines of code. The JSON file can be populated with either HTML formatted text, or with the raw text as typed it into the novel documents.
fr: Pour un traitement avancé, vous pouvez exporter le contenu du projet vers un fichier JSON. Ceci est utile si vous souhaitez écrire votre propre script de traitement personnalisé, par exemple en Python, car le roman entier peut être lu dans un dictionnaire Python avec quelques lignes de code. Le fichier JSON peut être alimenté par du texte formaté en HTML ou par le texte brut tel qu'il a été tapé dans les documents du roman.

source: See :ref:`a_manuscript` for more details.
fr: Voir :ref:`a_manuscript` pour plus de détails.

source: You can now define multiple build definitions in the **Build Manuscript** tool. This allows you to define specific settings for various types of draft documents, outline documents, and manuscript formats. See :ref:`a_manuscript` for more details.
fr: Vous pouvez désormais définir plusieurs définitions de construction dans l'outil **Compiler un manuscrit**. Cela vous permet de définir des paramètres spécifiques pour différents types de projets de documents, de documents de synthèse et de formats de manuscrits. Voir :ref:`a_manuscript` pour plus de détails.

source: Project Storage
fr: Stockage du projet
