Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_writing.po
Languages: fr

source: The Editor and Viewer
fr: L'éditeur et l'afficheur

source: This chapter covers in more detail how the document editor and viewer panels work.
fr: Ce chapitre décrit plus en détail le fonctionnement de l'éditeur de documents et des panneaux de visualisation.

source: Editing a Document
fr: Édition d'un document

source: A screenshot of the Document Editor panel.
fr: Capture d'écran du panneau de l'éditeur de documents.

source: To edit a document, double-click it in the project tree, press the :kbd:`Return` key while having it selected, or drag and drop it onto the editor panel. This will open the document in the document editor. The editor uses a Markdown-like syntax for some features, and a novelWriter-specific syntax for others. The syntax format is described in the :ref:`a_fmt` chapter.
fr: Pour éditer un document, double-cliquez dessus dans l'arborescence du projet, appuyez sur la touche :kbd:`Return` lorsqu'il est sélectionné, ou faites-le glisser et déposez-le dans le panneau de l'éditeur. Cela ouvrira le document dans l'éditeur de documents. L'éditeur utilise une syntaxe de type Markdown pour certaines fonctionnalités, et une syntaxe spécifique à novelWriter pour d'autres. Le format de la syntaxe est décrit dans le chapitre :ref:`a_fmt`.

source: The editor has a maximise button, which toggles the **Focus Mode**, and a close button in the top--right corner. On the top--left side you will find a tools button that opens a toolbar with a few buttons for applying text formatting, a drop down menu for navigating between headings, and a search button to open the search dialog.
fr: L'éditeur dispose d'un bouton d'agrandissement, qui permet de basculer en **Mode focus**, et d'un bouton de fermeture dans le coin supérieur droit. En haut à gauche, vous trouverez un bouton « Outils » qui ouvre une barre d'outils avec quelques boutons pour appliquer le formatage du texte, un menu déroulant pour naviguer entre les rubriques, et un bouton « Recherche » pour ouvrir la boîte de dialogue de recherche.

source: Both the document editor and viewer will show the label of the currently open document in the header at the top of the edit or view panel. Optionally, the full project path to the document can be shown. This can be set in **Preferences**.
fr: L'éditeur de documents et la visualisation affichent l'étiquette du document actuellement ouvert dans l'en-tête en haut du panneau d'édition ou de visualisation. En option, le chemin complet du projet vers le document peut être affiché. Cette option peut être définie dans les **Préférences**.

source: Clicking on the document title bar will select the document in the project tree and thus reveal its location there, making it easier to find in a large project.
fr: En cliquant sur la barre de titre du document, vous sélectionnez le document dans l'arborescence du projet et révélez ainsi son emplacement, ce qui permet de le retrouver plus facilement dans un projet volumineux.

source: Any :term:`references<reference>` in the editor can be opened in the viewer by moving the cursor to the label and pressing :kbd:`Ctrl+Return`. You can also control-click them with your mouse.
fr: Tous les :term:`références<reference>` de l'éditeur peuvent être ouverts dans le visualiseur en déplaçant le curseur sur l'étiquette et en appuyant sur :kbd:`Ctrl+Retour`. Vous pouvez également faire un contrôle-clic avec votre souris.

source: Spell Checking
fr: Vérification de l'orthographe

source: A third party library called Enchant is used for spell checking in the editor. The controls for spell checking can be found in the **Tools** menu. You can also set spell checking language in **Project Settings**.
fr: Une bibliothèque tierce appelée Enchant est utilisée pour la vérification orthographique dans l'éditeur. Les commandes de vérification orthographique se trouvent dans le menu **Outils**. Vous pouvez également définir la langue de la vérification orthographique dans **Paramètres du projet**.

source: This spell checking library comes with support for custom words that you can add by selecting "Add Word to Dictionary" from the context menu when a word is highlighted by the spell checker as misspelled. The custom words are managed on a per-project basis, and can the list of words can be edited from the **Project Word List** tool available from the **Tools** menu.
fr: Cette bibliothèque de vérification orthographique prend en charge les mots personnalisés que vous pouvez ajouter en sélectionnant « Ajouter un mot au dictionnaire » dans le menu contextuel lorsqu'un mot est mis en évidence par le vérificateur orthographique comme étant mal orthographié. Les mots personnalisés sont gérés par projet et la liste des mots peut être modifiée à partir de l'outil **Lexique du projet** disponible dans le menu **Outils**.

source: Generally, spell checking dictionaries are collected from your operating system, but on Windows they are not. See :ref:`a_custom_dict` for how to add spell checking dictionaries on Windows.
fr: En général, les dictionnaires de vérification orthographique sont collectés à partir de votre système d'exploitation, mais ce n'est pas le cas sous Windows. Voir :ref:`a_custom_dict` pour savoir comment ajouter des dictionnaires de vérification orthographique sous Windows.

source: Editor Auto-Completer
fr: Auto-complétion de l'éditeur

source: If you type the character ``@`` on a new line, a pop-up menu will appear showing the different available keywords. The list will shorten as you type. Once a keyword command has been selected or typed, the editor may suggest further options based on your project content. See :ref:`a_references_completer` for more details.
fr: Si vous tapez le caractère ``@`` sur une nouvelle ligne, un menu contextuel apparaîtra, affichant les différents mots-clés disponibles. La liste se raccourcit au fur et à mesure que vous tapez. Une fois qu'un mot-clé a été sélectionné ou tapé, l'éditeur peut suggérer d'autres options basées sur le contenu de votre projet. Voir :ref:`a_references_completer` pour plus de détails.

source: Viewing a Document
fr: Visualisation d'un document

source: A screenshot of the Document Viewer panel.
fr: Capture d'écran de la visualisation de documents.

source: Any document in the project tree can also be viewed in parallel in a right hand side document viewer. To view a document, press :kbd:`Ctrl+R`, select **View Document** in the menu or context menu, or drag and drop the document onto the viewer panel. If you have a middle mouse button, middle-clicking on the document will also open it in the viewer.
fr: Tout document de l'arborescence du projet peut également être visualisé en parallèle dans une visionneuse de documents sur le côté droit. Pour visualiser un document, appuyez sur :kbd:`Ctrl+R`, sélectionnez **Afficher ce document** dans le menu ou le menu contextuel, ou glissez-déposez le document sur le panneau de visualisation. Si vous disposez d'un bouton du milieu de la souris, un clic du milieu sur le document l'ouvrira également dans l'afficheur.

source: The document viewed does not have to be the same document as the one currently being edited. However, If you *are* viewing the same document, pressing :kbd:`Ctrl+R` from the editor will update the document with your latest changes. You can also press the reload button in the top--right corner of the viewer panel, next to the close button, to achieve the same thing.
fr: Le document visualisé ne doit pas nécessairement être le même que celui qui est en cours d'édition. Cependant, si vous *voyez* le même document, presser :kbd:`Ctrl+R` depuis l'éditeur mettra à jour le document avec vos dernières modifications. Vous pouvez également appuyer sur le bouton de rechargement dans le coin supérieur droit du panneau de visualisation, à côté du bouton de fermeture, pour obtenir la même chose.

source: In the viewer :term:`references<reference>` become clickable links. Clicking them will replace the content of the viewer with the content of the document the reference points to.
fr: Dans la fenêtre de visualisation, les :term:`références<reference>` deviennent des liens cliquables. En cliquant sur ces liens, le contenu de l'afficheur est remplacé par le contenu du document auquel la référence renvoie.

source: The document viewer keeps a history of viewed documents, which you can navigate with the arrow buttons in the top--left corner of the viewer. If your mouse has backward and forward navigation buttons, these can be used as well. They work just like the backward and forward features in a browser. The left-most button is a dropdown menu for quickly navigation between headings in the document. The edit button on the right will open the viewed document in the editor.
fr: L'afficheur de documents conserve un historique des documents consultés, que vous pouvez parcourir à l'aide des boutons fléchés situés dans le coin supérieur gauche du visualiseur. Si votre souris possède des boutons de navigation vers l'avant et vers l'arrière, vous pouvez également les utiliser. Ils fonctionnent de la même manière que les fonctions de navigation vers l'avant et vers l'arrière d'un navigateur. Le bouton le plus à gauche est un menu déroulant qui permet de naviguer rapidement entre les rubriques du document. Le bouton d'édition situé à droite permet d'ouvrir le document visualisé dans l'éditeur.

source: At the bottom of the view panel there is a **References** panel. (If it is hidden, click the button on the left side of the footer area to reveal it.) This panel contains a References tab with links to all documents referring back to the one you're currently viewing, if any has been defined. If you have created root folders and tags for various story elements like characters and plot points, these will appear as additional tabs in this panel.
fr: En bas du panneau de visualisation se trouve un panneau **Références**. (S'il est caché, cliquez sur le bouton situé à gauche du pied de page pour le faire apparaître). Ce panneau contient un onglet Références avec des liens vers tous les documents qui renvoient à celui que vous êtes en train de visualiser, si un tel document a été défini. Si vous avez créé des dossiers racines et des étiquettes pour divers éléments de l'histoire, tels que les personnages et les points de l'intrigue, ceux-ci apparaîtront sous forme d'onglets supplémentaires dans ce panneau.

source: The **References** panel relies on an up-to-date :term:`index<project index>` of the project. The index is maintained automatically. However, if anything is missing, or seems wrong, the index can always be rebuilt by selecting **Rebuild Index** from the **Tools** menu, or by pressing :kbd:`F9`.
fr: Le panneau **Références** s'appuie sur un :term:`index<project index>` à jour du projet. L'index est maintenu automatiquement. Cependant, si quelque chose manque ou semble erroné, l'index peut toujours être reconstruit en sélectionnant **Reconstruire l'index** dans le menu **Outils**, ou en appuyant sur :kbd:`F9`.

source: The reference panel was redesigned and the additional tabs added.
fr: Le panneau de référence a été redessiné et des onglets supplémentaires ont été ajoutés.

source: Search & Replace
fr: Rechercher & Remplacer

source: A screenshot of the Document Editor search box.
fr: Capture d'écran de la boîte de recherche de l'éditeur de documents.

source: The document editor has a search and replace tool that can be activated with :kbd:`Ctrl+F` for search mode or :kbd:`Ctrl+H` for search and replace mode.
fr: L'éditeur de documents dispose d'un outil de recherche et de remplacement qui peut être activé avec :kbd:`Ctrl+F` pour le mode recherche ou :kbd:`Ctrl+H` pour le mode recherche et remplacement.

source: Pressing :kbd:`Return` while in the search box will search for the next occurrence of the word, and :kbd:`Shift+Return` for the previous. Pressing :kbd:`Return` in the replace box, will replace the highlighted text and move to the next result.
fr: En appuyant sur :kbd:`Retour` dans le champ de recherche, on recherche l'occurrence suivante du mot, et :kbd:`Maj+Retour` l'occurrence précédente. En appuyant sur :kbd:`Retour` dans la zone de remplacement, vous remplacerez le texte surligné et passerez au résultat suivant.

source: There are a number of settings for the search tool available as toggle switches above the search box. They allow you to search for, in order: matched case only, whole word results only, search using regular expressions, loop search when reaching the end of the document, and move to the next document when reaching the end. There is also a switch that will try to match the case of the word when the replacement is made. That is, it will try to keep the word upper, lower, or capitalised to match the word being replaced.
fr: Il existe un certain nombre de paramètres pour l'outil de recherche, disponibles sous forme de commutateurs au-dessus de la boîte de recherche. Ils vous permettent de rechercher, dans l'ordre : la correspondance entre les majuscules et les minuscules, le mot entier uniquement, les expressions régulières, la recherche en boucle lorsque vous atteignez la fin du document et le passage au document suivant lorsque vous atteignez la fin du document. Il existe également un commutateur qui tente de faire correspondre la casse du mot au moment du remplacement. En d'autres termes, il essaiera de conserver le mot en majuscules, en minuscules ou en capitales pour qu'il corresponde au mot remplacé.

source: For more information on the capabilities of the Regular Expression option, see the Qt documentation for the `QRegularExpression <https://doc.qt.io/qt-6/qregularexpression.html>`_ class.
fr: Pour plus d'informations sur les possibilités de l'option Expression régulière, voir la documentation Qt pour la classe `QRegularExpression <https://doc.qt.io/qt-6/qregularexpression.html>`_.

source: Auto-Replace as You Type
fr: Remplacement automatique au fur et à mesure de la saisie

source: A few auto-replace features are supported by the editor. You can control every aspect of the auto-replace feature from **Preferences**. You can also disable this feature entirely if you wish.
fr: Quelques fonctions de remplacement automatique sont prises en charge par l'éditeur. Vous pouvez contrôler tous les aspects de la fonction de remplacement automatique dans les **Préférences**. Vous pouvez également désactiver entièrement cette fonction si vous le souhaitez.

source: If you don't like auto-replacement, all symbols inserted by this feature are also available in the :guilabel:`Insert` menu, and via :ref:`a_kb_ins`. You may also be using a `Compose Key`_ setup, which means you may not need the auto-replace feature at all.
fr: Si vous n'aimez pas l'auto-remplacement, tous les symboles insérés par cette fonctionnalité sont également disponibles dans le menu :guilabel:`Insertion`, et via :ref:`a_kb_ins`. Vous pouvez également utiliser une configuration `Compose Key`_, ce qui signifie que vous n'avez pas du tout besoin de la fonction de remplacement automatique.

source: The editor is able to replace two and three hyphens with short and long dashes, triple points with ellipsis, and replace straight single and double quotes with user-defined quote symbols. It will also try to determine whether to use the opening or closing symbol, although this feature isn't always accurate. Especially distinguishing between closing single quote and apostrophe can be tricky for languages that use the same symbol for these, like English does.
fr: L'éditeur est capable de remplacer deux et trois traits d'union par des tirets courts et longs, les triples points par des points de suspension, et de remplacer les guillemets simples et doubles par des symboles de guillemets définis par l'utilisateur. Il tente également de déterminer s'il faut utiliser le symbole d'ouverture ou de fermeture, bien que cette fonction ne soit pas toujours exacte. En particulier, la distinction entre le guillemet simple fermant et l'apostrophe peut s'avérer délicate dans les langues qui utilisent le même symbole pour ces deux types de guillemets, comme c'est le cas en anglais.

source: If the auto-replace feature changes a symbol when you did not want it to change, pressing :kbd:`Ctrl+Z` once after the auto-replacement will undo it without undoing the character you typed before it.
fr: Si la fonction de remplacement automatique modifie un symbole alors que vous ne le souhaitiez pas, appuyez sur :kbd:`Ctrl+Z` une fois après le remplacement automatique pour l'annuler sans annuler le caractère que vous avez tapé avant lui.

source: Dialogue Highlighting
fr: Mise en évidence du dialogue

source: The editor and viewer can optionally highlight character dialogue in your novel documents. By default, this feature is set to display text in double quotes as dialogue. In **Preferences**, you can change this to support various other dialogue markers that instead uses dashes to indicate dialogue, like those used in Spanish, Portuguese, Polish, etc.
fr: L'éditeur et l'afficheur peuvent optionnellement mettre en évidence les dialogues des personnages dans les documents de votre roman. Par défaut, cette fonctionnalité est configurée pour afficher le texte entre guillemets comme dialogue. Dans les **Préférences**, vous pouvez modifier ce paramètre pour prendre en charge d'autres marqueurs de dialogue qui utilisent des tirets pour indiquer le dialogue, comme ceux utilisés en espagnol, en portugais, en polonais, etc.

source: Various styles are supported by changing the settings under "Text Highlighting" in **Preferences**.
fr: Différents styles sont pris en charge en modifiant les paramètres sous « Surlignage du texte » dans **Préférences**.

source: It is also possible to include the dialogue highlighting in your manuscripts.
fr: Il est également possible d'inclure la mise en évidence du dialogue dans vos manuscrits.
