Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_format.po
Languages: fr

source: Formatting Your Text
fr: Mise en forme du texte

source: The novelWriter text editor is a plain text editor that uses formatting codes for setting meta data values and allowing for some text formatting. The syntax is based on Markdown, but novelWriter is **not** a Markdown editor. It supports basic formatting like emphasis (italic), strong importance (bold) and strike through text, as well as four levels of headings. For some further complex formatting needs, a set of shortcodes can be used.
fr: L'éditeur de texte novelWriter est un éditeur de texte simple qui utilise des codes de formatage pour définir les valeurs des métadonnées et permettre un certain formatage du texte. La syntaxe est basée sur Markdown, mais novelWriter n'est **pas** un éditeur Markdown. Il prend en charge le formatage de base comme les italiques, les gras et les biffures, ainsi que quatre niveaux de titres. Pour des besoins de formatage plus complexes, un ensemble de shortcodes peut être utilisé.

source: In addition to formatting codes, novelWriter allows for comments, a synopsis tag, and a number of keyword and value sets used for :term:`tags<tag>` and :term:`references<reference>`. There are also some codes that apply to whole paragraphs. See :ref:`a_fmt_text` for more details.
fr: Outre les codes de formatage, novelWriter autorise les commentaires, une balise synopsis et un certain nombre de mots-clés et d'ensembles de valeurs utilisés pour :term:`tags<tag>` et :term:`références<reference>`. Certains codes s'appliquent également à des paragraphes entiers. Voir :ref:`a_fmt_text` pour plus de détails.

source: URLs should also be highlighted and become clickable. However, only URLs starting with "http" or "https" are recognised. In the editor, you must hold down the :kbd:`Ctrl` key when clicking a URL to follow it.
fr: Les URL devraient également être mis en évidence et devenir cliquables. Cependant, seules les URL commençant par « http » ou « https » sont reconnues. Dans l'éditeur, vous devez maintenir la touche :kbd:`Ctrl` enfoncée lorsque vous cliquez sur une URL pour la suivre.

source: Syntax Highlighting
fr: Surlignage syntaxique

source: The editor has a syntax highlighter feature that is meant to help you know when you've used the formatting tags or other features correctly. It will change the colour and font size of your headings, change the text colour of emphasised text, and it can also show you where you have dialogue in your text.
fr: L'éditeur dispose d'une fonction de mise en évidence de la syntaxe qui vous permet de savoir si vous avez utilisé correctement les balises de formatage ou d'autres fonctions. Il modifie la couleur et la taille de police de vos titres, change la couleur du texte mis en évidence et peut également vous montrer les endroits où vous avez des dialogues dans votre texte.

source: An example of the colour highlighting of references. "Bob" is not defined, and "@blabla" is not a valid reference type.
fr: Exemple de mise en évidence des références par la couleur. « Bob » n'est pas défini et “@blabla” n'est pas un type de référence valide.

source: When you use the keywords to set tags and references, these also change colour. Correct keywords have a distinct colour, and the references themselves will get a colour if they are valid. Invalid references will get a squiggly error line underneath. The same applies to duplicate tags.
fr: Lorsque vous utilisez les mots-clés pour définir les balises et les références, celles-ci changent également de couleur. Les mots-clés corrects ont une couleur distincte, et les références elles-mêmes ont une couleur si elles sont valides. Les références non valides sont accompagnées d'une ligne d'erreur en pointillés. Il en va de même pour les balises dupliquées.

source: There are a number of syntax highlighter colour themes available, both for light and dark GUIs. You can select them from **Preferences**.
fr: Il existe un certain nombre de thèmes de couleurs pour les surligneurs de syntaxe, à la fois pour les interfaces graphiques claires et foncées. Vous pouvez les sélectionner dans les **Préférences**.

source: Headings
fr: En-têtes

source: An illustration of how heading levels correspond to the novel structure.
fr: Illustration de la correspondance entre les niveaux d'en-têtes et la structure du roman.

source: Four levels of headings are allowed. For :term:`project notes`, they are free to be used as you see fit. That is, novelWriter doesn't assign the different headings any particular meaning. However, for :term:`novel documents` they indicate the structural level of the novel and must be used correctly to produce the intended result. See :ref:`a_struct_heads` for more details.
fr: Quatre niveaux d'en-têtes sont autorisés. Pour :term:`notes de projet`, ils sont libres d'être utilisés comme bon vous semble. En d'autres termes, novelWriter n'attribue pas de signification particulière aux différentes en-têtes. Cependant, pour :term:`documents du roman`, ils indiquent le niveau structurel du roman et doivent être utilisées correctement pour produire le résultat escompté. Voir :ref:`a_struct_heads` pour plus de détails.

source: ``# Title Text``
fr: ``# Texte de titre``

source: Heading level one. For novel documents, the level indicates the start of a new partition. Partitions are for when you want to split your story into "Part 1", "Part 2", etc. You can also choose to use them for splitting the text up into acts, and then hide these headings in your manuscript.
fr: En-tête de niveau un. Pour les documents de type roman, le niveau indique le début d'une nouvelle partition. Les partitions sont utilisées lorsque vous souhaitez diviser votre histoire en « Partie 1 », « Partie 2 », etc. Vous pouvez également choisir de les utiliser pour diviser le texte en actes, puis de masquer ces titres dans votre manuscrit.

source: ``## Title Text``
fr: ``## Texte de titre``

source: Heading level two. For novel documents, the level indicates the start of a new chapter. Chapter numbers can be inserted automatically when building the manuscript.
fr: En-tête de niveau deux. Pour les documents de type roman, le niveau indique le début d'un nouveau chapitre. Les numéros de chapitre peuvent être insérés automatiquement lors de la construction du manuscrit.

source: ``### Title Text``
fr: ``### Texte de titre``

source: Heading level three. For novel documents, the level indicates the start of a new scene. Scene numbers or scene separators can be inserted automatically when building the manuscript, so you can use the title field as a working title for your scenes if you wish, but you must provide a minimal title.
fr: En-tête de niveau trois. Pour les documents de type roman, le niveau indique le début d'une nouvelle scène. Des numéros de scène ou des séparateurs de scène peuvent être insérés automatiquement lors de la construction du manuscrit. Vous pouvez donc utiliser le champ titre comme titre de travail pour vos scènes si vous le souhaitez, mais vous devez fournir un titre minimal.

source: ``#### Title Text``
fr: ``#### Texte de titre``

source: Heading level four. For novel documents, the level indicates the start of a new section. Section titles can be replaced by separators or ignored completely when building the manuscript.
fr: En-tête de niveau quatre. Pour les documents de type roman, le niveau indique le début d'une nouvelle section. Les titres de section peuvent être remplacés par des séparateurs ou ignorés lors de la construction du manuscrit.

source: For headings level one through three, adding a ``!`` modifies the meaning of the heading:
fr: Pour les en-têtes de niveau un à trois, l'ajout d'un ``!`` modifie le sens de l'en-tête :

source: ``#! Title Text``
fr: ``#! Texte de titre``

source: This tells the build tool that the level one heading is intended to be used for the novel or notes folder's main title, like for instance the novel title on the cover page. When building the manuscript, this will use a different styling.
fr: Cela indique à l'outil de compilation que l'en-tête de niveau 1 est destiné à être utilisé pour le titre principal du roman ou du dossier de notes, comme par exemple le titre du roman sur la page de couverture. Lors de la construction du manuscrit, le style sera différent.

source: ``##! Title Text``
fr: ``##! Texte de titre``

source: This tells the build tool to not assign a chapter number to this chapter title if automatic chapter numbers are being used. Such titles are useful for prologues and epilogues for instance. See :ref:`a_struct_heads_unnum` for more details.
fr: Cela indique à l'outil de compilation de ne pas attribuer de numéro de chapitre à ce titre de chapitre si des numéros de chapitre automatiques sont utilisés. De tels titres sont utiles pour les prologues et les épilogues par exemple. Voir :ref:`a_struct_heads_unnum` pour plus de détails.

source: ``###! Title Text``
fr: ``###! Texte de titre``

source: This is an alternative scene heading that can be formatted differently in the **Manuscript Build** tool. It is intended for separating "soft" and "hard" scene breaks. Aside from this, it behaves identically to a regular scene heading. See :ref:`a_struct_heads_scenes` for more details.
fr: Il s'agit d'une en-tête de scène alternatif qui peut être formaté différemment dans l'outil **Compiler le manuscrit**. Il est destiné à séparer les coupures de scène « douces » et « dures ». A part cela, il se comporte de la même manière qu'une en-tête de scène normale. Voir :ref:`a_struct_heads_scenes` pour plus de détails.

source: The space after the ``#`` or ``!`` character is mandatory. The syntax highlighter will change colour and font size when the heading is correctly formatted.
fr: L'espace après le caractère ``#`` ou ``!`` est obligatoire. Le surligneur syntaxique change de couleur et de taille de police lorsque le titre est correctement formaté.

source: Text Paragraphs
fr: Paragraphes du texte

source: A text paragraph is indicated by a blank line. That is, you need two line breaks to separate two fragments of text into two paragraphs. Single line breaks are treated as line breaks within a paragraph.
fr: Un paragraphe de texte est indiqué par une ligne blanche. En d'autres termes, il faut deux sauts de ligne pour séparer deux fragments de texte en deux paragraphes. Les sauts de ligne simples sont traités comme des sauts de ligne à l'intérieur d'un paragraphe.

source: In addition, the editor supports a few additional types of white spaces:
fr: En outre, l'éditeur prend en charge quelques types d'espaces blancs supplémentaires :

source: A non-breaking space can be inserted with :kbd:`Ctrl+K`, :kbd:`Space`.
fr: Un espace insécable peut être inséré avec :kbd:`Ctrl+K`, :kbd:`Espace`.

source: Thin spaces are also supported, and can be inserted with :kbd:`Ctrl+K`, :kbd:`Shift+Space`.
fr: Les espaces courtes sont également supportés, et peuvent être insérés avec :kbd:`Ctrl+K`, :kbd:`Maj+Espace`.

source: Non-breaking thin space can be inserted with :kbd:`Ctrl+K`, :kbd:`Ctrl+Space`.
fr: Une espace courte insécable peut être insérée avec :kbd:`Ctrl+K`, :kbd:`Ctrl+Espace`.

source: These are all insert features, and the **Insert** menu has more. The keyboard shortcuts for them are also listed in :ref:`a_kb_ins`.
fr: Ce sont toutes des fonctions d'insertion, et le menu **Insertion** en propose d'autres. Les raccourcis clavier pour ces fonctions sont également listés dans :ref:`a_kb_ins`.

source: Non-breaking spaces are highlighted by the syntax highlighter with an alternate coloured background, depending on the selected theme.
fr: Les espaces insécables sont mis en évidence par le surligneur syntaxique avec un arrière-plan de couleur différente, en fonction du thème sélectionné.

source: Non-breaking spaces are for instance the correct type of space to separate a number from its unit. Generally, non-breaking spaces are used to prevent line wrapping algorithms from adding line breaks where they shouldn't.
fr: Les espaces insécables sont par exemple le type d'espace correct pour séparer un nombre de son unité. En général, les espaces insécables sont utilisés pour empêcher les algorithmes de retour à la ligne d'ajouter des sauts de ligne là où ils ne le devraient pas.

source: You should not manually apply text indentation in your paragraphs in the editor. These can be added automatically in the **Manuscript Build** tool if you want to have them in the manuscript. Each new paragraph should be separated from the previous content by an empty line and with no indentation.
fr: Vous ne devez pas appliquer manuellement l'indentation du texte dans vos paragraphes dans l'éditeur. Ceux-ci peuvent être ajoutés automatiquement dans l'outil **Compilation du manuscrit** si vous souhaitez qu'ils figurent dans le manuscrit. Chaque nouveau paragraphe doit être séparé du contenu précédent par une ligne vide et sans indentation.

source: Text Emphasis with Markdown
fr: Mise en valeur du texte avec Markdown

source: A minimal set of Markdown text emphasis styles are supported for text paragraphs.
fr: Un ensemble minimal de styles d'accentuation de texte Markdown est pris en charge pour les paragraphes de texte.

source: ``_text_``
fr: ``_texte_``

source: The text is rendered as emphasised text (italicised).
fr: Le texte est rendu en italique.

source: ``**text**``
fr: ``**texte**``

source: The text is rendered as strongly emphasised text (bold).
fr: Le texte est rendu en gras.

source: ``~~text~~``
fr: ``~~texte~~``

source: Strike through text.
fr: Barrer le texte.

source: In Markdown guides it is often recommended to differentiate between strong emphasis and emphasis by using ``**`` for strong and ``_`` for emphasis, although Markdown generally also supports ``__`` for strong and ``*`` for emphasis. However, since the differentiation makes the highlighting and conversion significantly simpler and faster, in novelWriter this is a rule, not just a recommendation.
fr: Dans les guides Markdown, il est souvent recommandé de différencier le gras de l'italique en utilisant ``**`` pour le gras et ``_`` pour l'italique, bien que Markdown supporte également ``__`` pour le gras et ``*`` pour l'italique. Cependant, puisque la différenciation rend la mise en évidence et la conversion significativement plus simple et plus rapide, dans novelWriter il s'agit d'une règle et non d'une simple recommandation.

source: In addition, the following rules apply:
fr: En outre, les règles suivantes s'appliquent :

source: The emphasis and strike through formatting tags do not allow spaces between the words and the tag itself. That is, ``**text**`` is valid, ``**text **`` is not.
fr: Les balises de mise en valeur et de biffage n'autorisent pas les espaces entre les mots et la balise elle-même. Autrement dit, ``**texte**`` est valide, ``**texte **`` ne l'est pas.

source: More generally, the delimiters must be on the outer edge of words. That is, ``some **text in bold** here`` is valid, ``some** text in bold** here`` is not.
fr: Plus généralement, les délimiteurs doivent se trouver aux bords des mots. Autrement dit, « certains **textes en gras** ici » sont valides, « certains** textes en gras** ici » ne le sont pas.

source: If using both ``**`` and ``_`` to wrap the same text, the underscore must be the **inner** wrapper. This is due to the underscore also being a valid word character, so if they are on the outside, they violate rule 2.
fr: Si vous utilisez à la fois ``**`` et ``_`` pour envelopper le même texte, le trait de soulignement doit être à **l'intérieure**. Ceci est dû au fait que le trait de soulignement est également un caractère verbal valide, donc s'il est à l'extérieur, il viole la règle 2.

source: Text emphasis does not span past line breaks. If you need to add emphasis to multiple lines or paragraphs, you must apply it to each of them in turn.
fr: L'accentuation du texte ne s'étend pas au-delà des sauts de ligne. Si vous devez ajouter une emphase à plusieurs lignes ou paragraphes, vous devez l'appliquer à chacun d'entre eux à tour de rôle.

source: Text emphasis can only be used in comments and paragraphs. Headings and meta data tags don't allow for formatting, and any formatting markup will be rendered as-is.
fr: L'accentuation du texte ne peut être utilisée que dans les commentaires et les paragraphes. Les titres et les balises de métadonnées ne permettent pas la mise en forme, et toute marque de mise en forme sera rendue telle quelle.

source: novelWriter supports standard escape syntax for the emphasis markup characters in case the editor misunderstands your intended usage of them. That is, ``\*``, ``\_`` and ``\~`` will generate a plain ``*``, ``_`` and ``~``, respectively, without interpreting them as part of the markup.
fr: novelWriter supporte la syntaxe d'échappement standard pour les caractères d'accentuation au cas où l'éditeur ne comprendrait pas l'usage que vous voulez en faire. C'est-à-dire que ``\*``, ``\_`` et ``\~`` généreront respectivement un ``*``, ``_`` et ``~``, sans les interpréter comme faisant partie du balisage.

source: Formatting with Shortcodes
fr: Mise en forme avec les shortcodes

source: For additional formatting options, you can use shortcodes. Shortcodes is a form of in-line codes that can be used to change the format of the text that follows and opening code, and last until that formatting region is ended with a closing code.
fr: Pour des options de formatage supplémentaires, vous pouvez utiliser des shortcodes. Les shortcodes sont une forme de codes en ligne qui peuvent être utilisés pour modifier le format du texte qui suit le code d'ouverture et qui dure jusqu'à ce que la région de mise en forme soit terminée par un code de fermeture.

source: These shortcodes are intended for special formatting cases, or more complex cases that cannot be solved with simple Markdown-like formatting codes. Available shortcodes are listed below.
fr: Ces shortcodes sont destinés à des cas de formatage spéciaux ou à des cas plus complexes qui ne peuvent pas être résolus avec de simples codes de formatage de type Markdown. Les shortcodes disponibles sont énumérés ci-dessous.

source: Shortcodes Formats
fr: Formats des shortcodes

source: Syntax
fr: Syntaxe

source: ``[b]text[/b]``
fr: ``[b]texte[/b]``

source: Text is rendered as bold text.
fr: Le texte est rendu en gras.

source: ``[i]text[/i]``
fr: ``[i]texte[/i]``

source: Text is rendered as italicised text.
fr: Le texte est rendu en italique.

source: ``[s]text[/s]``
fr: ``[s]texte[/s]``

source: Text is rendered as strike through text.
fr: Le texte est rendu sous forme de texte barré.

source: ``[u]text[/u]``
fr: ``[u]texte[/u]``

source: Text is rendered as underlined text.
fr: Le texte est rendu sous forme de texte souligné.

source: ``[m]text[/m]``
fr: ``[m]texte[/m]``

source: Text is rendered as highlighted text.
fr: Le texte est rendu en surbrillance.

source: ``[sup]text[/sup]``
fr: ``[sup]texte[/sup]``

source: Text is rendered as superscript text.
fr: Le texte est rendu en exposant.

source: ``[sub]text[/sub]``
fr: ``[sub]texte[/sub]``

source: Text is rendered as subscript text.
fr: Le texte est rendu sous forme d'indice.

source: Unlike Markdown style codes, these can be used anywhere within a paragraph. Even in the middle of a word if you need to. You can also freely combine them to form more complex formatting.
fr: Contrairement aux codes de style Markdown, ces codes peuvent être utilisés n'importe où dans un paragraphe. Même au milieu d'un mot si nécessaire. Vous pouvez également les combiner librement pour obtenir une mise en forme plus complexe.

source: The shortcodes are available from the **Format** menu and in the editor toolbar, which can be activated by clicking the left-most icon button in the editor header.
fr: Les shortcodes sont disponibles dans le menu **Format** et dans la barre d'outils de l'éditeur, qui peut être activée en cliquant sur l'icône la plus à gauche dans l'en-tête de l'éditeur.

source: Shortcodes are not processed until you generate a preview or generate a manuscript document. So there is no highlighting of the text between the formatting markers. There is also no check that your markers make sense. You must ensure that you have both the opening and closing formatting markers where you want them.
fr: Les shortcodes ne sont pas traités tant que vous n'avez pas généré un aperçu ou un document manuscrit. Il n'y a donc pas de mise en évidence du texte entre les marqueurs de formatage. Il n'y a pas non plus de vérification de la logique de vos marqueurs. Vous devez vous assurer que les marqueurs de formatage d'ouverture et de fermeture se trouvent à l'endroit voulu.

source: Comments and Synopsis
fr: Commentaires et synopsis

source: In addition to the above formatting features, novelWriter also allows for comments in documents. The text of a comment is always ignored by the word counter. The text can also be filtered out when building the manuscript or viewing the document.
fr: En plus des fonctions de formatage ci-dessus, novelWriter permet également d'insérer des commentaires dans les documents. Le texte d'un commentaire est toujours ignoré par le compteur de mots. Le texte peut également être filtré lors de la construction du manuscrit ou de la visualisation du document.

source: The first word of a comment, followed by a colon, can be one of a set of modifiers that indicates the comment is intended for a specific purpose. For instance, if the comment starts with ``Synopsis:``, the comment is treated in a special manner and will show up in the :ref:`a_ui_outline` in a dedicated column. The word ``synopsis`` is not case sensitive. If it is correctly formatted, the syntax highlighter will indicate this by altering the colour of the word.
fr: Le premier mot d'un commentaire, suivi de deux points, peut faire partie d'une série de modificateurs qui indiquent que le commentaire est destiné à un usage spécifique. Par exemple, si le commentaire commence par ``Synopsis:``, le commentaire est traité d'une manière spéciale et apparaîtra dans le :ref:`a_ui_outline` dans une colonne dédiée. Le mot ``synopsis`` n'est pas sensible à la casse. S'il est correctement formaté, le surligneur syntaxique l'indiquera en modifiant la couleur du mot.

source: The different styles of comments are as follows:
fr: Les différents styles de commentaires sont les suivants :

source: ``% Your comment text ...``
fr: ``% Le texte de votre commentaire ...``

source: This is a comment. The text is not rendered by default (this can be overridden), seen in the document viewer, or counted towards word counts. It is intended for you to make notes in your text for your own sake, whatever that may be, that isn't part of the story text. This is the general format of a comment.
fr: Il s'agit d'un commentaire. Le texte n'est pas rendu par défaut (il est possible d'y déroger), n'est pas visible dans la vue des documents et n'est pas pris en compte dans le décompte des mots. Il est destiné à vous permettre de prendre des notes dans votre texte pour votre propre intérêt, quel qu'il soit, et qui ne fait pas partie du texte de l'histoire. Voici le format général d'un commentaire.

source: ``%Synopsis: Your synopsis text ...``
fr: ``%Synopsis: Votre texte de synopsis ...``
