Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage_format.po
Languages: fr

source: This is a synopsis comment. It is generally treated in the same way as a regular comment, except that it is also captured by the indexing algorithm and displayed in the :ref:`a_ui_outline`. It can also be filtered separately when building the project to for instance generate an outline document of the whole project.
fr: Il s'agit d'un commentaire de synopsis. Il est généralement traité de la même manière qu'un commentaire normal, sauf qu'il est également capturé par l'algorithme d'indexation et affiché dans :ref:`a_ui_outline`. Il peut également être filtré séparément lors de la construction du projet pour, par exemple, générer un document de synopsis de l'ensemble du projet.

source: ``%Short: Your short description ...``
fr: ``%Short: Votre courte description ...``

source: This is a short description comment. It is identical to the synopsis comment (they are interchangeable), but is intended to be used for project notes. The text shows up in the Reference panel below the document viewer in the last column labelled **Short Description**.
fr: Il s'agit d'un commentaire de description courte. Il est identique au commentaire de synopsis (ils sont interchangeables), mais il est destiné à être utilisé pour les notes de projet. Le texte apparaît dans le panneau Référence, sous la vue de documents, dans la dernière colonne intitulée **Description sommaire**.

source: ``%Footnote.<key>: Your footnote text ...``
fr: ``%Footnote.<key>: Votre texte de note de bas de page ...``

source: This is a special comment assigned to a footnote marker. See :ref:`a_fmt_footnote` for how to use them in your text.
fr: Il s'agit d'un commentaire spécial attribué à un marqueur de note de bas de page. Voir :ref:`a_fmt_footnote` pour savoir comment les utiliser dans votre texte.

source: Only one comment can be flagged as a synopsis or short comment for each heading. If multiple comments are flagged as synopsis or short comments, the last one will be used and the rest ignored.
fr: Un seul commentaire peut être marqué comme synopsis ou description sommaire pour chaque rubrique. Si plusieurs commentaires sont marqués comme synopsis ou Descriptions sommaires, le dernier sera utilisé et les autres ignorés.

source: Footnotes
fr: Notes de bas de page

source: Footnotes are added with a shortcode, paired with a matching comment for the actual footnote text. The matching is done with a key that links the two. If you insert a footnote from the **Insert** menu, a unique key is generated for you.
fr: Les notes de bas de page sont ajoutées à l'aide d'un shortcode, associé à un commentaire correspondant au texte de la note. La correspondance se fait à l'aide d'une clé qui lie les deux. Si vous insérez une note de bas de page à partir du menu **Insérer**, une clé unique est générée pour vous.

source: The insert feature will add the footnote shortcode marker at the position of your cursor in the text, and create the associated footnote comment right after the paragraph, and move the cursor there so you can immediately start typing the footnote text.
fr: La fonction d'insertion ajoutera le marqueur du shortcode de la note de bas de page à l'endroit où se trouve votre curseur dans le texte, créera le commentaire de la note de bas de page associée juste après le paragraphe et déplacera le curseur à cet endroit pour que vous puissiez immédiatement commencer à taper le texte de la note de bas de page.

source: The footnote comment can be anywhere in the document, so if you wish to move them to, say, the bottom of the text, you are free to do so.
fr: Le commentaire de la note de bas de page peut se trouver n'importe où dans le document, de sorte que si vous souhaitez le placer, par exemple, au bas du texte, vous êtes libre de le faire.

source: Footnote keys are only required to be unique within a document, so if you copy, move or merge text, you must make sure the keys are not duplicated. If you use the automatically generated keys from the **Insert** menu, they are unique among all indexed documents. They are not guaranteed to be unique against footnotes in the Archive or Trash folder though, but the chance of accidentally generating the same key twice in a project is relatively small in the first place (1 in 810 000).
fr: Les clés de notes de bas de page ne doivent être uniques qu'à l'intérieur d'un document. Par conséquent, si vous copiez, déplacez ou fusionnez du texte, vous devez vous assurer que les clés ne sont pas dupliquées. Si vous utilisez les clés générées automatiquement à partir du menu **Insérer**, elles sont uniques parmi tous les documents indexés. Il n'est pas garanti qu'elles soient uniques par rapport aux notes de bas de page du dossier Archives ou Corbeille, mais le risque de générer accidentellement la même clé deux fois dans un projet est relativement faible (1 sur 810 000).

source: This is what a footnote inserted into a paragraph may look like when completed:
fr: Voici à quoi peut ressembler une note de bas de page insérée dans un paragraphe une fois terminée :

source: Ignored Text
fr: Texte ignoré

source: If you want to completely ignore some of the text in your documents, but are not ready to delete it, you can add ``%~`` before the text paragraph or line. This will cause novelWriter to skip the text entirely when generating previews or building manuscripts.
fr: Si vous souhaitez ignorer complètement une partie du texte dans vos documents, mais que vous n'êtes pas prêt à l'effacer, vous pouvez ajouter ``%~`` devant le paragraphe ou la ligne de texte. Cela permettra à novelWriter d'ignorer complètement le texte lors de la génération d'aperçus ou de la construction de manuscrits.

source: This is a better way of removing text than converting them to regular comments, as you may want to include regular comments in your previews or draft manuscript.
fr: Il s'agit d'un meilleur moyen de supprimer le texte que de le convertir en commentaires normaux, car vous souhaiterez peut-être inclure des commentaires normaux dans vos prévisualisations ou votre projet de manuscrit.

source: You can toggle the ignored text feature on and off for a paragraph by pressing :kbd:`Ctrl+Shift+D` on your keyboard with your cursor somewhere in the paragraph.
fr: Vous pouvez activer ou désactiver la fonction de texte ignoré pour un paragraphe en appuyant sur :kbd:`Ctrl+Maj+D` sur votre clavier avec votre curseur quelque part dans le paragraphe.

source: Example:
fr: Exemple :

source: Tags and References
fr: Tags et références

source: The document editor supports a set of keywords used for setting tags, and making references between documents based on those tags.
fr: L'éditeur de documents prend en charge un ensemble de mots-clés utilisés pour définir des balises et faire des références entre les documents sur la base de ces balises.

source: You must use the keyword ``@tag:`` to define a tag. The tag can be set once per section defined by a heading. Setting it multiple times under the same heading will just override the previous setting.
fr: Vous devez utiliser le mot-clé ``@tag:`` pour définir une balise. La balise peut être définie une fois par section définie par une en-tête. Si vous la définissez plusieurs fois dans la même rubrique, elle remplacera la précédente.

source: ``@tag: value``
fr: ``@tag: valeur``

source: A tag keyword followed by the tag value, like for instance the name of a character.
fr: Un mot-clé de balise suivi de la valeur de la balise, comme par exemple le nom d'un personnage.

source: References can be set anywhere within a section, and are collected according to their category. References are on the form:
fr: Les références peuvent être placées n'importe où dans une section et sont rassemblées en fonction de leur catégorie. Les références se trouvent sur le formulaire :

source: ``@keyword: value1, value2, ..., valueN``
fr: ``@mot clé: valeur1, valeur2, ..., valeurN``

source: A reference keyword followed by a value, or a comma separated list of values.
fr: Un mot-clé de référence suivi d'une valeur ou d'une liste de valeurs séparées par des virgules.

source: Tags and references are covered in detail in the :ref:`a_references` chapter. The keywords can be inserted at the cursor position in the editor via the **Insert** menu. If you start typing an ``@`` on a new line, and auto-complete menu will also pop up suggesting keywords.
fr: Les balises et les références sont traitées en détail dans le chapitre :ref:`a_references`. Les mots-clés peuvent être insérés à la position du curseur dans l'éditeur via le menu **Insérer**. Si vous commencez à taper un ``@`` sur une nouvelle ligne, un menu d'auto-complétion apparaîtra également pour suggérer des mots-clés.

source: Paragraph Alignment and Indentation
fr: Alignement et indentation des paragraphes

source: All documents have the text by default aligned to the left or justified, depending on your setting in **Preferences**.
fr: Le texte de tous les documents est par défaut aligné à gauche ou justifié, selon les paramètres définis dans les **Préférences**.

source: You can override the default text alignment on individual paragraphs by specifying alignment tags. These tags are double angle brackets. Either ``>>`` or ``<<``. You put them either before or after the paragraph, and they will "push" the text towards the edge the brackets point towards. This should be fairly intuitive.
fr: Vous pouvez remplacer l'alignement par défaut du texte sur des paragraphes individuels en spécifiant des balises d'alignement. Ces balises sont des doubles chevrons. Il peut s'agir de ``>>`` ou de ``<<``. Vous les placez avant ou après le paragraphe, et elles « pousseront » le texte vers le bord vers lequel les crochets pointent. Cela devrait être assez intuitif.

source: Indentation uses a similar syntax. But here you use a single ``>`` or ``<`` to push the text away from the edge.
fr: L'indentation utilise une syntaxe similaire. Mais ici, vous utilisez un seul ``>`` ou ``<`` pour éloigner le texte du bord.

source: Examples:
fr: Exemples :

source: Text Alignment and Indentation
fr: Alignement et indentation du texte

source: ``>> Right aligned text``
fr: ``>> Texte aligné à droite``

source: The text paragraph is right-aligned.
fr: Le paragraphe est aligné à droite.

source: ``Left aligned text <<``
fr: ``Texte aligné à gauche <<``

source: The text paragraph is left-aligned.
fr: Le paragraphe est aligné à gauche.

source: ``>> Centred text <<``
fr: ``>> Texte centré <<``

source: The text paragraph is centred.
fr: Le paragraphe est centré.

source: ``> Left indented text``
fr: ``> Texte en retrait à gauche``

source: The text has an increased left margin.
fr: Le texte a une marge gauche plus importante.

source: ``Right indented text <``
fr: ``Texte en retrait à droite <``

source: The text has an increased right margin.
fr: Le texte a une marge droite plus importante.

source: ``> Left/right indented text <``
fr: ``> Texte indenté gauche/droite <```

source: The text has both margins increased.
fr: Les deux marges du texte ont été augmentées.

source: The text editor will not show the alignment and indentation live. But the viewer will show them when you open the document there. It will of course also be reflected in the document generated from the manuscript build tool as long as the format supports paragraph alignment.
fr: L'éditeur de texte n'affiche pas l'alignement et l'indentation en direct. Mais l'afficheur les affichera lorsque vous y ouvrirez le document. Ils seront bien sûr également reflétés dans le document généré par l'outil de création de manuscrits, à condition que le format prenne en charge l'alignement des paragraphes.

source: Alignment with Line Breaks
fr: Alignement avec les sauts de ligne

source: If you have line breaks in the paragraph, the markers for all the lines are combined and used for the entire paragraph. For the following text, all lines will be centred:
fr: Si le paragraphe comporte des retours à la ligne, les marqueurs de toutes les lignes sont combinés et utilisés pour l'ensemble du paragraphe. Pour le texte suivant, toutes les lignes seront centrées :

source: Alignment with First Line Indent
fr: Alignement sur le retrait de la première ligne

source: If you have first line indent enabled in your Manuscript build settings, you probably want to disable it for text in verses. Adding any alignment tags will cause the first line indent to be switched off for that paragraph.
fr: Si vous avez activé le retrait de première ligne dans les paramètres de conpilation de votre Manuscrit, vous voudrez probablement le désactiver pour le texte des versets. L'ajout de balises d'alignement entraînera la désactivation du retrait de première ligne pour ce paragraphe.

source: The following text will always be aligned against the left margin:
fr: Le texte suivant sera toujours aligné sur la marge de gauche :

source: Vertical Space and Page Breaks
fr: Espace vertical et sauts de page

source: You can apply page breaks to partition, chapter and scene headings for novel documents from the **Manuscript Build** tool. If you need to add a page break or additional vertical spacing in other places, there are special codes available for this purpose.
fr: Vous pouvez appliquer des sauts de page aux en-têtes de partition, de chapitre et de scène pour les documents de roman à partir de l'outil **Compiler le manuscrit**. Si vous avez besoin d'ajouter un saut de page ou un espacement vertical supplémentaire à d'autres endroits, il existe des codes spéciaux à cet effet.

source: Adding more than one line break between paragraphs will **not** increase the space between those paragraphs when building the project. To add additional space between paragraphs, add the text ``[vspace]`` on a line of its own, and the build tool will insert a blank paragraph in its place.
fr: L'ajout de plus d'un saut de ligne entre les paragraphes n'augmentera **pas** l'espace entre ces paragraphes lors de la compilation du projet. Pour ajouter de l'espace entre les paragraphes, ajoutez le texte ``[vspace]`` sur une ligne distincte, et l'outil de ccompilation insérera un paragraphe vide à sa place.

source: If you need multiple blank paragraphs just add a colon and a number to the above code. For instance, writing ``[vspace:3]`` will insert three blank paragraphs.
fr: Si vous avez besoin de plusieurs paragraphes vides, il suffit d'ajouter deux points et un chiffre au code ci-dessus. Par exemple, en écrivant ``[vspace:3]``, vous insérerez trois paragraphes vides.

source: If you need to add a page break somewhere, put the text ``[new page]`` on a line by itself before the text you wish to start on a new page.
fr: Si vous devez ajouter un saut de page quelque part, placez le texte ``[new page]`` sur une ligne isolée avant le texte que vous souhaitez faire commencer sur une nouvelle page.

source: The page break code is applied to the text that follows it. It adds a "page break before" mark to the text when exporting to HTML or Open Document. This means that a ``[new page]`` which has no text following it, it will not result in a page break.
fr: Le code de saut de page est appliqué au texte qui le suit. Il ajoute une marque de « saut de page avant » au texte lors de l'exportation vers HTML ou Open Document. Cela signifie qu'une ``[ new page]`` qui n'est suivie d'aucun texte n'entraînera pas de saut de page.

source: **Example:**
fr: **Exemple:**

source: Inserting Word Counts in the Text
fr: Insérer le nombre de mots dans le texte

source: The cover page of a manuscript normally has the word count stated on it. Any statistics value collected by novelWriter can be inserted into any document. You can generate the code for this from the **Insert** menu under **Word/Character Count**.
fr: La page de couverture d'un manuscrit indique normalement le nombre de mots. Toute valeur statistique collectée par novelWriter peut être insérée dans n'importe quel document. Vous pouvez générer le code pour cela à partir du menu **Insérer** sous **Compte de mots/caractères**.

source: The value inserted is the actual count for your entire manuscript, so it is not populated until you run the **Manuscript Build** tool. Until then they will show up as "0" in the viewer panel.
fr: La valeur insérée est le nombre réel pour l'ensemble de votre manuscrit, elle n'est donc pas renseignée tant que vous n'avez pas exécuté l'outil **Compilation du manuscrit**. Jusqu'à ce moment-là, ils apparaîtront sous la forme d'un « 0 » dans le panneau de visualisation.
