Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage/advanced_formatting.po
Languages: fr

source: Advanced Formatting
fr: Mise en forme avancée

source: Standard Markdown formatting is somewhat limited, so novelWriter has some additional formatting codes for special use cases. These codes are all based on brackets, and some allow an additional value to be set after a colon.
fr: Le formatage Markdown standard est quelque peu limité, c'est pourquoi novelWriter dispose de quelques codes de formatage supplémentaires pour des cas d'utilisation particuliers. Ces codes sont tous basés sur les crochets, et certains permettent de définir une valeur supplémentaire après les deux points.

source: This section covers all these formatting codes.
fr: Cette section couvre tous ces codes de formatage.

source: Formatting with Shortcodes
fr: Mise en forme avec les shortcodes

source: For basic formatting, like emphasis, you should use the standard Markdown style formatting tags descried in :ref:`docs_usage_basics_emphasis` whenever possible.
fr: Pour le formatage de base, comme la mise en valeur, vous devriez utiliser les balises de formatage standard du style Markdown décrites dans :ref:`docs_usage_basics_emphasis` chaque fois que possible.

source: For additional formatting options, you can use shortcodes. Shortcodes is a form of in-line codes that wrap the section of text to be formatted. Shortcodes can be nested to apply multiple formats to the same piece of text.
fr: Pour des options de formatage supplémentaires, vous pouvez utiliser des shortcodes. Les shortcodes sont une forme de codes en ligne qui enveloppent la section de texte à mettre en forme. Les shortcodes peuvent être imbriqués pour appliquer plusieurs formats à la même partie de texte.

source: These shortcodes are intended for special formatting cases, or more complex cases that cannot be solved with simple Markdown-like formatting codes. Available shortcodes are listed below.
fr: Ces shortcodes sont destinés à des cas de formatage spéciaux ou à des cas plus complexes qui ne peuvent pas être résolus avec de simples codes de formatage de type Markdown. Les shortcodes disponibles sont énumérés ci-dessous.

source: Shortcodes Formats
fr: Formats des shortcodes

source: Syntax
fr: Syntaxe

source: ``[b]text[/b]``
fr: ``[b]texte[/b]``

source: Text is displayed as bold text.
fr: Le texte est affiché en gras.

source: ``[i]text[/i]``
fr: ``[i]texte[/i]``

source: Text is displayed as italicised text.
fr: Le texte est affiché en italique.

source: ``[s]text[/s]``
fr: ``[s]texte[/s]``

source: Text is displayed as strike through text.
fr: Le texte est affiché sous forme de texte barré.

source: ``[u]text[/u]``
fr: ``[u]texte[/u]``

source: Text is displayed as underlined text.
fr: Le texte est affiché sous forme de texte souligné.

source: ``[m]text[/m]``
fr: ``[m]texte[/m]``

source: Text is displayed as highlighted text.
fr: Le texte est affiché en surbrillance.

source: ``[sup]text[/sup]``
fr: ``[sup]texte[/sup]``

source: Text is displayed as superscript text.
fr: Le texte est affiché en exposant.

source: ``[sub]text[/sub]``
fr: ``[sub]texte[/sub]``

source: Text is displayed as subscript text.
fr: Le texte est affiché en indice.

source: ``[footnote:key]``
fr: ``[footnote:clé]``

source: A reference to a :ref:`footnote comment <docs_usage_comments_footnotes>`.
fr: Une référence à un :ref:`commentaire de note de bas de page <docs_usage_comments_footnotes>`.

source: Unlike Markdown style codes, these can be used anywhere within a paragraph. Even in the middle of a word if you need to. You can also freely combine them to form more complex formatting.
fr: Contrairement aux codes de style Markdown, ces codes peuvent être utilisés n'importe où dans un paragraphe. Même au milieu d'un mot si nécessaire. Vous pouvez également les combiner librement pour obtenir une mise en forme plus complexe.

source: The shortcodes are available from the **Format** menu and in the editor toolbar, which can be activated by clicking the left-most icon button in the editor header.
fr: Les shortcodes sont disponibles dans le menu **Format** et dans la barre d'outils de l'éditeur, qui peut être activée en cliquant sur l'icône la plus à gauche dans l'en-tête de l'éditeur.

source: Shortcodes are not processed until you generate a preview or generate a manuscript document. So there is no highlighting of the text between the formatting markers. There is also no check that your markers make sense. You must ensure that you have both the opening and closing formatting markers where you want them.
fr: Les shortcodes ne sont pas traités tant que vous n'avez pas généré un aperçu ou un document manuscrit. Il n'y a donc pas de mise en évidence du texte entre les marqueurs de formatage. Il n'y a pas non plus de vérification de la logique de vos marqueurs. Vous devez vous assurer que les marqueurs de formatage d'ouverture et de fermeture se trouvent à l'endroit voulu.

source: Vertical Space and Page Breaks
fr: Espace vertical et sauts de page

source: You can apply page breaks to partition, chapter and scene headings for novel documents from the **Manuscript Build** tool. If you need to add a page break or additional vertical spacing in other places, there are special codes available for this purpose.
fr: Vous pouvez appliquer des sauts de page aux en-têtes de partition, de chapitre et de scène pour les documents de roman à partir de l'outil **Compiler le manuscrit**. Si vous avez besoin d'ajouter un saut de page ou un espacement vertical supplémentaire à d'autres endroits, il existe des codes spéciaux à cet effet.

source: Adding more than one line break between paragraphs will **not** increase the space between those paragraphs when generating a manuscript document. To add additional space between paragraphs, add the text ``[vspace]`` on a line of its own, and the **Manuscript Build** tool will insert a blank paragraph in its place.
fr: L'ajout de plus d'un saut de ligne entre les paragraphes n'augmentera **pas** l'espace entre ces paragraphes lors de la génération d'un document manuscrit. Pour ajouter de l'espace entre les paragraphes, ajoutez le texte ``[vspace]`` sur une ligne distincte, et l'outil **Compilation du manuscrit** insérera un paragraphe vide à sa place.

source: If you need multiple blank paragraphs just add a colon and a number to the above code. For instance, writing ``[vspace:3]`` will insert three blank paragraphs.
fr: Si vous avez besoin de plusieurs paragraphes vides, il suffit d'ajouter deux points et un chiffre au code ci-dessus. Par exemple, en écrivant ``[vspace:3]``, vous insérerez trois paragraphes vides.

source: If you need to add a page break somewhere, put the text ``[new page]`` on a line by itself before the text you wish to start on a new page.
fr: Si vous devez ajouter un saut de page quelque part, placez le texte ``[ new page]`` sur une ligne isolée avant le texte que vous souhaitez faire commencer sur une nouvelle page.

source: The page break code is applied to the text that follows it. It adds a "page break before" mark to the text when exporting to HTML or Open Document. This means that a ``[new page]`` code which has no text following it will not result in a page break.
fr: Le code de saut de page est appliqué au texte qui le suit. Il ajoute une marque de « saut de page avant » au texte lors de l'exportation vers HTML ou Open Document. Cela signifie qu'un code ``[ new page]`` qui n'est suivi d'aucun texte n'entraînera pas de saut de page.

source: :bdg-info:`Example`
fr: :bdg-info:`Exemple`

source: Inserting Word Counts in the Text
fr: Insérer le nombre de mots dans le texte

source: The cover page of a manuscript normally has the word count stated on it. Any statistics value collected by novelWriter can be inserted into any document using a special shortcode. You can insert the code for any of the available statistics values from the **Insert** menu under **Word/Character Count**.
fr: La page de couverture d'un manuscrit indique normalement le nombre de mots. Toute valeur statistique collectée par novelWriter peut être insérée dans n'importe quel document à l'aide d'un shortcode spécial. Vous pouvez insérer le code pour n'importe quelle valeur statistique disponible dans le menu **Insérer** sous **Nombre de mots/caractères**.

source: The value inserted is the actual count for your entire manuscript, so it is not populated until you run the **Manuscript Build** tool. Until then they will show up as "0" in the viewer panel.
fr: La valeur insérée est le nombre réel pour l'ensemble de votre manuscrit, elle n'est donc pas renseignée tant que vous n'avez pas exécuté l'outil **Compilation du manuscrit**. Jusqu'à ce moment-là, ils apparaîtront sous la forme d'un « 0 » dans le panneau de visualisation.

source: The available codes are:
fr: Les codes disponibles sont les suivants :

source: Stats Shortcodes
fr: Shortcodes de statistiques

source: Characters
fr: Personnages

source: Characters in Text
fr: Caractères dans un texte

source: Characters in Headings
fr: Caractères dans les titres

source: Paragraphs
fr: Paragraphes

source: Headings
fr: En-têtes

source: Characters, No Spaces
fr: Caractères, sans les espaces

source: Characters in Text, No Spaces
fr: Caractères dans le texte, sans les espaces

source: Characters in Headings, No Spaces
fr: Caractères dans les titres, sans les espaces

source: Words
fr: Mots

source: Words in Text
fr: Mots dans le texte

source: Words in Headings
fr: Mots dans les entêtes

source: This is an example cover page. A similar page is automatically generated when you create a new project.
fr: Il s'agit d'un exemple de page de couverture. Une page similaire est automatiquement générée lorsque vous créez un nouveau projet.
