Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage/front_back_matter.po
Languages: fr

source: Front and Back Matter
fr: Premières et dernières pages

source: Front and back matter documents are documents that go before and after your main story text. They can include pages like your cover page, content tables, prologues, epilogues, etc. These special pages and sections are supported to some extent by novelWriter.
fr: Les documents de début et de fin sont des documents qui précèdent et suivent le texte principal de l'histoire. Il peut s'agir de pages comme la page de couverture, de tables des matières, de prologues, d'épilogues, etc. Ces pages et sections spéciales sont prises en charge dans une certaine mesure par novelWriter.

source: The Title Page
fr: La page de titre

source: It is recommended that you add a document at the very top of each **Novel** root folder with the novel title in it. You should modify the level 1 heading format code with an ``!`` in order to render it as a document title that is excluded from any automatic Table of Content in a manuscript build document.
fr: Il est recommandé d'ajouter un document au premier niveau de chaque dossier racine **Roman** avec le titre du roman. Vous devez modifier le code de format de l'en-tête de niveau un avec un ``!`` afin de le rendre comme un titre de document qui est exclu de toute table des matières automatique lors de la compilation du manuscrit.

source: You can also add the author name and address above this if this is required by the manuscript format you use, and additional space added before the title.
fr: Vous pouvez également ajouter le nom et l'adresse de l'auteur au-dessus de ce titre si le format de manuscrit que vous utilisez l'exige, et ajouter un espace supplémentaire avant le titre.

source: :bdg-info:`Example`
fr: :bdg-info:`Exemple`

source: This is the title page novelWriter generates automatically for a new project as of version 2.6:
fr: Il s'agit de la page de titre que novelWriter génère automatiquement pour un nouveau projet à partir de la version 2.6 :

source: The title is by default centred on the page. You can add more text to the page as you wish, like for instance the author's name and details.
fr: Le titre est par défaut centré sur la page. Vous pouvez ajouter plus de texte à la page si vous le souhaitez, comme par exemple le nom de l'auteur et ses coordonnées.

source: The default title page inserts the word count for text only, but you can add other counts too. See :ref:`docs_usage_formatting_counts` for more details.
fr: La page de titre par défaut insère le nombre de mots pour le texte uniquement, mais vous pouvez également ajouter d'autres décomptes. Voir :ref:`docs_usage_formatting_counts` pour plus de détails.

source: Additional Pages
fr: Pages additionnelles

source: If you want an additional page of text after the title page, starting on a fresh page, you can add ``[new page]`` on a line by itself, and continue the text after it. This will insert a page break before the text. See :ref:`docs_usage_formatting_breaks` for more details.
fr: Si vous voulez une page de texte supplémentaire après la page de titre, commençant sur une nouvelle page, vous pouvez ajouter ``[ new page]`` sur une ligne à part, et continuer le texte après elle. Cela insérera un saut de page avant le texte. Voir :ref:`docs_usage_formatting_breaks` pour plus de détails.

source: Unnumbered Chapters
fr: Chapitres non numérotés

source: If you use the automatic numbering feature for your chapters, but you want to keep some special chapters separate from this, you can add an ``!`` to the level 2 heading formatting code to tell the build tool to skip these chapters when adding numbers.
fr: Si vous utilisez la numérotation automatique pour vos chapitres, mais que vous voulez garder certains chapitres spéciaux séparés, vous pouvez ajouter un `!` au code de formatage des titres de niveau deux pour indiquer à l'outil de compilation d'ignorer ces chapitres lors de l'ajout des numéros.

source: Unnumbered chapters are useful for prologue and epilogue chapters, and also for interlude chapters if you use those in your text. There is a separate formatting feature for such chapter titles in the **Manuscript Build** tool. See the :ref:`docs_ui_manuscript` page for more details.
fr: Les chapitres non numérotés sont utiles pour les prologues et les épilogues, ainsi que pour les interludes si vous en utilisez dans votre texte. Il existe une fonction de formatage séparée pour ces titres de chapitre dans l'outil **Compilation du manuscrit**. Voir la page :ref:`docs_ui_manuscript` pour plus de détails.
