Repository: deszczowy/novelWriter
Catalog: docs/source/locales/*/LC_MESSAGES/usage/introduction.po
Languages: fr

source: In a nutshell, novelWriter is a plain text editor that lets you organise one or more novels and associated notes as many smaller documents. You can at any time generate standard document formats from these plain text documents. Whether it is an outline of your story, a draft, a complete manuscript, or even a collection of your character notes or other notes.
fr: En bref, novelWriter est un éditeur de texte brut qui vous permet d'organiser un ou plusieurs romans et les notes associées sous la forme de plusieurs petits documents. Vous pouvez à tout moment générer des formats de documents standard à partir de ces documents en texte brut. Qu'il s'agisse d'une ébauche de votre histoire, d'un brouillon, d'un manuscrit complet ou même d'une collection de notes sur les personnages ou d'autres notes.

source: Why Plain Text?
fr: Pourquoi du texte brut ?

source: The idea is to let you be creative without having to deal with formatting while you are writing, or be distracted by it.
fr: L'idée est de vous permettre d'être créatif sans avoir à vous préoccuper de la mise en forme pendant que vous écrivez, ou sans être distrait par elle.

source: Of course, you probably need *some* form of minimal formatting for your text. At the very least you need emphasis. Most people are familiar with adding emphasis using ``_underscores_`` and ``**asterisks**``. This formatting standard comes from Markdown_ and is supported by novelWriter. It also uses Markdown formatting for defining document headings, which is how you distinguish between chapters and scenes.
fr: Bien entendu, vous avez probablement besoin d'une sorte de mise en forme minimale pour votre texte. Au minimum, vous avez besoin d'une mise en valeur. La plupart des gens sont familiers avec l'ajout d'emphase en utilisant ``_underscores_`` et ``**asterisks**``. Ce standard de formatage vient de Markdown_ et est supporté par novelWriter. Il utilise également le formatage Markdown pour définir les titres du document, ce qui permet de faire la distinction entre les chapitres et les scènes.

source: For those special cases where you need more complex formatting, a set of shortcodes are available. To make these codes easier to use, a dropdown button bar is available in the editor panel with standard format buttons. So don't worry. You don't have to learn any of these codes.
fr: Pour les cas particuliers où vous avez besoin d'un formatage plus complexe, un ensemble de shortcodes est disponible. Pour faciliter l'utilisation de ces codes, une barre de boutons déroulante est disponible dans le panneau de l'éditeur avec des boutons de formatage standard. Ne vous inquiétez donc pas. Vous n'avez pas besoin d'apprendre ces codes.

source: Adding Meta Data
fr: Ajout de métadonnées

source: In addition to the body text of your story, novelWriter allows you to enter some additional meta data into your text documents to indicate things like which characters are present in a chapter or scene, whose point of view we're seeing, what location the events take place in, and so on.
fr: Outre le corps du texte de votre histoire, novelWriter vous permet de saisir des métadonnées supplémentaires dans vos documents texte afin d'indiquer les personnages présents dans un chapitre ou une scène, le point de vue de chacun, le lieu où se déroulent les événements, etc.

source: Since the editor is plain text, this is done on special lines of text starting with an ``@`` character. The editor will show an auto-complete menu to help you write these lines. We will talk more about this later.
fr: Comme l'éditeur est en texte brut, cela se fait sur des lignes de texte spéciales commençant par le caractère ``@``. L'éditeur affichera un menu d'auto-complétion pour vous aider à écrire ces lignes. Nous en reparlerons plus tard.

source: You can also add your own author's comments in your text, without these comments becoming a part of the story itself. A comment line starts with a ``%`` character. There are different types of comments, and an auto-complete menu can help you here too. More about this later as well.
fr: Vous pouvez également ajouter vos propres commentaires d'auteur dans votre texte, sans que ces commentaires fassent partie de l'histoire elle-même. Une ligne de commentaire commence par le caractère ``%``. Il existe différents types de commentaires, et un menu d'auto-complétion peut vous aider ici aussi. Nous y reviendrons plus tard.

source: Limitations
fr: Restrictions

source: Please keep in mind that novelWriter is designed for writing fiction, so the formatting features available are limited to those relevant for this purpose. It is *not* suitable for technical writing. It is also *not* a full-featured Markdown editor.
fr: Gardez à l'esprit que novelWriter est conçu pour l'écriture de fictions, et que les fonctions de formatage disponibles sont donc limitées à celles qui sont pertinentes à cette fin. Il n'est *pas* adapté à la rédaction technique. Ce n'est pas non plus un éditeur Markdown complet.

source: In addition, novelWriter is not intended as a tool for organising research for writing, and therefore lacks formatting features you may need for this purpose. The notes feature in is mainly intended for character profiles and plot outlines. It is recommended to use a proper note-taking tool for research. This is anyway more practical as you may use the same research for multiple projects.
fr: En outre, novelWriter n'est pas conçu comme un outil d'organisation de la recherche en vue de l'écriture, et ne dispose donc pas des fonctions de formatage dont vous pourriez avoir besoin à cette fin. La fonction de notes est principalement destinée aux profils de personnages et aux grandes lignes de l'intrigue. Il est recommandé d'utiliser un outil de prise de notes approprié pour la recherche. C'est de toute façon plus pratique, car vous pouvez utiliser la même recherche pour plusieurs projets.
